{"review_id": 1, "restaurant_id": -14, "username": "BoinkVal", "date_of_visit": " October 2019", "rating": "4", "title": "Loved this for breakfast!", "comment": "I didn’t stay at the hotel but at an adjacent one. I walked over every morning to get my porridge and latte fix.  The fact that I came back every morning was a testament of how much I loved the place. The light coming through the restaurant was a high point - enjoying breakfast with a view.  I loved the porridge given the options I had and they ensured it was just right - from how hot it was down to getting the sweetness and consistency right.  I’m a fussy latte drinker. The team got it just right - a light roast bean that was brewed to the right level.", "date_of_review": "22 October 2019"}
{"review_id": 2, "restaurant_id": -14, "username": "chezzcc", "date_of_visit": " October 2019", "rating": "5", "title": "Stunning food, simple menu, relaxed vibe good background jazz", "comment": "We have eaten here twice now, and will soon be back. The menu is simple but stunning; super value for central London and the staff are super friendly and helpful. Seating very comfy, plenty of cushions and soft jazz in background. ", "date_of_review": "20 October 2019"}
{"review_id": 3, "restaurant_id": -14, "username": "joostd630", "date_of_visit": " December 2019", "rating": "2", "title": "Disappointing", "comment": "We had Christmas dinner here. Service was van ok and friendly. Food is average, nothing special (turkey extremely dry, curry with hardly any sauce), prices are however extremely high, 55 pounds for 3 course dinner is way too expensive for the offer. Not recommended for visit.", "date_of_review": "26 December 2019"}
{"review_id": 4, "restaurant_id": -14, "username": "ridabade", "date_of_visit": " July 2019", "rating": "5", "title": "Surpassed Expectations!", "comment": "Had a great time yesterday! Service was great and our waitress was very knowledgable! The food was AMAZINGGGGG!! Highly recommend!", "date_of_review": "25 July 2019"}
{"review_id": 5, "restaurant_id": -14, "username": "Lise H", "date_of_visit": " September 2019", "rating": "4", "title": "Great Atmosphere, Enjoyable Dinner!", "comment": "We stopped by for dinner, our hotel was nearby, we ordered a great bottle of wine, our food was amazing and service was great,,,,all you can want!", "date_of_review": "31 October 2019"}
{"review_id": 6, "restaurant_id": -14, "username": "may002015", "date_of_visit": " October 2020", "rating": "5", "title": "Today was my first time going", "comment": "Today was my first time going to the restaurant at lunch time the staff was friendly restaurant was clean , food was delicious I would be back to this lovely friendly restaurant I highly recommend this place . The managers was lovely everyone in the restaurant was really friendly and helpful. ", "date_of_review": "14 October 2020"}
{"review_id": 7, "restaurant_id": -14, "username": "RudyPolfliet", "date_of_visit": " August 2019", "rating": "1", "title": "Overpriced, ridiculous portions, service disappointing", "comment": "Please stay away. De food was not bad I admit , but the portions versus the price were ridiculous. service was terrible. i asked for a ice bucket since the rose wine was far too warm. I received abucket with beneath some ice and the bottle on top. So the last ml of the wine was nice cold . The other 90 % was warm. 12 % service was added. What service ??? We had starters . No bread was on the table. I had to ask for it. The burrata which tasted good came with 4 miniscule slices of tomato . This is atourist trap and I do not trust the scores of tripadvisor on this. Never again will I come back .", "date_of_review": "2 August 2019"}
{"review_id": 8, "restaurant_id": -14, "username": "joesmit", "date_of_visit": " November 2020", "rating": "5", "title": "AMAZING FOOD AND BEST SERVICE ", "comment": "I went with my girlfriend for our anniversary, what a lovely choise!!  We've been looked after since we arrived, we had a lovely and very attentive service from the italian Restaurant Manager Andrea. Lovely food and best service!  FULLY RECCOMENDEND We'll definetly be back!!", "date_of_review": "1 November 2020"}
{"review_id": 9, "restaurant_id": -14, "username": "Lisa H", "date_of_visit": " December 2019", "rating": "4", "title": "apps and drinks", "comment": "Lovely spot with excellent service. We stopped in for a drink and appetizers, sat at the bar and received wonderful service. It was a nice change from pubs serving beer wine and a set list of cocktails only. ", "date_of_review": "17 December 2019"}
{"review_id": 10, "restaurant_id": -14, "username": "Amina W", "date_of_visit": " February 2020", "rating": "3", "title": "Great location, venue but shame about menu", "comment": "Meal for four on a very cold evening and welcomed by warm and friendly hosts into a cool and well thought out restaurant. Good selection of wines to suit all budgets. Menu for what must be a state of the art kitchen in a newish building and hotel was woefully disappointing. Starters all very tasty, pasta bland and tasteless as was the pear and blue cheese pizza, shavings of fennel and pear with a sparse crumbling of cheese was also bland. Monk fish curry faired much better as did the burger. Please please try harder. The place deserves tastier food. Staff were all superb and professional.", "date_of_review": "11 February 2020"}
{"review_id": 11, "restaurant_id": -14, "username": "RH0s", "date_of_visit": " July 2019", "rating": "4", "title": "A Very Good Hotel Restaurant", "comment": "We stayed at the Bankside four nights and had a very early dinner at the Art Yard when we arrived and ate breakfast on three of our mornings. We enjoyed the food and the service. They do seem a bit understaffed but the managers pick up when needed. The burger I had was good; the fries that accompanied it were better. We skipped the 20 GBP buffet breakfast and found ordering smaller items made more sense. We'd recommend the porridge, the bacon, and one benedict rather than two. The side of hash browns was also good.", "date_of_review": "24 July 2019"}
{"review_id": 12, "restaurant_id": -14, "username": "futtock21", "date_of_visit": " November 2018", "rating": "4", "title": "Bar and Kitchen with some art on one wall", "comment": "Art Yard Bar & Kitchen was a bit deserted this Sunday lunchtime. I had to check at the reception of the swish Marriott hotel at the south side of Blackfriars Bridge of which it forms a part that it was actually open. I wasn't sure because a late October opening heralded in Hot Dinners had been put back to an unspecified date in November. There was no menu outside the hotel but, having been seated at a table near the bar with a view of St. Paul's through the window of a bar behind, the one we were given matched the one on the website. The chef kindly offered two dishes as a substitute for a lack (as yet) of a children's menu, namely a small portion of chicken escalope or the spaghetti with tomato sauce my daughter chose. She is a very fussy eater often not finishing dishes but gave this dish of thick strips of pasta with miniature tomatoes the thumbs up by finishing the last mouthful. Some flatbread we ordered as a starter was fairly ordinary, but the (mainly) monkfish cataplana (stew), ceremoniously served in a tureen the lid of which the waitress had to unhinge on two sides in order to remove it, was impressive, particularly in terms of the quality of its ingredients, featuring not only monkfish but also scallops, and even octopus tentacles in a saffron infused broth with sliced new potatoes and the occasional chilli. A 2/3rds pint of pale ale accompanied my potion nicely. My daughter's two scoops of chocolate ice cream were too much for her so we ended up sharing. Coffees were strong. Service from a waiter who came from Hungary was as charming as it was efficient. The art covering part of one wall only was not as extensive as I had predicted.", "date_of_review": "11 November 2018"}
{"review_id": 13, "restaurant_id": -14, "username": "linniecampbell", "date_of_visit": " December 2018", "rating": "5", "title": "Amazing Place", "comment": "We went here for dinner during an overnight stopover in London and it is fabulous! Very new, with a beautiful layout, and friendly staff. The menu consists of small plates, snacks and main courses, so we went for a tapas approach with a selection of the small plates. They were all delicious but the standouts were the Anchovies Fritti with lemon and sage and the Beesand scallop with Jerusalem Artichoke and garlic butter. They were so good we ordered seconds. Alex and the staff are really professional in their approach without being in any way stuffy. We had a most delightful evening and shall have to find an excuse to travel all the way to London from Scotland in order to go back there.", "date_of_review": "30 December 2018"}
{"review_id": 14, "restaurant_id": -14, "username": "Gabs_Garcia", "date_of_visit": " October 2018", "rating": "5", "title": "Kudos to the rarebit burger", "comment": "The rarebit burger was incredibly tasty. The place in itself is an ode to good taste and design. Just to have a beer there is worth going. Service was unbelievable friendly, maybe because we were only few people there on that day? Mind you we were a few months ago when the place had just recently opened but still everything left a fantastic impression on us. So much so that we are planning to go sometime soon to see if the place has gone from strength to strength.", "date_of_review": "14 January 2019"}
{"review_id": 15, "restaurant_id": -14, "username": "DFC19", "date_of_visit": " January 2019", "rating": "5", "title": "Outstanding! Perfect in every way.", "comment": "Wow! The service was outstanding (and perfectly prompt). The carrots came in a heavy white sauce; the burger was perfect for the kids. The sirloin was cooked and seasoned as it should but the stand out were the beetroot salad, chopped salad and bone marrow. Each was some creativity but with our being too fancy.", "date_of_review": "1 January 2019"}
{"review_id": 16, "restaurant_id": -14, "username": "finedinerStAlbans", "date_of_visit": " January 2019", "rating": "5", "title": "Beautiful in all respects", "comment": "My second visit since the opening, was so impressed on our first visit, wanted to check it wasn’t a one off - it wasn’t. The staff are plentiful, professional, knowledgable and friendly. The decor is fabulous, very eclectic and modern. The food however is the best thing about this place - highlights yesterday were the anchovy and sage Fritti - amazing little bites of intense savouriness. The cuttlefish, chorizo and spelt risotto is fantastic - smoky and unctious. The best thing though was the goose liver parfait on brioche with chicken crisp - absolutely sublime. Just go - you won’t be dissappointed.", "date_of_review": "26 January 2019"}
{"review_id": 17, "restaurant_id": -14, "username": "michela697", "date_of_visit": " January 2019", "rating": "5", "title": "London's Latest Coucine by Art Yard", "comment": "Art Yard at Bankside Hotel hast to offer the most welcoming setting at the latest's Marriot Collection. From the interior desig to the most presentable dishes and cocktails. An space for business, privacy, good taste and dinner's lovers.", "date_of_review": "14 January 2019"}
{"review_id": 18, "restaurant_id": -14, "username": "235danp", "date_of_visit": " May 2019", "rating": "5", "title": "Excellent food and service ", "comment": "Exceeded my expectations for a hotel restaurant. I was staying at Bankside and had breakfast and 3 out of 4 dinners at the hotel during my stay. I ordered omelettes every morning for breakfast and had the chopped salad and rump steak for dinners. The food was presented well and fresh and tasty. The service was consistently strong whether at breakfast or dinner.", "date_of_review": "24 May 2019"}
{"review_id": 19, "restaurant_id": -14, "username": "Notioneer", "date_of_visit": " June 2019", "rating": "2", "title": "Soulless", "comment": "Firstly, ignore all the reviews that have been posted so far. You can spot gushing reviews from mates of the marketing department a mile off. Art Yard is predictable for a restaurant at the bottom of a newly built office block. It tries to infuse character but it all looks and feels a bit formulaic. As far as the food goes, from what we had, very small pizzas, dried up salad and 'frites' that would have been easier to eat if they had been slivers of wood (dried up spikey little things, and cold). Not my first choice but, fancying chips, I really didn't want the 'chips in dripping' option (in this day and age?!).  As for the rest, I wasn't quite sure why the charmless manager served us wearing a jumper yet was happy to leave the front door wide open for a fresh gale to come in. Putting himself in the customer's shoes clearly wasn't on his agenda. A rather odd choice is the seating. It's quite low and soft, you wouldn't want to be a small person, slightly more upright chairs would be better. At the end of the day, Art Yard is aimed squarely at business clients, it's a 'safe' place to go for work - just don't expect to be wowed.", "date_of_review": "27 June 2019"}
