{"review_id": 1, "restaurant_id": -15, "username": "LondonDollygirl", "date_of_visit": " February 2020", "rating": "5", "title": "30th Birthday event", "comment": "Just want to thank golden bee for giving us a great experience this Saturday, the venue is lush and the customer service was spot on. Later on in the night they played abit of RNB which was amazing and great music all night. The bouncers where so friendly they even had a little dance with us.  Special thanks to Paige who was always around making sure we had the best time. Can’t wait to come again. Xx", "date_of_review": "4 February 2020"}
{"review_id": 2, "restaurant_id": -15, "username": "Brink1992", "date_of_visit": " July 2020", "rating": "5", "title": "The best bar in shoreditch!", "comment": "By far my favourite bar in shoreditch.. always good vibes, good music, friendly staff! Over all great night! Parlow is the best manager ever!", "date_of_review": "12 July 2020"}
{"review_id": 3, "restaurant_id": -15, "username": "shirla2016", "date_of_visit": " March 2020", "rating": "1", "title": "Do not waste your money there at all ", "comment": "The people at the door aren't friendly at all. They'll force you into taking photos of your face before you go in the venue! ", "date_of_review": "7 March 2020"}
{"review_id": 4, "restaurant_id": -15, "username": "gb2212", "date_of_visit": " July 2020", "rating": "5", "title": "No problem", "comment": "I went to Golden Bee Saturday night their first opening since lockdown. Roof was only open but all the ppe measures were in place and I felt very safe. It was not as busy as usual due to restrictions. The door staff were very pleasant and we had no problems at all. Maybe the door security has changed due to the previous reviews I have seen. They have a great new feature wall with Bee Happy neon and we all had our photos done by it before entering the roof. Please try this little niche as its a fab place with great cocktails. Highly recommended.", "date_of_review": "10 July 2020"}
{"review_id": 5, "restaurant_id": -15, "username": "Annielou3089", "date_of_visit": " February 2020", "rating": "4", "title": "Fun night", "comment": "I celebrated my friends 30th at Golden Bee on Saturday, they’re was a big group of us and we was in there all night! we had a table on the roof terrace and had a great night it had a great atmosphere and good music. Shall definitely go again and recommend :) thank you xx", "date_of_review": "4 February 2020"}
{"review_id": 6, "restaurant_id": -15, "username": "jczin", "date_of_visit": " December 2019", "rating": "4", "title": "Second visit here ", "comment": "Second visit here and again was an entertaining evening. Wide range of beer and an assortment of music. Party time with lots of Christmas tunes as well. Food provided for our event was of excellent quality. ", "date_of_review": "23 December 2019"}
{"review_id": 7, "restaurant_id": -15, "username": "L2139HB", "date_of_visit": " November 2019", "rating": "1", "title": "Don’t go to this bar your be beaten up when you leave (men or women)", "comment": "The behaviour of your bouncers last night was disgusting, how they treated a group of people who were out on a couples night out. To be punched and kicked in an unprovoked attack by your bouncers. Not just men being hurt but woman too, waking up this morning to cuts and bruises all over their faces. You should be ashamed to call yourself a business who lets customers get beaten up for no reason. Bouncers should be there to protect you but instead they are the ones hurting people. Makes me sick, hope you get shut up for the abuse you have put on people.", "date_of_review": "24 November 2019"}
{"review_id": 8, "restaurant_id": -15, "username": "697oumaymad", "date_of_visit": " July 2020", "rating": "5", "title": "Best customer service ever", "comment": "Amazing place amazing rooftop!  But especially amazing customer service!  Especially the bartender Nora, so sweet and so patient and very understanding!!! Would come back asap!", "date_of_review": "29 July 2020"}
{"review_id": 9, "restaurant_id": -15, "username": "911nyc911nyc", "date_of_visit": " August 2020", "rating": "5", "title": "Best rooftop in London!", "comment": "Best rooftop in London! Great crowd, great drinks, great staff and a fire pit - what more could you want!", "date_of_review": "1 August 2020"}
{"review_id": 10, "restaurant_id": -15, "username": "FarAway675697", "date_of_visit": " November 2019", "rating": "1", "title": "Disgrace of a place", "comment": "Terrible place where the bouncers physically abuse customers whether there male or female for no reason! It’s as if they get a kick out of it. Holding back my friend whilst the other punches him in the face. They also do this outside of the premises so it’s not caught on camera! Men handling girls by the neck! Awful", "date_of_review": "24 November 2019"}
{"review_id": 11, "restaurant_id": -15, "username": "KLavelle1", "date_of_visit": " August 2020", "rating": "3", "title": "Nice coctails - horrible door lady", "comment": "We came a few weeks ago - The bar itself is nice and the cocktails are good however my experience was ruined by the rude, unprofessional lady on the door.  She took every enjoyment in being on a power trip with her clipboard and trying to make us girls feel silly when asking about a booking that we had made, she was rude and obnoxious to the point that my friends and I were in utter disbelief, I thought I was back at school. If i had been on a date and she had spoken to me like that i would have felt humiliated, we would not go back because of her. its a shame because the bar itself is nice and we would have had a nice time there if it wasnt for her, she really ruined our evening. she was maybe in her 30's and had a louis vuitton bag on.", "date_of_review": "28 September 2020"}
{"review_id": 12, "restaurant_id": -15, "username": "ReeceReviews93", "date_of_visit": " August 2019", "rating": "5", "title": "Worth a visit", "comment": "Nice welcoming staff, Golden bee being the favourite cocktail to order, didn’t realise you had to book to go to the rooftop area but luckily we were called over and were allowed to go upstairs making my birthday even better(they didn’t know is was my birthday) hopefully they don’t get in trouble for doing this, thank you so much, we will be back soon and will be booking upstairs!", "date_of_review": "12 August 2019"}
{"review_id": 13, "restaurant_id": -15, "username": "lisa m", "date_of_visit": " August 2019", "rating": "2", "title": "Nice little place but the service let’s them down", "comment": "Visited the bee for a 40th Birthday. The place was nice with a lovely roof bar, cocktails good but sadly there were a few things that let the venue down. My friend had a little guest list but unfortunately some the guests were turned away even tho a few people had left & not packed, her pleads were turned down even when she was in tears, she had no choice but to leave early to join the guests in another venue, the arrogance of the door staff lost the venue a lot of money in drinks the people who left would have spent at the venue. Security rude when another friend left the roof top bar & was bluntly told if you leave you won’t get back in, she didn’t plan on going back up but the comments were unnecessary. I paid cash for a round of drink the second by card, the bar staff do not give you the chip machine to check & found my card on looking at my statement has been deducted more money than the price of the drink, I guess this can be lucrative tip making for an evening as the person may not be aware until too late. The platter that cost my friend £75 consist of two little slates of sushi, so please be aware you will not get that much so maybe don’t bother as this is enough to feed just a few people & a rip off. The venue is nice for a drink if a couple of people go & just be aware of the issues they have, for a big birthday? If you have a few friends don’t bother as most will not be able to celebrate with you & can ruin your evening.", "date_of_review": "13 August 2019"}
{"review_id": 14, "restaurant_id": -15, "username": "mit73", "date_of_visit": " September 2019", "rating": "5", "title": "Lovely place, friendly staff and welcoming door staff", "comment": "Visited on Saturday night and had a wonderful night. Plenty of drinks a lovely atmosphere and friendly staff. We went on the roof top just for some fresh air and finish our drinks as it was hot in there. Lovely venue and friendly staff", "date_of_review": "11 September 2019"}
{"review_id": 15, "restaurant_id": -15, "username": "casperdoggy", "date_of_visit": " September 2019", "rating": "2", "title": "over officious staff", "comment": "Went to a corporate event on the roof. Unfriendly door staff and a menacing attitude. Unpleasant atmosphere.", "date_of_review": "21 September 2019"}
{"review_id": 16, "restaurant_id": -15, "username": "LadyAvalon18", "date_of_visit": " October 2019", "rating": "5", "title": "Birthday drinks ", "comment": "Went here on Saturday night with a mixed group of friends ( also mixed ages ) Had a fab , relaxed night . There's s great vibe in the place , and the staff were very attentive and friendly .  At one point there was a bit of trouble at the bar ( I'm sure an isolated incident) but it was dealt with quickly & efficiently. The venue totally suited us & the Clientele were definitely on our wave length as was the music . Will happily visit again , THANK YOU .", "date_of_review": "21 October 2019"}
{"review_id": 17, "restaurant_id": -15, "username": "819chelseyp", "date_of_visit": " November 2019", "rating": "1", "title": "Will never recommend or return", "comment": "Came here on Saturday for my friends birthday. She made a reservation on the roof top bar. Night was okay and then all of a sudden several bouncers came over stating one of our party had fell asleep and if he does it again then they will kick us out. Fair enough so we carried on with our night. The guy they were talking about didn’t fall asleep again he was chatting to his friend and then five minutes later they decided to kick us out anyway. No explanation. Ruined the entire birthday. I could understand if anyone caused trouble or fell asleep again but it was random. Disgusted by the behaviour of the bouncers and looking at other reviews seems they have a lot of issues regarding who they have working for them. Seems as if we spent a lot of money at the bar for a few hours and they just took our money and kicked us out before we could even go downstairs. One of the bouncers was apparently called “wolf”. Atmosphere was rowdy in the bar too coming from other parties. Maybe they should have focused their attention there. ", "date_of_review": "10 November 2019"}
{"review_id": 18, "restaurant_id": -15, "username": "sallyjames91", "date_of_visit": " November 2019", "rating": "3", "title": "Nice venue - one very rude member of staff!", "comment": "I visited Golden bee last Saturday (2nd November) and had a good time, enjoyed the music and there was a good vibe. Unfortunately there was a female bouncer (European, brown hair) that was extremely rude for no good reason. She was standing by the rooftop stairs not letting people up due to it being so busy up there (so she said). This would have been fair enough but she was unnecessarily rude to everyone waiting!  She started off by saying no one was allowed up with no explanation, when my partner asked why this was she started asking why he would ask this and didn’t like that he asked at all! (Does she not know how customer service works?) We decided to let her be and continued to wait. I then noticed that she was letting lots of people up the stairs so I asked her (politely) if there was any reason why certain people were allowed up and we weren’t, and this is when she flipped! She started shouting at me saying “Are you telling me how to do my job” and “why do you think you can question me”!!  I couldn’t believe it!! I asked her to calm down and she still carried on even when I stopped talking. If I’m honest, if I wasn’t here for a friends birthday I would have gone somewhere else.  I also noticed her being just as rude to other people, so it wasn’t just me and my partner Appalled that someone like this has a customer facing job - this woman definitely needs an office job!", "date_of_review": "4 November 2019"}
{"review_id": 19, "restaurant_id": -15, "username": "FILIPPO D", "date_of_visit": " August 2019", "rating": "3", "title": "Rooftop bar", "comment": "Stayed for one drink. Good vibes but was expecting better rooftop views but yeah all in all nice place for a summer evening drink ", "date_of_review": "1 September 2019"}
{"review_id": 20, "restaurant_id": -15, "username": "E77QI", "date_of_visit": " November 2019", "rating": "1", "title": "Nice place but horrible bouncers ", "comment": "We booked a table for a birthday party. Later on, I went outside to say goodbye to my friend leaving. The bouncers would not let me re enter as this apparently was policy. However, no one told me this when I stepped outside. If so we would have said goodbye in the hallway. I was left outside for 40 min, with the bouncers laughing at me, until finally my boyfriend came to look for me. Then we left. Shame to end a birthday party like that. ", "date_of_review": "12 November 2019"}
{"review_id": 21, "restaurant_id": -15, "username": "S S", "date_of_visit": " June 2019", "rating": "1", "title": "Confused- barman was hiding the card machine so we couldn’t see the payment!", "comment": "Very confused. Went to Golden bee with 2 of my friends- rooftop was full so we were on the floor just below. We all found that everytime we’d go and order our drinks, the barman would face the card machine away from our faces, really high up so we couldn’t see what price he was charging us. This happened 4 times before I asked him to show me how much I’m paying. The screen showed £10 and my drink was £11. Principle is a well known bar shouldn’t be conning their customers like this, it’s truly disgusting and I’m confident this is what he was doing- not sure why as the extra money would be going to the bar, not him.. unless the bar are asking their staff to take advantage of drunk people? (I wasn’t- it was about 8pm on Saturday) Last time at this place that’s for sure.", "date_of_review": "24 June 2019"}
{"review_id": 22, "restaurant_id": -15, "username": "esha_12345", "date_of_visit": " May 2019", "rating": "1", "title": "Disgusting behaviour by the bouncers", "comment": "Went for my birthday.. Lovely place and ambience. Though as much as I appreciate bouncers doing their job, they should also be able to provide answers. They chucked a person from my group out, when I went to check on him my only question to the second bouncer was ‘what did he do’? Apparently this was too disrespectful for him to hear and he told me to apologise or I can’t go back inside either. It’s Disgusting abuse of power. Slowly the rest of our Friends came to check up on us and the bouncers chucked them out too. Hmm suspicious racist behaviour here as mentioned by several other reviews about the bouncers at this place.  The funny bit is, people that didn’t even know us, saw what happened and had a word with the bouncers saying they are being unreasonable. No one here had caused any trouble. It’s horrible to think towards the end of the night when all the Money is made they don’t care about service anymore.  Try to learn how to give an answer, it may be your job to Chuck people out but justifying why would be helpful too. Don’t abuse your power to make people you don’t like to apologise for nonsense.  P.s. to the staff of golden bee that tends to reply to these reviews. I’ve seen you don’t tend to take criticism well and tend to send quite nasty replies back. It might be worth taking some criticisms on-board and reviewing things.  The horrible attitude back here in a form of reply does not help your customers. Thanks for trying to ruin our celebration.", "date_of_review": "25 May 2019"}
{"review_id": 23, "restaurant_id": -15, "username": "jjlh201", "date_of_visit": " May 2019", "rating": "1", "title": "Worst rooftop in London ", "comment": "Tries to be a bar where people go to be “seen” but is actually cheaply finished and very grimy. Rude members of staff. Worst gin and tonic I have ever had and severely overpriced.", "date_of_review": "31 May 2019"}
{"review_id": 24, "restaurant_id": -15, "username": "skylinejet", "date_of_visit": " May 2019", "rating": "4", "title": "Good rooftop vibes", "comment": "Cocktails are pretty tasty for 10 quid, vibes are great on the rooftop. Staff are quick to make drinks and quite efficient.", "date_of_review": "8 May 2019"}
{"review_id": 25, "restaurant_id": -15, "username": "doodle_caz", "date_of_visit": " July 2019", "rating": "4", "title": "Birthday drinks ", "comment": "Had a great time! After reading a lot of negative reviews had been worried it might not be a good place for birthday celebrations but all the staff were very helpful, even when we turned up an hour late for our booking they still let us in and the bar staff helped us with our reservation. Roof top was lovely, drinks great and not too crowded. Would definitely go back, ignore the negative reviews!", "date_of_review": "15 July 2019"}
{"review_id": 26, "restaurant_id": -15, "username": "mortajamar", "date_of_visit": " July 2019", "rating": "1", "title": "Worst manager I've ever met.", "comment": "The manager was so arrogant, distant and disrespectful towards me that I left the local and I will never trust in that franchise again. Cant say much about the food or drinks, couldnt even order.", "date_of_review": "20 July 2019"}
{"review_id": 27, "restaurant_id": -15, "username": "Minah K", "date_of_visit": " May 2019", "rating": "5", "title": "Best rooftop terrace in London!", "comment": "Came here yesterday evening for birthday drinks and had booked a table for 20 - the process is super easy. Ambience is amazing as always, with staff being really friendly and kind (that's primarily my reason for writing the review as I don't understand the negativity towards the staff). At one point I thought i lost my phone and the bouncer literally turned the place upside down just to help me! All the bar staff were hilarious and lots of fun. Overall a great night, we felt so welcomed and can easily say it's the best rooftop bar in London after having been to quite a few!", "date_of_review": "18 May 2019"}
{"review_id": 28, "restaurant_id": -15, "username": "Nuala-Erin C", "date_of_visit": " August 2019", "rating": "5", "title": "Blown away!!!", "comment": "By far the best rooftop bar in London. Hands Down!! Lovely views and great drinks. The staff were brilliant and attentive. Couldn’t ask for more. Special thanks To Daniel and Paolo.", "date_of_review": "3 August 2019"}
{"review_id": 29, "restaurant_id": -15, "username": "Lauren H", "date_of_visit": " August 2019", "rating": "3", "title": "Fun but bad attitudes from barmen", "comment": "Just celebrated a friend’s 30th birthday at Golden Bee. I have been before and found it to be good fun, and it was last night but it was the usual London attitude of barmen which sadly doesn’t allow this bar top marks. My boyfriend was ordering drinks all night and being given single vodka and lemonades. We then went up another time and the barman assumed he wanted a double and when we said no we wanted a single he proceeded to be arrogant and rude towards us saying ‘there’s a sign over there stating this’. I don’t mean to be funny but I didn’t notice any sign and even when he pointed it out you would have to be up close to actually read it. I don’t care what place you are, customer service is always important and you shouldn’t be allowed to talk to customers in the way that he did, making us feel thick for not noticing a sign. At the end of the day, it’s a money making scheme. You should ask whether someone wants a single or double. Not just assume they want a double unless they mention otherwise. When we said we only want a single he wouldn’t give us another drink and made us pay for it. Really don’t appreciate attitudes like this at all. Just apologise and say oh I’m sorry let me get you another drink. We’re the ones paying for it after all!", "date_of_review": "11 August 2019"}
{"review_id": 30, "restaurant_id": -15, "username": "RRicardoUK", "date_of_visit": " September 2018", "rating": "1", "title": "nice e rooftop until dangerous", "comment": "Nice rooftop.  Could be dangerous to life. Bouncers act unpunished and at will, even law is very specific don't know how they manage. Suppose some other deals we don't know with people in power. I gots lucky. Even offered no response got a broken wrist, surgery, 2 titanium plates, several Screws and 30% hand movement recovered. As a musician, well something I could pass.", "date_of_review": "21 July 2019"}
{"review_id": 31, "restaurant_id": -15, "username": "487dulced", "date_of_visit": " April 2019", "rating": "1", "title": "Worse experience ever", "comment": "We visited the bar in person to reserve a table and sushi dinner for a special birthday. We were told to make the reservation online so we followed the procedure and booked online. On the day, an hour after we arrived, we were rudely told that we didn’t pay for the order in advance (even though they confirmed the dinner via email in the reservation confirmation and failed to mention that we needed to prepay to have dinner). After already waiting an hour (and getting hungrier as it was after work dinner) we went to the bar to try and pay for dinner and once again, they refused to let us pay. The manager was very unapologetic and did not kindly help us to make alternatives, so finally we ended up ordering from Deliveroo!! Which Is obviously ridiculous!. It’s a nice venue, but the manager treated us in a rude, unhelpful and unprofessional manner, he made us feel unwelcome and uncomfortable. We will never come back ", "date_of_review": "30 April 2019"}
{"review_id": 32, "restaurant_id": -15, "username": "mariev964", "date_of_visit": " February 2019", "rating": "4", "title": "Loved it! ", "comment": "Amazing place to spend a Friday night. Went there for after work drinks with colleagues and ended up spending the whole night there. Great atmosphere, good music, lovely staff. ", "date_of_review": "25 February 2019"}
{"review_id": 33, "restaurant_id": -15, "username": "Karen B", "date_of_visit": " April 2019", "rating": "5", "title": "Birthday drinks - roof terrace", "comment": "Had such a great night and staff were so friendly and helpful. Lovely atmosphere on the roof terrace celebrating birthday drinks with friends. The staff went beyond expectations and the level of care when I had a hypo attack during the evening as a type 1 diabetic. Managed the situation professionally and compassionately to not only myself but everyone in the group.  Great venue and brilliant staff!", "date_of_review": "8 April 2019"}
{"review_id": 34, "restaurant_id": -15, "username": "T8604MMlondonlassy", "date_of_visit": " February 2019", "rating": "5", "title": "Excellent venue", "comment": "Attended here Saturday for my birthday. I reserved an area upstairs as quite a few friends smoke so this is ideal as they can smoke at the table while drinking.  I highly recommend that if you do visit this group in large numbers you do reserve an area which is free of charge. It gets very busy in the golden bee. I had the best night, all members of staff are very polite, drinks are reasonably priced and music is point.", "date_of_review": "11 February 2019"}
{"review_id": 35, "restaurant_id": -15, "username": "sfchy", "date_of_visit": " March 2019", "rating": "4", "title": "Great place", "comment": "Had a nice time at Golden Bee, good music, good cocktails and nice staff apart from the security agents who were rude and disrespectful.", "date_of_review": "16 March 2019"}
{"review_id": 36, "restaurant_id": -15, "username": "946natl", "date_of_visit": " April 2019", "rating": "5", "title": "Loved it! ", "comment": "The staff were all so friendly & the service was really quick. The rooftop is so pretty too. Will definitely be back! ", "date_of_review": "26 April 2019"}
{"review_id": 37, "restaurant_id": -15, "username": "Georgia E", "date_of_visit": " April 2019", "rating": "5", "title": "BEST ROOFTOP BAR IN SHOREDITCH!", "comment": "I soooo recommend going to Golden Bee i have been quite a few times and have never had any problems there, it has the most beautiful rooftop bar designed with fairy lights and a fire pit too cute.. i have read in some peoples reviews that the staff were not nice and i find that hard to believe as the staff were really lovely and friendly and the doormen were hot! This is a really nice place to go especially in the summer, theres a great atmosphere and good music i really enjoy going here and highly recommend!", "date_of_review": "26 April 2019"}
{"review_id": 38, "restaurant_id": -15, "username": "Gary_1987_W", "date_of_visit": " March 2019", "rating": "5", "title": "Best rooftop bar in London", "comment": "There are many rooftop bars in London, however, I have found this one to be the best.  Location is great in shoreditch.  Setting of the rooftop is nice with a large space and fire pit.  The crowd of people is good and have not seen any trouble on the multiple times I’ve been here. Over 21s which is great as other outdoor bars in London have a lot of overly drunk teenage irritants.  Make sure you book the rooftop in advance if you go even for free guest list as this will ensure entry if not booked it is unlikely you will be able to get in. Mixed groups it will also be easier to gain entry.  Happy hour drinks are available which is good to save money on.  The bar is open late also which is good for those who can no longer be bothered to go to a club.  Would highly recommend", "date_of_review": "22 April 2019"}
{"review_id": 39, "restaurant_id": -15, "username": "Alhawkesx", "date_of_visit": " March 2019", "rating": "5", "title": "Unreal rooftop", "comment": "ove love love Golden Bee! I’ve been a few times and has been amazing every time. Been with family, friends and boyfriend - always have the best day/night! Can’t fault the staff, the atmosphere or the views! The staff have always been welcoming and made me feel so comfortable. Would highly recommend to anyone looking for somewhere fun to go, also suitable for all weathers - unreal in the sun and when it’s colder they have heaters, fire pits and blankets. Definitely worth a visit.", "date_of_review": "26 April 2019"}
{"review_id": 40, "restaurant_id": -15, "username": "Elzzzz8", "date_of_visit": " April 2019", "rating": "5", "title": "Amazing!", "comment": "I highly recommend going to golden bee if you are in the shoreditch area. The staff are amazing and the atmosphere is great! They play a variety of music so it is for everyone to enjoy. I will definitely be back, especially in the summer as they have a fantastic roof top!", "date_of_review": "26 April 2019"}
{"review_id": 41, "restaurant_id": -15, "username": "Amy S", "date_of_visit": " January 2019", "rating": "5", "title": "Marika", "comment": "The most adorable entrance I’ve recieved in a long time. What a lovely person ♥️. She was so welcoming and correct with everything she did. She has made me want to come back to this rooftop and I will welcome it to more people.  What a good person! Amy xx", "date_of_review": "26 January 2019"}
{"review_id": 42, "restaurant_id": -15, "username": "homisd", "date_of_visit": " January 2019", "rating": "1", "title": "Awful and disrespectful doormen", "comment": "I was there with my work mates and one of the bouncer slap my mate rudely in his head for throwing Cushing and when I asked him why he slapped him, three of them jumped on me and gave me headlock, wrestled me to floor and dragged me out only because I stood up and asked why he slapped him. Am filling a formal complain how we were treated and the bouncer hides his badge quickly because he knew he was wrong and ran off out of site. Will never go there ever again", "date_of_review": "6 January 2019"}
{"review_id": 43, "restaurant_id": -15, "username": "Isabelle P", "date_of_visit": " December 2018", "rating": "2", "title": "Not a great New Years", "comment": "So I have a few bad points about this bar which made mine and boyfriends New Years a end at 1am (we got in at 11pm), which is really disappointing because I have wanted to go to the Golden Bee for such a long time and I have heard good things. Firstly, the music was more suited to a rave, which is fine if your at a rave however I was not so the heavy house music was a little off putting as you couldn't really dance to it, and I go to raves on a regular basis ... When they did actually play a song with lyrics it wasn't even an English song even though it was New Years Eve in London. 2nd - When you ask for a drink and they purposely give you a double without asking you, so naturally your round is more expensive and the drink is extremely strong even though I didn't ask for a double. Thirdly, we couldn't get on the roof top which is kind of why I booked tickets, but on the website I couldn't pre book the roof top area, as I had to be a group of 8 or 12, so that was a little pointless because the night club area is tiny. fourth thing - The clock room was full so I had to wear my fur coat in the night club, the clock room worker was a little rude too to be honest with you. As were the bar staff a girl asked for a normal drink as the other bar makes them really strong and the man had such attitude that she'd asked for single. Good points: its pretty and the drinks weren't that expensive I suppose ... £9 for a double. I think it is more of a day time or early evening drinking place in the summer because I definitely would never go out out there again.", "date_of_review": "6 January 2019"}
{"review_id": 44, "restaurant_id": -15, "username": "emmaelizabethlea", "date_of_visit": " November 2018", "rating": "5", "title": "Marika = Amazing!", "comment": "Love this place. Marika who was on the doors in the rooftop area was AMAZING. So friendly, helpful and made our night special! Thanks, Marika! :)", "date_of_review": "14 January 2019"}
{"review_id": 45, "restaurant_id": -15, "username": "Martin B", "date_of_visit": " December 2018", "rating": "5", "title": "Christmas Party", "comment": "Had the best night here. Roof top is beautiful, drinks fairly priced for London, bar staff polite, clean and tidy for bar/club and no riff raff. Great night out all round ", "date_of_review": "14 January 2019"}
{"review_id": 46, "restaurant_id": -15, "username": "FrankB1628", "date_of_visit": " January 2019", "rating": "1", "title": "Assault", "comment": "If you like paying £8 for a beer, getting punched in the eye by a bouncer or happen to be a lady who likes getting thrown down the stairs this is the place for you.", "date_of_review": "20 January 2019"}
{"review_id": 47, "restaurant_id": -15, "username": "DTF1989", "date_of_visit": " January 2019", "rating": "1", "title": "Disgrace", "comment": "Not only is this place overly priced, the bouncers are a disgrace. Not only are they happy to strangle, punch, kick and push men down the stairs. They do it to women too. There’s no point going here, it’s going to be shut down soon.  However on the plus side if you do love getting your head caved in, pop down and just look at any one of the bouncers.", "date_of_review": "20 January 2019"}
{"review_id": 48, "restaurant_id": -15, "username": "Scottbird210988", "date_of_visit": " January 2019", "rating": "1", "title": "Gum shields required (you will not be supplied with one)", "comment": "If gbh from doorman is your thing then this place is the club for you. As if that wasn’t bad enough this club also has your pants down with the price of its drinks  So all things considered the bouncers really do know the Tricks of their trade they specialise in seeking out paying customers for headlocks, right hooks from behind, kicks and strangulation. Their forte however is throwing men down stairs don’t worry woman they accommodate you as well. So always remember to bring your gumshield with you when you visit this fine establishment", "date_of_review": "20 January 2019"}
{"review_id": 49, "restaurant_id": -15, "username": "357hayleyr", "date_of_visit": " January 2019", "rating": "1", "title": "Speechless", "comment": "I was having a nice evening out with friends at this bar last week when I saw a group of people being man handled so violently by one of the bouncers, not just boys but females too! It was absolutely unbelievable to see and has put me off ever going back here. I will definitely research venues more thoroughly next time as it sounds like it’s a common occurrence and really ruined my evening! ", "date_of_review": "24 January 2019"}
{"review_id": 50, "restaurant_id": -15, "username": "tottravelistolive", "date_of_visit": " January 2019", "rating": "1", "title": "Utterly shocked, horrendous experience ", "comment": "I can’t even believe the experience that we encountered last night. What started as a fabulous day celebrating our friends 30th Birthday ended in a scary and upsetting evening. From the moment we arrived the door staff were rude and intimidating. As a group of couples you do not expect this and we tried to ignore them. Door men/women often have a bad reputation but this place is unreal and the reputation proceeds them!  I hope this place is shut down very soon, the staff are dangerous and not fit to work in this environment! ", "date_of_review": "20 January 2019"}
{"review_id": 51, "restaurant_id": -15, "username": "jczin", "date_of_visit": " December 2018", "rating": "4", "title": "Work Christmas party", "comment": "This venue over numerous floor is great for a social event. The open air top floor is great. The only problem was everyone migrated to top floor and made it quite packed. This prevented dancing and unfortunately it rained so then everyone cramped into the covered area.  Staff were excellent and the food provided was outstanding quality. ", "date_of_review": "30 December 2018"}
{"review_id": 52, "restaurant_id": -15, "username": "OJones94", "date_of_visit": " October 2018", "rating": "5", "title": "Yes!!", "comment": "Emily was spot on the money!! Awesome and positive! :) smashed it out the park :) even laughed at our jokes :)", "date_of_review": "26 October 2018"}
{"review_id": 53, "restaurant_id": -15, "username": "Ammarah S", "date_of_visit": " November 2018", "rating": "1", "title": "Staff are so rude!", "comment": "Very disappointed in the service, although the venue is nice, the staff have a very pretentious attitude; Unhelpful, demeaning and rude. We were very shocked at how bad the service was. Would definitely not recommend this place. So disappointed.", "date_of_review": "4 November 2018"}
{"review_id": 54, "restaurant_id": -15, "username": "Rosie F", "date_of_visit": " November 2018", "rating": "1", "title": "Drinks", "comment": "For such a great place and vibe it’s such a shame the staff are so rude! Completely and unnecessarily ruined the night at closing time.", "date_of_review": "2 November 2018"}
{"review_id": 55, "restaurant_id": -15, "username": "megzkenny", "date_of_visit": " November 2018", "rating": "5", "title": "Birthday visit :)", "comment": "Went here for my birthday, did not have a table booked but Marika was so accommodating. We went here very early and the upstairs was already full but knowing we were in a big party Marika had a table for use within the hour as there was luckily a cancellation. Throughout the night we had the best time with a great space and the security guards Caesar and Marcel were so helpful when I misplaced my phone, (I found it). Music is great, atmosphere is great and very friendly staff which is hard to come by in central London! Would definitely come here again! ", "date_of_review": "24 November 2018"}
{"review_id": 56, "restaurant_id": -15, "username": "Samantha C", "date_of_visit": " November 2018", "rating": "5", "title": "Golden bee 🐝", "comment": "Had an amazing time, great people, great staff and great drinks. Music and atmosphere made the night", "date_of_review": "26 November 2018"}
{"review_id": 57, "restaurant_id": -15, "username": "Sibel D", "date_of_visit": " November 2018", "rating": "1", "title": "Not good for birthday", "comment": "The venue is nice. Services and stuff is not good and not helpful at all. It is not a good place for a birthday. We had own birthday cake they didn’t service even any cutleries, It was so strange not able to eat birthday cake. Not recommended at all.", "date_of_review": "20 November 2018"}
{"review_id": 58, "restaurant_id": -15, "username": "Pie M", "date_of_visit": " December 2018", "rating": "5", "title": "#GoldenBee", "comment": "I was celebrating a birthday at the Golden Bee with friends we all had a fabulous time, the staff were amazing and very accommodating. Thanks to Marika as she was a great host, we arrived very late and she done everything to get us a table as we had missed our slot time. I would recommend Golden bee to anyone looking for a good night out.", "date_of_review": "4 December 2018"}
{"review_id": 59, "restaurant_id": -15, "username": "Yasemin I", "date_of_visit": " December 2018", "rating": "1", "title": "Worst night ever!", "comment": "Horrible and aggressive staff. It was one of the worst nights of my life. A very angry woman who manages the club and has issues. I would avoid this place at all costs", "date_of_review": "5 December 2018"}
{"review_id": 60, "restaurant_id": -15, "username": "Matthew M", "date_of_visit": " December 2018", "rating": "5", "title": "Excellent Roof Terrace", "comment": "I came to the Golden Bee with friends. The main selling point of the venue is the large covered and heated roof terrace, which is still enjoyable in winter. If you want somewhere to dance, the lower floor has a dance area and DJ.  The staff were attentive and efficient. I was particularly impressed by Marika, the front of house on the terrace who managed a lot of demanding customers politely and professionally, including my own friends! Thanks for a fun time!", "date_of_review": "9 December 2018"}
{"review_id": 61, "restaurant_id": -15, "username": "Despina S", "date_of_visit": " August 2018", "rating": "5", "title": "Work later ", "comment": "Emily is the most amazing hostess she listened and was so quick with everything! She was friendly and listened to our every need Make sure you speak to her when you come here !!!", "date_of_review": "31 August 2018"}
{"review_id": 62, "restaurant_id": -15, "username": "natalieedgley", "date_of_visit": " October 2018", "rating": "5", "title": "Great Venue", "comment": "Amazing place! Great night friendly service ! Perfect venue for any event  Love it  Great venue.  Friendly people", "date_of_review": "25 October 2018"}
{"review_id": 63, "restaurant_id": -15, "username": "Loobieblue", "date_of_visit": " September 2018", "rating": "4", "title": "Great night!", "comment": "Just came back from an amazing night at Golden Bee. Marika greeted us on the way up to the rooftop terrace and was absolutely charming and so friendly. This really made a difference to my night. She was also lovely when leaving. Bar staff were great and quick even tho there were lots of people. DJ was good altho O feel the venue would've benefited with the more chilled out tunes playing for longer before the tempo lifted, as it felt like it peaked too early. All in all, thanks for a great night ", "date_of_review": "21 September 2018"}
{"review_id": 64, "restaurant_id": -15, "username": "860shahada", "date_of_visit": " September 2018", "rating": "5", "title": "Best birthday ever!", "comment": "I genuinely had the best birthday to date at Golden Bee on Saturday. Golden Bee let me book a rooftop table for 32 people completely for free and let me bring in a cake at no additional cost. The weather was unfortunately not on our side and we had to be relocated to a different section of the venue (it was still so nice!) but as soon as the rain stopped, the staff changed all the wet cushions on the sofas and moved the group to the rooftop. The venue is genuinely stunning, with 'palm trees' and firepits and lots of heating. The music was also brilliant and we all enjoyed the drinks! Marika was an amazing host as was her colleague (I didn't catch his name, he had long hair!). I think London is going to cotton on to how fab Golden Bee is as a venue and it might become harder to book so get your spots confirmed because it really was an amazing night. Thank you Golden Bee - the best birthday celebration I've ever had!", "date_of_review": "24 September 2018"}
{"review_id": 65, "restaurant_id": -15, "username": "AvrilO21", "date_of_visit": " September 2018", "rating": "5", "title": "Beautiful place and beautiful people.", "comment": "I have the best Cocktails of London in the heart of Shoreditch, Golden Bee. I have always very great times and lot of laugh , sharing good moments with nice people in a funny environment everyday. I love coming here when I am in London. One of the staff is so friendly and takes care of everyone here, always giving a very high and competitive customer service. Very happy with this place !  :)", "date_of_review": "27 September 2018"}
{"review_id": 66, "restaurant_id": -15, "username": "OnAir696258", "date_of_visit": " September 2018", "rating": "1", "title": "Rooftop top not worth price or service", "comment": "The setting is nice - rooftop in east London. No view. AWFUL bar staff. Made a silly joke with the females next to us and the barman refused to serve a drink. Completely ridiculous. Changed the experience for ourselves and the couple we spoke with at the bar.  And ended up leaving and having a better time down the road. ", "date_of_review": "29 September 2018"}
{"review_id": 67, "restaurant_id": -15, "username": "Ulrika M", "date_of_visit": " October 2018", "rating": "1", "title": "Had to go as friends choice", "comment": "Not a nice place. Overly priced and rubbish music. Management are rude and so are other workers. Go somewhere classy and give this dump a miss", "date_of_review": "14 October 2018"}
{"review_id": 68, "restaurant_id": -15, "username": "yassymean", "date_of_visit": " October 2018", "rating": "5", "title": "The Rooftop Terrace is worth the advance booking!", "comment": "I organised a leaving-drinks get together for our colleague and the place did not dissapoint.  The reservations process was seamless and so long you let them know any changes well in advace, they are more than happy to accommodate you. The ambience is great even at night. Ample seating areas for medium-large groups(we were 16 people). We had a great time chilling and enjoying ourselves without having to shout at the person you're conversing with.  Oh and don't let the cold deter you, they have it all covered with heating lamps. I will definitely bear this place in mind the next time we have a gathering.", "date_of_review": "23 October 2018"}
{"review_id": 69, "restaurant_id": -15, "username": "Olivia L", "date_of_visit": " October 2018", "rating": "4", "title": "Great roof terrace", "comment": "Popped in here for a couple of drinks on Saturday. The drinks were reasonably priced for London and the bar staff was nice and service was fast. Unless you get to the roof terrrace the place is fairly average with limited places to sit or place you drink down. We were initially told we couldn’t go on the terrace as we weren’t on the list and it was busy but after deciding to finish our drinks and go elsewhere the lady controlling the upstairs asked if we would still like to go up. The upstairs is much much nicer than downstairs with fairy lights, good music, lively atmosphere and friendly staff. Would recommend going but only if you can get upstairs, either by booking or hanging around until some people come back down. The earlier you go the better. Would definitely go again but ideally with a group of people.", "date_of_review": "15 October 2018"}
{"review_id": 70, "restaurant_id": -15, "username": "pavc2018", "date_of_visit": " October 2018", "rating": "5", "title": "Work leaving drinks 100%", "comment": "So great to organise! Areas was as expected! Happy hour- great! Area- great! Music- great! Overall, a cool place in London to hang out xx", "date_of_review": "25 October 2018"}
{"review_id": 71, "restaurant_id": -15, "username": "Laura_SN1401GJ", "date_of_visit": " August 2018", "rating": "3", "title": "One visit more than enough!!! Work in progress attitude!!!", "comment": "First time at Golden Bee, paid for a Virgin Mojito 10 pounds with barman Lorenzo and discovered from the others barmans that actually was supposed to be only 6!!! Find the place a bit over rated and a lot over priced!!! The only nice experience was the service received from Kamil, who took care of me and my friends in preparing amazing cocktails and mocktails! Rate 3 for the amazing but unfortunately too small rooftop! Ps: I would like to advise Lorenzo not to suppose that everyone might be drunk.....especially if they ask for a virgin mojito!!!!", "date_of_review": "28 August 2018"}
{"review_id": 72, "restaurant_id": -15, "username": "Lyne A", "date_of_visit": " August 2018", "rating": "5", "title": "Best birthday ever", "comment": "Marika is the best host ever and Marcel too they made me feel so welcome i know they have made many people as happy as me i recommend to all great location for any event i give the staff and venue 5 stars esp Marika who when over and above for me to have the best night!", "date_of_review": "10 August 2018"}
{"review_id": 73, "restaurant_id": -15, "username": "Barbs25", "date_of_visit": " June 2018", "rating": "3", "title": "Overrated", "comment": "Didn't get any space on the rooftop as it was fully booked. Got a table inside but there was no atmosphere at all. Drinks were incredibly over priced - £15 for a cider & JD coke, wow. Plenty of better bars in shoreditch go to them instead!", "date_of_review": "13 August 2018"}
{"review_id": 74, "restaurant_id": -15, "username": "Lozza_2012", "date_of_visit": " August 2018", "rating": "5", "title": "Husband's 40th Birthday", "comment": "This place was brilliant. I had reserved an area for around 35 people for my husbands's 40th birthday. The area accommodated all of us comfortably, the drinks were reasonable, the music was brilliant and then atmosphere was awesome. Having booked it all through Gosh their events manager, it all ran like clockwork. Everyone there said what a great venue it was and what a great night they had. I liked the fact even if it rained they had a retractable roof and there was no minimum spend on the area I had. I would certainly recommend this venue and will defo be back.", "date_of_review": "13 August 2018"}
{"review_id": 75, "restaurant_id": -15, "username": "michaellR856JL", "date_of_visit": " August 2018", "rating": "5", "title": "Great service fantastic drinks", "comment": "I didn’t need to order drinks, Emily knew what I wanted to drink. Great tasting cocktails and incredibly attentive. ", "date_of_review": "17 August 2018"}
{"review_id": 76, "restaurant_id": -15, "username": "Kimberley W", "date_of_visit": " August 2018", "rating": "5", "title": "Emily was the best thing about our visit", "comment": "The venue and Emily at the bar was truly the best thing about our visit! She made us feel so welcome and looked after us - would recommend the venue and staff to anyone x", "date_of_review": "18 August 2018"}
{"review_id": 77, "restaurant_id": -15, "username": "Ulrika M", "date_of_visit": " August 2018", "rating": "3", "title": "Very busy on a Friday night", "comment": "Drinks are doubles unless you ask fro a single so be careful. I had the worst hangover due to horrible techno music and drinks too strong  Roof top was packed and I would not go again ...nor my thing . Area is close to Liverpool steeet and old street but I found it quite dangerous when stepping out of this bar as it’s a rough area", "date_of_review": "19 August 2018"}
{"review_id": 78, "restaurant_id": -15, "username": "Fleur Marie L", "date_of_visit": " August 2018", "rating": "1", "title": "FRAUD", "comment": "I found it odd that you couldn't tap your card on their card readers, it wasn't an option. Instead you had to tap in your code even if the value was below £30. Since our visit 4 or us have had fraudulent activity on our bank accounts.  Most were hit the following day and over the weekend but even a week later and people are having phone calls from their banks notifying them of fraud. It's highly unlikely this happened somewhere else as this was the sole time we visited the same place together. To be investigated", "date_of_review": "21 August 2018"}
{"review_id": 79, "restaurant_id": -15, "username": "adriant248", "date_of_visit": " August 2018", "rating": "4", "title": "Good vibe", "comment": "On a lovely summers night a roof top bar is great. Hadn’t been here before. We were just allowed in as we hadn’t booked and it was busy. With bookings. But we had a couple of drinks during happy hour and enjoyed the feel of the place ", "date_of_review": "27 August 2018"}
{"review_id": 80, "restaurant_id": -15, "username": "Raymond_Florence", "date_of_visit": " August 2018", "rating": "1", "title": "To Bee or not to Bee.", "comment": "On Saturday night seven friends and I went to a club called the GoldenBee in Shorditch. As we walked in and ordered our first drink at the bar we were greeted with a large chap being manhandled to the ground, who would have thought this was the way they escort all of their guests out.  I have never been so astounded - The bar is a disgrace to the hospitality industry but seeing as there was nothing hospitable about it at least they have a usp setting themselves apart from all the good places to visit in the area !  It all started (or ended depending on how you look at it) because they do not have any lavoratories upstairs so I had walked down the first set of stairs to find my friend who’s birthday we had met at the golden Bee- Later realising that it was my lucky day having one less set of stairs to be thrown down (by their far from wonderful staff). As we started to ascend the stairs we were told that this was now not allowed so before making my own way out of the venue I asked to get my jacket which I had left at the table we had booked.  Apparently, this was offensive to the lady with the clip board so I asked a friend to help me retrieve the item SHE was allowed to go back up the stairs. Whilst waiting clipboard lady signalled to her colleagues that it was my turn to exit and what an exit it was. If the railings were not there I could have counted every step as they were bumping against my head, instead I managed to escape with two dead arms and a limp.  Needless to say we will not be going back, however don’t be put off if assault is your idea of a great night !", "date_of_review": "27 August 2018"}
{"review_id": 81, "restaurant_id": -15, "username": "rukayah1988", "date_of_visit": " August 2018", "rating": "5", "title": "Amazing", "comment": "I went for a few drinks with my friends for a birthday. I had the most loveliest time the staff was amazing from the bar man to security. The best part was speaking to the Rooftop host Marika she was amazing and the Security guard Stefos aswell as Paige and the lovely pretty girl with green eyes sorry didn't get her name and last of all the manager paolo. Keep being amazing great place to go.  Rukayah", "date_of_review": "8 August 2018"}
{"review_id": 82, "restaurant_id": -15, "username": "Em84EssexUK", "date_of_visit": " July 2018", "rating": "5", "title": "Best Friends Hen Party", "comment": "Emily, our main bartender was absolutely wonderful! She looked after us, was friendly, attentive, and a wonderful hostess! I cannot recommend her or Golden Bee enough! Thank you lots!!! ", "date_of_review": "28 July 2018"}
{"review_id": 83, "restaurant_id": -15, "username": "AnnieT743", "date_of_visit": " July 2018", "rating": "1", "title": "Very unprofessional", "comment": "Having read recent reviews - couldn’t quite believe what I was reading - a party of ten of us arrived to celebrate my daughters wedding - and was told we don’t have hen nights - half of us were in our 40’s & 50’s and the other 5 were the bride and bridesmaids - we ask to see the manager - the manager came down and said - could see we were on a hen night and wouldn’t accept any hen parties - then promptly walked away. I work as a professional and they way we were treated was appalling - I will not be recommending the Golden Bee to any of my professional colleagues. I don’t normally write reviews - but feel very strongly about this - cant believe in this day and age how we were spoken to - maybe I am naive- as not from London. We found another lovely place who made us feel very welcome and spent lots of money.", "date_of_review": "29 July 2018"}
{"review_id": 84, "restaurant_id": -15, "username": "Aydro S", "date_of_visit": " July 2018", "rating": "4", "title": "The Hub of Shoreditch", "comment": "I've been going to this bar for years (dissappointed when it closed for refurb). Always had a good time, the vibe was always great and has a wide selection of cocktails. Icing on the cake is the rooftop terrace, perfecto.", "date_of_review": "23 July 2018"}
{"review_id": 85, "restaurant_id": -15, "username": "Amy L", "date_of_visit": " August 2018", "rating": "5", "title": "Marika and Marcel", "comment": "Hi tripadvisor, come here on a Thursday night for my sisters 30th. Marika and Marcel looked after us completely. They were great and made us feel very welcome. They are great give them a pay rise immediately. Best customer ever. Lots of love, georgia and Amy x", "date_of_review": "2 August 2018"}
{"review_id": 86, "restaurant_id": -15, "username": "vickihE3927WJ", "date_of_visit": " July 2018", "rating": "1", "title": "Horrendous service- will not return", "comment": "Myself, my friend and our partners were having a day out in Shoreditch. We decided to pop to Golden Bee for a drink on the roof terrace. Heading towards the terrace we were met by an extremely rude and unhelpful lady, of course with ‘that clip board’ in hand that seems to turn everyone holding it into a complete obnoxious individual.  We met the lady at the bottom Of the stairs, there were a couple in front who were walking up the stairs. We followed and were shouted at to return to the bottom of the stairs. The lady asked if we had a reservation, we explained we did not and she went on to say entry was by reservation only. I asked to make a reservation and she told me “there are no reservations until September” - helpful.  It seems like there may have been some sort of one in one out policy? Or if your face fits you are ushered up the stairs. We didn’t quite make out what the policy for entry was because it seemed the lady was holding back this sort of normal, helpful, friendly information. This member of staff was not at all welcoming, extremely rude and with someone like that as a point of contact to potential customers I should think this business will not succeed. We will not be returning and I would not recommend this bar to anybody, unless I really didn’t like them. ", "date_of_review": "1 August 2018"}
{"review_id": 87, "restaurant_id": -15, "username": "FahadO21", "date_of_visit": " August 2018", "rating": "5", "title": "Golden Bee, London ", "comment": "Amazing place and friendly staff, it’s my first time in here but I’ll come more definitely in the future, the staff is really good especially”Marika” :)", "date_of_review": "2 August 2018"}
{"review_id": 88, "restaurant_id": -15, "username": "stephenbaker88", "date_of_visit": " August 2018", "rating": "5", "title": "What a night....", "comment": "What a great night for my friends birthday, and the bar staff were amazing, especially Emily on the terrace bar.", "date_of_review": "4 August 2018"}
{"review_id": 89, "restaurant_id": -15, "username": "mohandzzzzz", "date_of_visit": " August 2018", "rating": "5", "title": "Best roof top ever ", "comment": "I came for the first time with friends the service was amazing security professional and the girl on the stairs Marika was the best host ever very polite and professional she made our night!! She is an asset to your company", "date_of_review": "2 August 2018"}
{"review_id": 90, "restaurant_id": -15, "username": "Bryony L", "date_of_visit": " August 2018", "rating": "1", "title": "This place is a joke ", "comment": "We came here the other night and all tables were taken apart from one which the security guard was sitting at. I asked him if we could sit there instead (being paying customers and all that) and he responded with \"no im sitting here\".  Absolute joke!! We left straight away. You have people coming in to pay money to drink and this security guard can't let you sit down at the last table available. Rude! ", "date_of_review": "8 August 2018"}
{"review_id": 91, "restaurant_id": -15, "username": "JoeFerrari100", "date_of_visit": " March 2018", "rating": "5", "title": "Great bar and rooftop. Brilliant music", "comment": "We visited on Easter Thursday and had the best night ever! Music:  Soulful House/Funky/Deep House and RnB Staff:  Security were friendly and helpful. Bar staff excellent and fast, strong drinks. Short 5minute queue to get in.  Drinks: Best cocktails in Shoreditch and the rooftop was amazing. Atmosphere:  Brilliant! At 9pm a percussionist came on who really got the place lively.", "date_of_review": "3 April 2018"}
{"review_id": 92, "restaurant_id": -15, "username": "Alesha B", "date_of_visit": " June 2018", "rating": "1", "title": "Disappointment", "comment": "Myself and some girlfriends were out in London celebrating one of our birthdays, we decided to head to Golden Bee because one of the girls had been there a few days before and it looked like it had good reviews. On arrival the woman on the door was an absolute misery, she allowed for half of us (3) to go in then the 4th and then wouldn't let the last 2 of us in. It was not due to capacity because there was a large queue behind us which she allowed to go in as well. This was at mid day but we all found her behaviour towards customers disgusting. The first thing customers should see is a happy face and receive a welcoming service. For someone that looked like they were in their 30s she had an attitude of a teenager. Truly disappointed and from other reviews I've just seen, other people have incurred the same miserable woman on the door.", "date_of_review": "2 July 2018"}
{"review_id": 93, "restaurant_id": -15, "username": "dinodizenzo", "date_of_visit": " March 2018", "rating": "5", "title": "Absolutely", "comment": "Together with Golden Bee we've hosted the most amazing Bank Holiday Parties #absolutelyreverb.You won't find a more welcoming venue than the Bee, amazing staff . See you on the dance floor terrace or club...you decide x", "date_of_review": "11 April 2018"}
{"review_id": 94, "restaurant_id": -15, "username": "adama946", "date_of_visit": " April 2018", "rating": "5", "title": "Always a good night there.", "comment": "Nice rooftop bar, reasonably priced drinks, and good DJs on both floors. I’ve been 5 or 6 times now and always had a decent night!", "date_of_review": "29 April 2018"}
{"review_id": 95, "restaurant_id": -15, "username": "Larisa M", "date_of_visit": " June 2018", "rating": "5", "title": "Graduation Party", "comment": "Daniel was amazing! He helped us choose drinks, was extremely friendly and helpful!  Loved the place and the cocktails! Thanks to Daniel and all the amazing bartenders this evening!  best, Lari", "date_of_review": "4 June 2018"}
{"review_id": 96, "restaurant_id": -15, "username": "Tenesha N", "date_of_visit": " June 2018", "rating": "5", "title": "Great birthday", "comment": "Went here on Saturday & had the best night this year. Staff were friendly! Venue setting was amazing (especially for pics) and drinks weren't too pricey either. Will defo be going back. Thanks for a great night!", "date_of_review": "5 June 2018"}
{"review_id": 97, "restaurant_id": -15, "username": "fengxingluna", "date_of_visit": " June 2018", "rating": "5", "title": "Great rooftop bar", "comment": "Daniel is awesome! Cocktails are good, and they do 2 for £10 before 9pm! The place is great for group of friends together. ", "date_of_review": "4 June 2018"}
{"review_id": 98, "restaurant_id": -15, "username": "Dominic D", "date_of_visit": " June 2018", "rating": "2", "title": "Disappointing evening", "comment": "20 of us had turned up together on the guest list for a birthday, as we've all been here a number of times and loved the rooftop terrace on every occasion previously. We'd signed up to the guest list approximately 3 weeks in advance which I'd strongly advise doing if you're looking to get in on a Friday or Saturday. Unfortunately, this is where our quarrel lies. On our 3 previous visits, which were always on Fridays and Saturdays, we were allowed to move freely between the terrace bar and other bars. Unfortunately on thks occasion this was not the case. From 8 o clock, we were told that Golden Bees policy was that guests were not allowed up to the terrace, and the terrace was only for guests who had booked a table. This was a huge shame as on all occasions previously we'd never experienced this.  The lady on the stairs did proceed to let a group of 13-15 people who knew her personally upstairs, whilst a large number of people queried why they weren't being allowed up, which seemed to frustrate a large number of people. In the end, our large group went to The Book Club, another bar within the area where we had a lovely evening. I'd recommend large groups to avoid here even if you're on the guest list, as I believe there are other venues that value your business more. I hope some changes are put in to place moving forward to ensure guests are not disappointed moving forward, or alternatively, that it's made very clear that the terrace is only for those who have booked a table, as on this occasion, despite visiting a number of times previously, I wouldn't visit again.", "date_of_review": "19 June 2018"}
{"review_id": 99, "restaurant_id": -15, "username": "50Katy_", "date_of_visit": " June 2018", "rating": "5", "title": "Emily - a great cocktail maker!", "comment": "A very pleasant evening spent at Golden Bee mid-week and in the height of Happy Hour. Spacious rooftop bar with relaxed and friendly atmosphere and plenty of seating. Friendly and welcoming staff and Emily was the best cocktail maker I have seen in a long time. She was ready to advise even when serving at a very busy bar. Thanks for a lovely evening - great view, great atmosphere, great drinks and wonderful service.", "date_of_review": "27 June 2018"}
{"review_id": 100, "restaurant_id": -15, "username": "Maps654759", "date_of_visit": " July 2018", "rating": "5", "title": "Best barwoman ever", "comment": "Great place but man...the barwoman Emily is the best! Fast service and fun! I Love it! Best Recommended place in London!!", "date_of_review": "30 June 2018"}
{"review_id": 101, "restaurant_id": -15, "username": "Denise C", "date_of_visit": " March 2018", "rating": "5", "title": "Fab nite ", "comment": "I’ve had the best night in ages! Bar staff and management are super friendly they even made us bespoke cocktail. Great prices compared to other clubs in London. We will be back!!! ", "date_of_review": "30 March 2018"}
{"review_id": 102, "restaurant_id": -15, "username": "angrybookster", "date_of_visit": " May 2017", "rating": "4", "title": "Come for the view", "comment": "Probably the most authentic view of the Shoreditch skyline - worth coming just for that. The drinks are your usual London prices and quality, nothing that really blew me away, but there was some great stuff going on in the evening after sun down, dancing nad a great vibe. I usually take foreign friends here for a no-pressure night.", "date_of_review": "1 August 2017"}
{"review_id": 103, "restaurant_id": -15, "username": "504150Katie", "date_of_visit": " September 2017", "rating": "4", "title": "Good bar but .....", "comment": "Whilst visiting London we visited the Golden Bee, cocktails were good, averagely priced! We just picked the wrong spot on the roof terrace as all around us were heavy smokers, it was slightly windy up there and it was wafting in our direction, don't know if there was a no smoking area though!", "date_of_review": "24 September 2017"}
{"review_id": 104, "restaurant_id": -15, "username": "Imogen B", "date_of_visit": " November 2017", "rating": "1", "title": "A flick around the ear", "comment": "I came here to celebrate a friend's 30th birthday, we got asked to leave because the birthday girl had hurt her feet and so had taken her shoes off so she was asked to leave and another friend apparently was dancing too 'provocatively' and as I walked out to go (not knowing actually why we were leaving) I got a horrible flick behind the ear - one of the bouncers did this. When I turned around and said 'what just happened! That wasn't very nice' one of them agreed and starting stroking my ear and the one who did it just stared at me. I won't be going back there again at all. Until we had to interact with any of the staff it was fine but that really ruined things for me.", "date_of_review": "18 November 2017"}
{"review_id": 105, "restaurant_id": -15, "username": "Miranda S", "date_of_visit": " September 2017", "rating": "5", "title": "Great evening", "comment": "A group of friends and I booked an area on the top floor on Saturday night and from the moment we entered the bar, each staff member that we encountered was friendly and helpful. The bouncer who was situated nearest our area was just adorable. The music was great, atmosphere was relaxed. We will definitely go back. If I had one small point of constructive feedback, I would back up the previous review re cigarette smoke, i wonder if the owner would consider splitting the top floor to smoking and non smoking areas as it did feel like we'd gone back in time to before the smoking ban and regularly got clouds of smoke in the face from other revellers who were enjoying their cigarettes. Live and let live, no problem but may enhance non smokers nights to have a protected area. Thank you Golden Bee, we'll be back!", "date_of_review": "25 September 2017"}
{"review_id": 106, "restaurant_id": -15, "username": "amyt607", "date_of_visit": " December 2017", "rating": "5", "title": "such a good night out ", "comment": "it was one of my better halfs friend birthday.  We celebrated his 30th - with a private booth for 35+ of us.  we got the booth all night along with drinks, and also being so close to the bar on the middle floor - we were able to always get drinks super quick so we didn't even up spending half the night waiting to be served!. We got to socialise and see all our friends and also consume so much alcohol!. . Wasn't very expensive either for drinks!. So doesn't burn a hole in your pocket for one drink!  Overall was a really good night - danced, sang, drank, and got to see friends and have a very good night!.  Thank you :) ", "date_of_review": "11 December 2017"}
{"review_id": 107, "restaurant_id": -15, "username": "AKZ-and-I", "date_of_visit": " December 2017", "rating": "1", "title": "Probably the worst bar/club in London", "comment": "Warm, welcoming, friendly; probably three of the most inappropriate words to describe this place. At 630pm on a Friday in December, the frosty feeling had nothing to do with the weather. It’s from the staff on the door. They are to be congratulated at their skill at keeping people away from the “club”. Ordering us to leave bags in the cloakroom because there’s no space upstairs. Really, I’ve never seen an emptier bar; probably because the door staff are so good at their job. If you want to relive your youth, this is a great place to visit - they make you feel like you’re an unruly teenager who’s just wandered in after closing time and need to be ordered around. Upstairs, the terrace has an outside, uncovered area - and a covered area. The uncovered area has a fire - it’s clearly unsuitable for outdoor use, as at the first drops of rain it was turned off. So we’re left outside in the rain, with our coat hoods up. Not for long…. “hoods off” barked the security guy without any explanation.  We’re not allowed to stand outside, on the terrace, in the rain, with hoods on. Apparently we can’t be seen by the CCTV. So, poor placement of their CCTV cameras is our problem - perhaps we should have chosen a bar with better CCTV and more friendly staff. At least the management were reasonable - after I sought management they spoke to the security guy and he left us alone. And the bar staff were friendly and helpful. It’s unfortunate that the staff will probably be battling to keep people in whilst the security team are intent on making paying customers feel cold, unwelcome and an irritation. My mistake for thinking that a bar or club is for my entertainment and enjoyment. Clearly not here. This place is run for the staff not the customers. Avoid it. It’s rubbish. A thoroughly unpleasant experience.", "date_of_review": "15 December 2017"}
{"review_id": 108, "restaurant_id": -15, "username": "Lina C", "date_of_visit": " February 2018", "rating": "5", "title": "Exciting. ", "comment": "Went here for my friends birthday. Enjoyed being on the roof top..everyone enjoyed themselves. The music was good...I would say you’d have to go quite early to be able to get on the roof top as it does get very busy! Drinks were reasonably priced too. Overall enjoyed my time here and would definitely be coming back! ", "date_of_review": "16 February 2018"}
{"review_id": 109, "restaurant_id": -15, "username": "X4873NEjonathank", "date_of_visit": " February 2018", "rating": "5", "title": "Urban paradise", "comment": "Discovered this place by pure chance, the Golden Bee is buzzing with good company and urban vibes. Locating not far from the tube station, this place is not hard to spot as its rooftop bar lights up like a lighthouse, contouring Old Street's night life. Cocktails are reasonably priced; complimented by the friendly bar staff that helps you choose them. Recommended.", "date_of_review": "23 February 2018"}
{"review_id": 110, "restaurant_id": -15, "username": "Ginette8300045", "date_of_visit": " February 2018", "rating": "1", "title": "GOLDEN (P)EE : F.ake U.neducated. Coward. Kinky / MOCKING AND AGRESSIVE", "comment": "Never heard about this before my friend and I ... now, we understand why! Very poor, mediocre service who does not care at all about their clients and loves to make fun of them when they leave... I heard some homophobic imitation of ''Goodbye'' said in a very effeminate way.. They just made fun of us and we heard their imitations of our ''goodbye'' when leaving the roof-top. We were very shocked. Just the worst Bar / Bin-top ever in London. I just would like to advise to move on and not to stop at this! Very very expensive and agressive staff, the Boss you will notice, sees himself as James Bond and spies on you when you are talking with friends and family. Very toffee-nosed guys and false hipsters. The bartender advised me the most expensive cocktail without telling me the price cause he saw we were tourists. Sorry to say so; but the golden bee should be renamed ''The Golden Pee''! A real Shame !!!!!", "date_of_review": "29 March 2018"}
{"review_id": 111, "restaurant_id": -15, "username": "Springer114", "date_of_visit": " July 2017", "rating": "5", "title": "excellent rooftop bar", "comment": "In the day or early evening If you’re looking for something different this is it, an excellent rooftop bar with a very chilled venue to relax and drink fab cocktails and reasonably priced drinks go no further . We went early as we were on our way to a restaurant and it was perfect. The staff were very friendly and helpful the seating was spot on and the whole area was relaxing and fab. I’m sure later evening it is the venue to be for the music scene too will return thank you.....", "date_of_review": "27 July 2017"}
{"review_id": 112, "restaurant_id": -15, "username": "Ash062013", "date_of_visit": " June 2017", "rating": "1", "title": "Really poorly service", "comment": "Tried to organise a VIP area for our engagement drinks. The staff are extremely unhelpful and are not willing to accommodate any requests.  Would highly advise against any group bookings.", "date_of_review": "12 June 2017"}
{"review_id": 113, "restaurant_id": -15, "username": "Sarah S", "date_of_visit": " March 2017", "rating": "1", "title": "Lots of fights", "comment": "All i see is big fights at the dance floor and my friend got pushed to the floor for standing next to them. I didn't feel safe there and my other friend lost her bag and no security helped her to find it. Drinks are expensive .", "date_of_review": "30 May 2017"}
{"review_id": 114, "restaurant_id": -15, "username": "Fred W", "date_of_visit": " July 2017", "rating": "5", "title": "Best Bar in London", "comment": "When its sunny the rooftop terrace provides a great view and catches the sun all day. Great cocktails with friendly staff. Good music with a range of easy listening genres. Golden Bees is the place to be. ", "date_of_review": "2 July 2017"}
{"review_id": 115, "restaurant_id": -15, "username": "Climber570010", "date_of_visit": " July 2017", "rating": "5", "title": "Brilliant Rooftop bar! ", "comment": "Really nice atmosphere and very modern decor. All staff were lovely and welcoming and the bar staff make THE best cocktails! We had the passion fruit Collins, a chocolate martini, a raspberry and fig martini and a pornstar martini all really really nice!! Would definitely recommend for groups and couples great tunes and good vibes, especially with the sun!! ", "date_of_review": "2 July 2017"}
{"review_id": 116, "restaurant_id": -15, "username": "Elle C", "date_of_visit": " July 2017", "rating": "5", "title": "Second date perfection", "comment": "I went here with a guy for a second date which was amazing.  The view from the rooftop is beautiful which instantly creates a talking point. The music playing was hip and edgy. And the choice of cocktails was so big you knew there would be something for everyone.  In general the prices are fairly expensive but not too bad for London, and there was a mixture of all sorts so anyone could blend in.", "date_of_review": "7 July 2017"}
{"review_id": 117, "restaurant_id": -15, "username": "Owain_Davies1986", "date_of_visit": " July 2017", "rating": "5", "title": "Great Place To Go", "comment": "I love this place it always been amazing with great staff. Went back the other night and wow the refurb is mind blowing what a amazing job and the staff still as friendly and helpful as always never no trouble. If you are in London just visiting or Living near by you have to check this place out you wont be left with regrets your be like me everytime i am in london i always make sure i pay a visit to the Golden Bee", "date_of_review": "3 July 2017"}
{"review_id": 118, "restaurant_id": -15, "username": "Joseph-Atkinson", "date_of_visit": " July 2017", "rating": "4", "title": "Great venue ", "comment": "A great place for drinks with friends but only if you're on the roof. I would have liked to see some draught beers/largers rather than like warm bottles. Greta cocktails though.", "date_of_review": "23 July 2017"}
{"review_id": 119, "restaurant_id": -15, "username": "Maria V", "date_of_visit": " July 2017", "rating": "4", "title": "Great Rooftop bar!", "comment": "I really love coming to this bar - it has a great rooftop terrace, the music is always great and staff are friendly. Drinks prices are a little expensive but that's just London prices, and you're paying for good quality drinks.", "date_of_review": "24 July 2017"}
{"review_id": 120, "restaurant_id": -15, "username": "ohnoitsemily", "date_of_visit": " July 2017", "rating": "5", "title": "Stunning bar - wonderful evening ", "comment": "I think this is one of the most stunning bars I've been to in London. It's in a cool area and has a beautiful rooftop terrace. The cocktails were amazing. Me and my friends had the best night here.", "date_of_review": "26 July 2017"}
{"review_id": 121, "restaurant_id": -15, "username": "teisha92", "date_of_visit": " May 2017", "rating": "1", "title": "Rude staff and cocktails are rubbish", "comment": "Rude manger and owner owner told us to shutup and get out and manager telling my friend to shut her mouth I've never been to a place where the staff have been so horrible I will not be going to a place where I don't feel welcome.", "date_of_review": "19 May 2017"}
{"review_id": 122, "restaurant_id": -15, "username": "stelalondon", "date_of_visit": " September 2016", "rating": "5", "title": "Great atmosphere ", "comment": "I have been to the Golden Bee a few times now and find it an excellent venue with great views from the rooftop bar, the doormen are much more friendly than other places I have been to in Shoreditch and the West End and the bar staff are really great even when rushed off their feet.", "date_of_review": "27 September 2016"}
{"review_id": 123, "restaurant_id": -15, "username": "kaami223", "date_of_visit": " October 2016", "rating": "5", "title": "Great place!!", "comment": "I've been going to Golden Bee for ages now and personally I really like the place. Drinks are reasonably priced for London and the choice is good. Friendly staff and a good crowd - the bouncers are pretty friendly and ensure nothing gets too rowdy. Would recommend if you're in or around Old Street!", "date_of_review": "8 October 2016"}
{"review_id": 124, "restaurant_id": -15, "username": "873AmyB873", "date_of_visit": " November 2016", "rating": "3", "title": "Just Ok", "comment": "I came here for a friend's 30th birthday. I tend not to be a lover of Shoreditch as I just don't like the pretentiousness of many of the people who frequent the area. Therefore, I wasn't looking forward to it too much. I was, however, surprised when I got to Golden Bee. The area my friend had reserved was really nice and the music (I was there on a Saturday) was classic R and B and Hip Hop, which I really liked. The drinks weren't too expensive and it didn't take too long earlier in the night to get served. However, this didn't last. Later on, the music turned into just another rubbish load of house music which all sounded the same. The place was really busy, which was fine, but there weren't enough bar staff to cope. There was also a £10 minimum spend to pay on a card, which, given I was driving so not drinking alcohol, was very annoying as I had no cash. Overall, my expectations were about right overall: a good start then turned into a very average night out.", "date_of_review": "13 November 2016"}
{"review_id": 125, "restaurant_id": -15, "username": "handt2k15", "date_of_visit": " August 2016", "rating": "5", "title": "Nice roof top bar in london!", "comment": "Nice place to come for summer drinks with friends. The attaction is the roof top bar. Comfy seats make sure to reserve in advance.", "date_of_review": "15 March 2017"}
{"review_id": 126, "restaurant_id": -15, "username": "Liza E", "date_of_visit": " April 2017", "rating": "1", "title": "Racist & violent security", "comment": "Booked and paid for an event on bank holiday weekend with a group of 12 people. Everyone was drinking and we had bought two bottles of alcohol. Bouncers targeted me and two of the black guys in our group (the only people of colour in the group) Made up lies that we were causing trouble and told us to leave. Understandably we argued back as we wanted to stay with our group as it was a planned day out and friends birthday. Bouncer punched one of the guys in the eye out of nowhere and so hard that he was spilt open his eyelid. I called the police but because it was bank holiday, they said it would be 45-1 hour wait. The guy fell to ground and now has a badly sprained wrist. I'm distraught with how we were targeted and treated and still in shock. The bouncers were animals. If you want a safe and enjoyable night do not to go Golden Bees.", "date_of_review": "17 April 2017"}
{"review_id": 127, "restaurant_id": -15, "username": "psharp89", "date_of_visit": " April 2017", "rating": "1", "title": "Would rather stick pins in my eyes then go to this place again", "comment": "Need to be on a guestlist even if you have reserved a table - I was on the guest list and still had to pay £5 to get in, (cash only) so lost place in the que when i went looking for a machine. Wont accept card at the bar unless its more then £10, (just like a dodgy corner shop or maybe a kebab house) conveniently priced at £4.50 for a small bottle of beer so I have to pay over the odds when buying 2. Cheap looking rattan funiture. Cocktails are certainly not up to any sort of solid standard, more expensive than some of London's (and the worlds) top bars,  Ok, its on the roof but the views over Old St. aren't exactly awe-inspiring. Its full of people who want to fight you and generally unfriendly atmosphere. I get it if the staff want to serve their friends first, but they're not exactly subtle about it or very helpful. Unisex loos full of people doing cocaine. Just go to the pub around the corner.", "date_of_review": "19 April 2017"}
{"review_id": 128, "restaurant_id": -15, "username": "davidcY7107RC", "date_of_visit": " April 2017", "rating": "5", "title": "Best Easter Sunday ever", "comment": "Heard great things about this place so thought me and my brother Kieran would give it a try and I'm glad we did . Drinks are cheap for the area and the entertainment was second to none , neve from kiss was smashing the old school garage on rooftop bar , Kelly let rock then killed it with some live p.a . Then downstairs another banging DJ was dropping classics . Wicked vibe in this place and trust me it was jumping , thanks to john the friendly bouncer on the door , see you soon mate .", "date_of_review": "21 April 2017"}
{"review_id": 129, "restaurant_id": -15, "username": "onelifeoneloveone", "date_of_visit": " December 2016", "rating": "4", "title": "Great for a romantic drink on the rooftop", "comment": "we stopped off at the Golden bee on the way to dinner for a quick drink, this place is great for a cosy up and a drink on the rooftop with cool views of old street. you may want to book if you are staying longer than a quick drink as it looked like every table was booked after 7:30. nice place!", "date_of_review": "19 December 2016"}
{"review_id": 130, "restaurant_id": -15, "username": "c0nn0le", "date_of_visit": " May 2017", "rating": "1", "title": "Awful, rude staff", "comment": "Appalling service, the staff were clueless and rude to every member of our group. Not worth the visit or dingy rooftop.", "date_of_review": "18 May 2017"}
{"review_id": 131, "restaurant_id": -15, "username": "oscarf542", "date_of_visit": " August 2016", "rating": "1", "title": "Rude and bully bouncers!", "comment": "I went with my friends to this club last night paid to get in, bought a bottle of vodka and spent good money for the 3 hours we were there, then one of the bouncers came up to me & told me in a very rude way to take my cap off, i asked why as they let me in with it on and there was other fellas wearing them and he grabbed my arms and marched me out onto the street! Im a black taxi driver and will make sure i tell every passanger that i have how rude and out of order the bouncers r at this club and that they dont respect the customers!!", "date_of_review": "29 August 2016"}
{"review_id": 132, "restaurant_id": -15, "username": "Herieta", "date_of_visit": " September 2016", "rating": "5", "title": "Best venue in Shoreditch ", "comment": "We really enjoyed our visit to this venue , I really had my best birthday party ever, the staff made us feel privileged at all times , we received a very good service at a affordable price. Doormen are nice and helpful. Definitely we going back there very soon. ", "date_of_review": "26 September 2016"}
{"review_id": 133, "restaurant_id": -15, "username": "TDiddy75", "date_of_visit": " August 2016", "rating": "5", "title": "Amazing roof terrace - great vibe - Porn Star Martinis to die for!", "comment": "Service was great although you do have to order at the bar - not too much of a hardship though as the roof terrace is fairly intimate. Good selection of drinks with happy hour until 7pm. You definitely need to book to make use of this space! Great atmosphere, friendly staff (all of whom helped us complete our list of hen night dares!) - I would definitely recommend this place.", "date_of_review": "31 August 2016"}
{"review_id": 134, "restaurant_id": -15, "username": "OllieP123", "date_of_visit": " September 2016", "rating": "2", "title": "Good venue let down by staff", "comment": "The venue is good, particularly on the terrace but this is let down by the unwarranted attitudes of some bar staff. This isn't an exclusive place, so when your spending hundreds, you should at least have a polite service. Won't be going back.", "date_of_review": "4 September 2016"}
{"review_id": 135, "restaurant_id": -15, "username": "Ziya M", "date_of_visit": " September 2016", "rating": "4", "title": "Great place to party in shoreditch ", "comment": "Great place to party, security super cool, minimal hassle getting in. Great djs and outdoor space to die for. Great vibe and full of cool party goers. Recommend for groups, helps if you get on to guest list. Will definitely go again :))) ", "date_of_review": "9 September 2016"}
{"review_id": 136, "restaurant_id": -15, "username": "abrz78", "date_of_visit": " September 2016", "rating": "5", "title": "Friendly bartenders ", "comment": "This place is amazing. From around 6pm until 11:45pm roof is the place to be. I have fun every time I visit golden bee. Staff are always friendly and respectful. Especially bar staff, I don't need to wait more then 1 min to get served. ", "date_of_review": "10 September 2016"}
{"review_id": 137, "restaurant_id": -15, "username": "Mediaphyter", "date_of_visit": " September 2016", "rating": "2", "title": "Slow service, amateur bar staff, decent environment", "comment": "Went there on my last night in Shoreditch to meet a friend for a quick drink. Doorman at the front asked who I was meeting as if it was a high end club, which it is not, so that confused me. I went up the tacky pink and brown stairs and found my friend outside and then went into the second floor bar to get a vodka soda. There were two bartenders working, two of the slowest I have ever seen in my entire life, one of whom smelled of body odor and kept exclaiming he was going to lose his mind over the stress... of the empty bar? It could've been because of all the people ordering girlie drinks (I had a vodka soda) but it wasn't even crowded.They gave me my first drink free since I waited so long for something simple. The second time to the bar I tried to use my U.S. card that required a signature, and they said the owner requires a photocopy of the card and the users ID for such a thing. I went with it, mostly out of surprise, despite it violating many global POS privacy and security regulations -- that's my fault. We decided to leave and go to a bar with more mature drinks, better bartenders, more legal policies, and less smells. Terrible spot, but could be really good if it was run with capability.", "date_of_review": "11 September 2016"}
{"review_id": 138, "restaurant_id": -15, "username": "xadesolax", "date_of_visit": " September 2016", "rating": "1", "title": "Rude Door Staff", "comment": "Their Friday DJ who plays at Molton house recommended this to me and the door staff was very rude and did not even ask me if I was on the guestlist befor being told there was a private event and then I see other walk-inns being let in and paying door entry. Clearly this is because I'm black! I live in Hampstead and am a lawyer yet was embarrassed at the door.", "date_of_review": "19 September 2016"}
{"review_id": 139, "restaurant_id": -15, "username": "Joilma S", "date_of_visit": " September 2016", "rating": "5", "title": "Birthday night out", "comment": "Great night, music was good all night and the staff were really helpful - definitely helped make our night", "date_of_review": "25 September 2016"}
{"review_id": 140, "restaurant_id": -15, "username": "617adrianaa", "date_of_visit": " July 2016", "rating": "5", "title": "Great atmosphere! ", "comment": "I've been there for a drink with friends and I couldn't recommend it more! The staff is friendly and helped us with suggestions of what to choose from the menu. The cocktails that I tried are delicious and you can see they are made with pleasure from the bar staff.  So if you are looking for a roof terrace with good service to have a good time with friends look no more! This is the place to be! ", "date_of_review": "26 September 2016"}
{"review_id": 141, "restaurant_id": -15, "username": "Manuela E", "date_of_visit": " May 2016", "rating": "4", "title": "Busy Friday night drink but with excellent view!", "comment": "I have been really well impressed with the excellent service given by the on-line service (useful for the booking and the staff at the bar. It was one of the few lovely evening where it was pleasant to be out on the terrace that we could not accede (too crowdy but we received a great service from the staff inside and the cocktails were delicious). I wish I could have gone upstairs.... next time", "date_of_review": "22 May 2016"}
{"review_id": 142, "restaurant_id": -15, "username": "Hatty B", "date_of_visit": " June 2016", "rating": "4", "title": "Hatty v", "comment": "Had a night out on the 18th we had a really good night, roof terrace is wicked bar staff upstairs and downstairs all really nice...baring in mind it was really busy I think they coped really well. Had a dance downstairs too...must say this was my second visit here and I would most definitely go again. Drinks are reasonable too, and taste good!!!!!!! You can definitely taste the alcohol!!!!! Loved it. Door man were all very polite didn't have a problem at all. Not arrogant like some places I've been too.", "date_of_review": "20 June 2016"}
{"review_id": 143, "restaurant_id": -15, "username": "NatNatlondon1", "date_of_visit": " June 2016", "rating": "2", "title": "Annoying door charge", "comment": "Super annoyed to be charged a fiver just to enter and find a friend. Great Dj but the toilets are too small for the venue size. Barmen are arrogant and the crowed is pretentious. ", "date_of_review": "25 June 2016"}
{"review_id": 144, "restaurant_id": -15, "username": "LauraC13883", "date_of_visit": " July 2016", "rating": "1", "title": "Terrible! pretend to be something it s not.", "comment": "I've always seen this place from the street and as I absolutely love roof top bars I really wanted to try this one. On Friday night as we were going to meet friend in Shoreditch we decided to go there for a quick drink after work with my boyfriend.  Well that was a mistake, the people in there look very pretentious and not fun. It's more of a show off than an actual nice place.  I recommend the Boundary in Shoreditch or the Ham Yard in central London for real nice roof tops ", "date_of_review": "10 July 2016"}
{"review_id": 145, "restaurant_id": -15, "username": "Hutey", "date_of_visit": " July 2016", "rating": "5", "title": "Decent place", "comment": "It's a place u know when it's warm and sunny u can go and u will have fun. The atmosphere is good, staff are friendly to me always. They shake my hand when I come to the bar. The view is immense too. Cool place. Favourite drink is Ginger beer and Vodka ", "date_of_review": "23 July 2016"}
{"review_id": 146, "restaurant_id": -15, "username": "Robin R", "date_of_visit": " July 2016", "rating": "1", "title": "Nice venue, bad staff", "comment": "Real shame. Was there with several friends and the venue was excellent. However, bar staff were drinking quite heavily and became quite abusive to several customers as night went on. Worth a visit in future as I am sure management will weed out the bad eggs!", "date_of_review": "21 July 2016"}
{"review_id": 147, "restaurant_id": -15, "username": "Charlotte K", "date_of_visit": " July 2016", "rating": "1", "title": "Rude and Agressive staff", "comment": "Such a lovely venue but a couple of the staff members really ruined it, one in particular was very aggressive and lecherous to the women in our party. Don't go here until they sort their staff out.", "date_of_review": "28 July 2016"}
{"review_id": 148, "restaurant_id": -15, "username": "lilly T", "date_of_visit": " August 2016", "rating": "1", "title": "Manager and Bar Staff terribly obnoxious", "comment": "Roof top terrace is quote charming, but the Manager, Bar Staff and Bouncer were exceptionally discourteous impolite in a deliberate way which was not necessary.", "date_of_review": "2 August 2016"}
{"review_id": 149, "restaurant_id": -15, "username": "Matthew P", "date_of_visit": " August 2016", "rating": "4", "title": "30th Birthday", "comment": "When I arrived the building is inconspicuous but friendly staff waiting on the door. I had previously booked and reserved a seating area on the terrace. The terrace was lovely with a dedicated bar and very friendly staff. We also ordered a large family sushi platter which came out and was of a high standard. Lovely venue the oyster reason I have not given a 4 star is at 12am they close the terrace and the venue became unbearable for 20 minutes with the volume of people. This then quietened down and became fine. Great night out and great venue. X", "date_of_review": "1 August 2016"}
{"review_id": 150, "restaurant_id": -15, "username": "EiaModernWoman", "date_of_visit": " July 2016", "rating": "3", "title": "Birthday Drinks on Friday night", "comment": "Cool place in the middle of hippy shoreditch.  The terrace is really pleasant ( if you manage to get up there - as it gets very crowded on friday night)- spent majority of the evening there as very hot. Music is decent and drinks as well with mid range prices. Good spot for partying in Shoreditch.", "date_of_review": "7 August 2016"}
{"review_id": 151, "restaurant_id": -15, "username": "laurencX6985ZT", "date_of_visit": " May 2016", "rating": "4", "title": "Friday Drinks! ", "comment": "Great quirky place with an amazing rooftop bar! The staff on the door and at the bar were extremely friendly and there was a lovely atmosphere at the top whilst sipping cocktails in the sun! We went quite early after work and it was fairly busy - it was just the two of us but I got the impression if we were in a group you would probably have needed to make a reservation! ", "date_of_review": "21 May 2016"}
{"review_id": 152, "restaurant_id": -15, "username": "beckyn170", "date_of_visit": " January 2016", "rating": "1", "title": "Completely ruined my friends birthday", "comment": "The worst bar I have ever been to. My friend booked an area for 15 people for her birthday 2 months in advance and when we go here we were given 2 tables with about 4 seats. We then put our coats on the seats and after about 2hrs were told they had to go in the cloakroom. The bouncers then proceeded to just pick up random coats and when I asked politely if I could see what they had picked up to see if it was my coat, I was rudely and aggressively asked by a bouncer why I was getting involved - err, maybe because you have my coat in your hand! There was hardly anyone in the bar at the time and we were all around our area so doing no harm to anyone else. It has been a complete disappointment and the way the bouncers spoke to our party put a complete downer oN the night. It is really not worth the aggravation coming here, there are much better places close by to have a great night in!", "date_of_review": "23 January 2016"}
{"review_id": 153, "restaurant_id": -15, "username": "Ali M", "date_of_visit": " January 2016", "rating": "3", "title": "Roof top area with heating, loud music and good for a party", "comment": "Roof top area with heating, loud music and good for a party. Drink price reasonable for London. Worth checking out.", "date_of_review": "17 January 2016"}
{"review_id": 154, "restaurant_id": -15, "username": "Denise C", "date_of_visit": " February 2016", "rating": "4", "title": "After work drinks", "comment": "Went here yesterday What a lovely little place, cocktails and roof terrace fab. The staff were very welcoming and the security. So clean and a bit of fresh air rather than the Shoreditch grungy scene. Can't wait for the summer as I think it would be lovely up there.", "date_of_review": "5 February 2016"}
{"review_id": 155, "restaurant_id": -15, "username": "caramelmillie", "date_of_visit": " February 2016", "rating": "4", "title": "Nice bar, good cocktails and music", "comment": "Went here with a group of friends to celebrate my friends birthday. Shame about the entrance fee after 9pm which is £7. The cocktails were good and were worth the price as were the spirits and mixers which were 'free poured'. Nice covered roof terrace and the music was decent inside. Only downside is the music is very loud so you cant really talk to each other inside. Overall we had a good time and i would go back.", "date_of_review": "9 February 2016"}
{"review_id": 156, "restaurant_id": -15, "username": "ar0shm", "date_of_visit": " February 2016", "rating": "5", "title": "Fabulous place!! ", "comment": "Cocktails are awesome and prices are reasonable too..  Bartender with braided hair provided us a good service in a really busy environment. Definitely visit again!!", "date_of_review": "12 March 2016"}
{"review_id": 157, "restaurant_id": -15, "username": "francescatb", "date_of_visit": " May 2016", "rating": "2", "title": "More bad than good.", "comment": "I visited last night, just myself and a friend. I called ahead at about 9 to request a reservation and was told one wouldn't be necessary, however I gave her my name and asked for hers (Billie). Billie clearly came through despite saying we didn't need a reservation, as once we got to the door the doorman asked if we had one! Thankfully Billie had put us on the list. We were then surprised with a £7 entrance fee which I had not expected (probably through my lack of research)- also cash only. We had none and were directed to a cash machine very close by, however as it was five past eleven when we went back in, they tried to charge us a £10 fee. Thankfully the lady also on the door sorted this out for us which we were grateful for. Once inside it was clear that The Golden Bee was not what we had been looking for. Expected a good bar with plenty of seating and some medium to low level house music- it was a straight up club full of too drunk try hards. We headed to the ladies immediately where a sloppy drunk lady was getting irate about having to queue. The queue was long, and to top it off a girl who cannot have been older than 18 pushed past to vomit all over the sinks. Charming. The male bathroom attendant definitely does not get paid enough, poor bloke. We then avoided the indoor bar area as it was completely rammed and packed full of men shoving and pushing around. I thought we could try the roof terrace for a quieter, sit down area but when we went to go up there was a fellow only letting people through who had a booking! Obviously I didn't have one (this is the second time we had needed one when I was led to believe we didn't) but a mere mention of Billie's name got us up very quickly. Manners costs nothing, which I think helped also. The roof terrace looks great. Views are nonexistent but it was nice to have the fresh air and there was no risk of getting cold- plenty of heaters. Unfortunately the vibe was similar to downstairs, a lot of sloppy too drunk people pushing to get in at the bar. Thankfully it wasn't as crowded but it was still very busy. The man on the bar wasn't very helpful when discussing drinks and I had to ask for a menu as there wasn't any in sight. I ordered a Golden Bee because I love a gimmick! It was very, very sweet and had a little chocolate bee sitting atop. My friend had a pornstar martini which she said was fine. There was unfortunately nowhere to sit until 1140, and the rooftop closed at 12. If we had known this we wouldn't have come in. We left pretty much straight away and managed to get in at the NightJar down the road, where we paid a £5 cover fee and got to enjoy excellent drinks, our own table, 90 minutes of amazing live jazz,some really comfy surroundings and attentive service until closing at 3. I wonder which would be considered more value for money..", "date_of_review": "1 May 2016"}
{"review_id": 158, "restaurant_id": -15, "username": "698staceyg", "date_of_visit": " September 2015", "rating": "4", "title": "After work drinks on a Friday", "comment": "I have been here twice on a Friday after work to take advantage of the 2 for 1 cocktail happy hour deal. The cocktails are amazing and cannot be faulted! The classic Golden Bee is a must to try, fruity, punchy and alcoholic! lol Lovely roof top bar in the summer or winter (have heaters and a great coal fire type thing going), inside they have great music and a few seats that you can use (mostly reserved but can use them until the reservation time). A nice lil bar in Shoreditch for a few cocktails after work or a good night out also!", "date_of_review": "6 May 2016"}
{"review_id": 159, "restaurant_id": -15, "username": "Asim88", "date_of_visit": " January 2016", "rating": "1", "title": "Horrific.", "comment": "This place is horrific. Rude staff, bad venue and over priced. Even when I complained via email the following day there was no follow up. What a dive,", "date_of_review": "15 January 2016"}
{"review_id": 160, "restaurant_id": -15, "username": "Charlotte H", "date_of_visit": " May 2016", "rating": "4", "title": "Busy bar & a long wait at the bar!", "comment": "This bar is quite quirky! It has a rooftop but not that we saw it because it was too busy apparently to go up there unless you had a reservation. I was there at 5:30pm and the bouncer wouldn't even let me upstairs to look! Drinks are good-they have a happy hour with 241 cocktails and wine is £2 off. Managed to get seats in the shaded terrace area. Not sure if this place does food but it can be a long wait at the bar for drinks with everyone ordering cocktails! Make a reservation in advance is my advice!", "date_of_review": "10 May 2016"}
{"review_id": 161, "restaurant_id": -15, "username": "Tynanj", "date_of_visit": " May 2016", "rating": "1", "title": "Rude and pretentious ", "comment": "Don't bother. Staff are rude and pretentious. Some kind of power trip. Lady of the door grunts at you to ask if you are on the \"guest\" list. Just say you have friends there and she grunts fine. Pointless. Then the lady letting you go to the rooftop is less than personable. Wouldn't let me take my work bag because it was too big. They just want to charge you at the cloak room. Not worth it. ", "date_of_review": "13 May 2016"}
{"review_id": 162, "restaurant_id": -15, "username": "purplemuse", "date_of_visit": " August 2015", "rating": "3", "title": "Just for drinks", "comment": "Cocktail list seemed decent. My friend ordered the pornstar cocktail, it was with passion fruit and it was good! I got the lavender martini which was also quite interesting. Loads of cocktails to try, but I'm just not a fan of heavily sweetened drinks alcoholic or not. As for service, the staff only came to our table to clear bottles and empty glasses. He didn't take any orders, but he did ask if we want more drinks. When we said yes, he just pointed us to the bar? Why even bother asking.  Nice place for drinks at the rooftop area. ", "date_of_review": "17 August 2015"}
{"review_id": 163, "restaurant_id": -15, "username": "SailorJerry2783", "date_of_visit": " August 2015", "rating": "5", "title": "Best rooftop bar in London", "comment": "Not too sure how anyone could say anything but great things about this place. Awesome rooftop bar/seating area, reasonably priced drink considering it's Shorditch, amazing setting, sweet tunes and very accommodating and friendly staff.", "date_of_review": "17 August 2015"}
{"review_id": 164, "restaurant_id": -15, "username": "elleott", "date_of_visit": " July 2015", "rating": "4", "title": "Outdoor drinking space, a rarity in Central London", "comment": "Nice venue for cocktails and beers. Good with friends or clients, great for a Friday night. Has a popular roof terrace. ", "date_of_review": "2 September 2015"}
{"review_id": 165, "restaurant_id": -15, "username": "WildSpiritGotFree", "date_of_visit": " July 2015", "rating": "3", "title": "Good place for few drinks on the week", "comment": "I went to Golden Bee on Thursday after work for few drinks. We got in without any problems, although there were few people queuing outside, we just asked if its OK to come in..... The happy hour was still on, so we had few two for one cocktails, which were nice and well presented (and very popular, as the queue was long and slow). The roof terrace was open, so we managed to squeeze in. They have got good heaters, so people can stay out until late. It was quite busy for a school night, but I guess Thursday is a new Friday :) Varied crowd, from hipsters of Shoreditch to cool kids and business people.  Would like to try their Rooftop Cinema thing....", "date_of_review": "20 August 2015"}
{"review_id": 166, "restaurant_id": -15, "username": "Richard G", "date_of_visit": " September 2015", "rating": "4", "title": "Nice Roof Terrace", "comment": "Not normally a bar fan, but this wasn't a bad example, at least the music doesn't get cranked up until later at night. The roof terrace was very pleasant but did get close up during rain. Downstairs was fairly relaxed, didn't take too long to get a drink.", "date_of_review": "18 September 2015"}
{"review_id": 167, "restaurant_id": -15, "username": "Pete2591", "date_of_visit": " October 2015", "rating": "2", "title": "Disappointing", "comment": "I have been to the Golden Bee a few months ago and had a great time so I planned to go there for my birthday. If you want to get on the guest list, you must be in the building by 9pm?! Ridiculous. They're just trying to get more money out of you by making you sit in there drinking their weak, expensive drinks.  On this occasion, I didn't bother organising a guest list as we weren't 100% sure of our plans and couldn't commit to arriving before 9pm.  As it turns out, we arrived at about 9.30pm but due to the weather, the rooftop bar had closed and therefore inside was twice as busy. So they were only letting in guest list. About 15 of us excited to go there and didn't even get past the front door. Very frustrating. If adverse weather affects them this much, why don't they mention this on their website?? It's a nice place to go, decent music and drinks are reasonably priced but it does take a while to get served. Give it a go but only via guest list to guarantee you get in.", "date_of_review": "26 October 2015"}
{"review_id": 168, "restaurant_id": -15, "username": "Diananov", "date_of_visit": " October 2015", "rating": "5", "title": "Friday Night with Friends", "comment": "Most surprised to see Happy Hour Cocktails on a Friday night. We had a booking on the roof top bar. Staff were friendly, ambience amazing. Definitely worth a visit.", "date_of_review": "26 October 2015"}
{"review_id": 169, "restaurant_id": -15, "username": "Caitlin H", "date_of_visit": " November 2015", "rating": "3", "title": "Good atmosphere", "comment": "Only went for drinks after work. Good atmosphere, nice outdoors area although they stopped letting us to the roof which was a bit annoying. Drinks were as expected.", "date_of_review": "19 November 2015"}
{"review_id": 170, "restaurant_id": -15, "username": "Xplor138", "date_of_visit": " December 2015", "rating": "5", "title": "Manhattan style club with hip roof bar", "comment": "Spent an evening here with colleagues in the run up to the festive break. Great atmosphere. Mild weather enabled us to use the roof top bar which was dressed in white lights and white branches to create a stylish Christmasy vibe. Very New York.  The roof is spacious. For the winter months there are plenty of gas heaters and fire pits... It was almost too hot in the heat envelope around these units.  Hip DJ music plays. And talking of mixing: cocktails are professional.  It's a reasonable priced venue. It won't be the cheapest but nor is it unusually priced. ", "date_of_review": "27 December 2015"}
{"review_id": 171, "restaurant_id": -15, "username": "Aliciooop", "date_of_visit": " June 2015", "rating": "3", "title": "Disappointing", "comment": "I expected more from the rooftop, it was the whole reason we went! But given you can't book a table, and the happy hour is very restricted, it was quite disappointing. That said, the passionfruit daquiris are delightful.", "date_of_review": "30 June 2015"}
{"review_id": 172, "restaurant_id": -15, "username": "Pina P", "date_of_visit": " June 2015", "rating": "5", "title": "LOVE THIS PLACE! Another Rooftop Gem in London...", "comment": "In the heart of Old street tucked away in a side street I found this amazing intimate bar with an incredible roof terrace! Music was cool and chilled and upbeat...a mix the DJ had done.  I loved it so much have booked my birthday party there. Happy hour between 5-7pm and drinks are reasonable London prices. Compared to all the pretentious rooftop bars in London this comes up trumps. It is a VERY COOL and friendly place...great mix of people and all welcome atmosphere. Great for after work drinks in summer. ...I am sold!", "date_of_review": "30 June 2015"}
{"review_id": 173, "restaurant_id": -15, "username": "BWILS2013", "date_of_visit": " July 2015", "rating": "1", "title": "Didn't even get past the door", "comment": "Travelled from West London on a Friday at 5.30pm. As had the day off was dressed casually in shorts and t-shirt. Was told by the bouncer at the door that it was reservations only on Friday and we couldn't get in. The place looked empty. Have been here before on a Friday night after work when I was dressed in smart attire and never any problems so all I can think of is that they didn't want people in casual attire. Ok fair enough but I will not be coming back .", "date_of_review": "17 July 2015"}
{"review_id": 174, "restaurant_id": -15, "username": "Kanny23", "date_of_visit": " July 2015", "rating": "1", "title": "Absolutely awful customer service SO RUDE!", "comment": "Have never been but I phoned up to find out about doing a private hire of the venue for an exclusive celebrity event. The woman I spoke to was so rude and aggressive on the phone and very unhelpful. It completely put me off wanting to go the venue....needless to say I won't be visiting as I can't imagine what their customer service would be like!!!", "date_of_review": "2 July 2015"}
{"review_id": 175, "restaurant_id": -15, "username": "Albanthiery", "date_of_visit": " July 2015", "rating": "2", "title": "Small rooftop.", "comment": "This bar has a great promise, which fails to deliver properly. The service is extremely slow and the rooftop is so small that our huge end of year party could not go in. We had to insist to be allowed on the rooftop.", "date_of_review": "20 July 2015"}
{"review_id": 176, "restaurant_id": -15, "username": "ChrNew2407", "date_of_visit": " July 2015", "rating": "5", "title": "A nice venu", "comment": "The bar is a very well kept and a nice venue. The space available is limited if the rooftop bar is inaccessible. Drink prices are reasonable for a central London bar and I would happily visit again.", "date_of_review": "20 July 2015"}
{"review_id": 177, "restaurant_id": -15, "username": "Chubbychubs", "date_of_visit": " August 2015", "rating": "2", "title": "No no no", "comment": "Visited with a mate and found this to be yet another one of these places that places 'style' over substance!  The reason I've put style in inverted commas is because it actually lacks any at all!  Bought a bottle of prosecco but wasn't allowed to take it away until it was transferred into the most awful plastic beaker!  In short, this place is quite tacky, full of wanna be individuals who think they've cracked it because the get a stamp and are allowed beyond the velvet rope!", "date_of_review": "2 August 2015"}
{"review_id": 178, "restaurant_id": -15, "username": "st3w4rt", "date_of_visit": " August 2015", "rating": "2", "title": "Pretentious with rude staff", "comment": "Went here on a Friday evening for a friend's birthday. Initially I was impressed with the decor, but that's about where it ended. My friend was on the rooftop, but we were refused entry as 'more people were expected there', so they had to come down to meet us. The woman guarding the steps was very rude and unhelpful. I enquired at the bar about which cocktails were included in the happy hour prices, and the woman behind the bar reeled off an incomprehensible list, and then turned and served someone else instead. Having worked out that a pornstar martini was included, I had a few of these, and each one tasted different from the last. My friend then managed to order a different cocktail by taking a picture of someone else's - this tasted as if it had no alcohol in it. Another person in our party arrived an hour or so after us, and the door staff were initially not going to let him in as he was wearing jeans and a shirt (apparently not smart enough), until he was rescued by another member of our party. There were others already in the bar wearing jeans, so not sure what that was about?  All in all, this is a pretentious place, that thinks it has class, but does not. There are other much nicer bars to spend your money on in London.", "date_of_review": "10 August 2015"}
{"review_id": 179, "restaurant_id": -15, "username": "hannah D", "date_of_visit": " August 2015", "rating": "5", "title": "Very happy I went even after reading all awful reviews", "comment": "I never leave reviews but this time I think its important to leave one.I have first read all the reviews and was hesitant to visit the golden bee. I am so so glad I went in the end. The venue is amazing!!! The staff are very friendly. I think people that leave the negative reviews are simply costumers with no respect for the staff. The terrace has limited space and due to health and safety there is a capacity that they look after (this was explained to me on arrival)Me and my friends waited about 10min and was let upstairs after a few ppl left . Music was amazing I had a really great night out after a long time will definitely come back to party. Thank you!!! I will recommend you further!", "date_of_review": "12 August 2015"}
{"review_id": 180, "restaurant_id": -15, "username": "MattEatNow", "date_of_visit": " June 2015", "rating": "3", "title": "Great venue, terrible DJ, average drinks", "comment": "It's in a great location with an amazing terrace (if it's not raining) and we found the staff very attentive and friendly. However, the bar staff have no idea how to make a drink - terrible gin & tonic or whiskey & coke. The music (on a Saturday night) was naff enough to clear the dance floor and then the place.", "date_of_review": "20 June 2015"}
{"review_id": 181, "restaurant_id": -15, "username": "mel101109", "date_of_visit": " August 2015", "rating": "1", "title": "Don't bother", "comment": "This place would be classy if it wasn't full of sleezeballs. both times I have been the rooftop has been closed. If your going to charge £10 entry at least state that the rooftop is closed. Guys are hungry in this place, u can't walk past without 1 groping you. And if u tell the bouncer they don't want to know or deal with it. My friend made a complaint after this guy pushed her and the bouncer shouted at her! Never going back! Save the trip guys", "date_of_review": "16 August 2015"}
{"review_id": 182, "restaurant_id": -15, "username": "CharleneAC", "date_of_visit": " April 2015", "rating": "2", "title": "Great outdoor area but no bartenders available.", "comment": "the roof top terrace is great and has some nice sofa's and a good bar. Unfortunately not enough staff behind it. Well that's not true: there were 4 people behind the bar, however only 2 were serving. This wouldn't be a big issue if the first floor bar, which also sevices the attached second outdoor area, actually had staff behind it. No one was there for pretty much the majority of the evening. The happy hour isn't amazing compared to a lot of places in the area. I don't think I'll be coming again.", "date_of_review": "17 April 2015"}
{"review_id": 183, "restaurant_id": -15, "username": "Truthhurts21", "date_of_visit": " March 2015", "rating": "1", "title": "Awful just awful", "comment": "Never have I been to a bar so small overpriced and with people that have no manners. The bar staff were Rude. You could not move so end up get shoved by other people with no care in the world. Would never recommend this place to anyone ", "date_of_review": "8 March 2015"}
{"review_id": 184, "restaurant_id": -15, "username": "Amy T", "date_of_visit": " April 2015", "rating": "5", "title": "Amazing roof terrace!", "comment": "This place is very un-assuming on the outside, but once you venture up the stairs there is a fantastic (small) world of good music and delicious cocktails. Venturing up another set of stairs it opens up into the roof terrace, showcasing the awesome views and with the many fire pits and patio heaters there is an abundance of heat to keep out the chill of the evening.  A lovely small venue which is a great place to meet friends up on the terrace, then you can continue the night with more drinking and dancing in the main bar when the terrace shuts. A great all rounder!", "date_of_review": "21 April 2015"}
{"review_id": 185, "restaurant_id": -15, "username": "Natalie E", "date_of_visit": " April 2015", "rating": "1", "title": "AVOID THIS PLACE!", "comment": "We decided to go here for a friends 30th on a Saturday night. We travelled a fare way to get there and paid a lot and we was really looking forward to it as we reserved a roof top table... It was freezing!! Don't bother reserving until summer!  When we walked in I didn't realise it would be so small and thought there would be other rooms.. No.. The 'dance floor' if you can call it that was smaller than my living room! NO JOKE  We stayed on the roof top for a couple of hours drinking dirty martins which were very nice (but expensive £8.50). Then decided to go get warm inside and have a dance. Bad move! The corner sofa inside is next to the dance floor and a group had hired out the sofas.  We stood drinking our drinks until a girl said sorry you can't dance here we have hired this whole area!!?? .. We asked the bar staff if we could stand there as we wanted to dance (as that's what you do when you go out) they said it was fine to dance there as long as we didn't sit on their sofas. That was fine, we never. So went back and stood there having our drinks as it was there or back outside as there was NOWHERE else to stand..they all started again!  The girls were full of attitude! And then an argument broke out to which WE got thrown out. Very embarrassing! Would never EVER go back again or even would I recommend this place to anyone! The bouncers were pathetic.. If you like to dance and enjoy your evening do NOT go here!", "date_of_review": "19 April 2015"}
{"review_id": 186, "restaurant_id": -15, "username": "Anna G", "date_of_visit": " April 2015", "rating": "5", "title": "Loooovvve this place!", "comment": "I love the Golden Bee, its a great looking bar with a gorgeous roof terrace. Music is great, cocktails are lovely and there's always a great atmosphere. I've been a few times over the years and have never had a bad night but it does get super busy so worth getting a table in the bar or better still the roof terrace! Friends have always loved this place too, its a real gem in Shoreditch x", "date_of_review": "27 April 2015"}
{"review_id": 187, "restaurant_id": -15, "username": "SarahG950", "date_of_visit": " June 2015", "rating": "1", "title": "Avoid this pretentious bar", "comment": "Rude staff. Who does this place think it is?!  We were told that because we hadn't reserved we could only stay for an hour by the door staff. So why did the lady on the stairs to the roof terrace preach to us again and when my boyfriend tried to tell her that we were only staying for one, did she rudely say \"if you let me finish!\" Unbelievably rude!! And the place was empty! Will never go again. Not worth it. ", "date_of_review": "13 June 2015"}
{"review_id": 188, "restaurant_id": -15, "username": "L M", "date_of_visit": " June 2015", "rating": "4", "title": "Pretty Cool :)", "comment": "I visited on Saturday the 6th June, with my partner to celebrate her bday, in general, pretty cool place, friendly staff, funky crowd and place, best practice pre - book. Good place.", "date_of_review": "8 June 2015"}
{"review_id": 189, "restaurant_id": -15, "username": "Jade189", "date_of_visit": " May 2015", "rating": "1", "title": "Rudest staff and disgusting customer service", "comment": "I have never been to a bar with such awful staff. Went here for one nice drink in the afternoon. Paid £50 for a round of drinks and the staff were so rude we left before even finishing the drinks I was so appalled. Do not go here I will never go back.", "date_of_review": "9 May 2015"}
{"review_id": 190, "restaurant_id": -15, "username": "z0ltan1", "date_of_visit": " June 2015", "rating": "5", "title": "Great service!!!", "comment": "Hey all, i don't usually leave feedbacks, but today we found this place with my girlfriend and decided to go for a few drinks as we liked the rooftop.... Now I have to say I'm just impressed!! Bujar the bartender was super friendly and his knowledge was great about cocktails. He recommended the golden bee to me and passionfruit Collins to my girlfriend which we had all night!!! If u want nice service and chilled atmosphere come here!", "date_of_review": "16 June 2015"}
{"review_id": 191, "restaurant_id": -15, "username": "MAJA1221", "date_of_visit": " August 2014", "rating": "4", "title": "A decent rooftop", "comment": "The Golden Bee is a place few seem to know about. Tucked away in a small street of Old St, it offers a three level rooftop with a nice design. Drinks are well priced (for a Shoreditch bar) and the crowd is definitely more vibrant after 8.30 ( try 9 for a decent young crowd) I encourage you to book before hand as the queue can get out of hand on week ends!", "date_of_review": "12 August 2014"}
{"review_id": 192, "restaurant_id": -15, "username": "ByeByeBlues7", "date_of_visit": " June 2014", "rating": "4", "title": "A hit! ..But ditch the palm trees! ", "comment": "Definitely a hit in Shoreditch this new rooftop bar. Much charm is added after sunset, once the darkness sets in, the main fire gets burning and fairy lights are turned on.. (Shame about the plastic palm trees which cheapen the decor quite a bit).  Good cocktails and good music. I wouldn't particularly recommend it on a grey day though and the female bar tender could do with cheering up a little but overall an interesting find. ", "date_of_review": "13 July 2014"}
{"review_id": 193, "restaurant_id": -15, "username": "Sparkles38", "date_of_visit": " July 2014", "rating": "5", "title": "Monday Cocktails", "comment": "What a lovely surprise that was. Monday night cocktails. 2 for one = £8.50 for two before 8pm. Lovely. I never go East but wanted to check this place out. Definitely book a space on the roof in advance if you can. We managed to sit down but if it was a Friday or Saturday that would never have been possible! Fairy lights, palm trees, flip flops for decoration. Definitely come and check it out. Though there are a lot of stairs to get down if you need to get to the toilet! This is not a wheelchair friendly venue!", "date_of_review": "16 July 2014"}
{"review_id": 194, "restaurant_id": -15, "username": "assafrances", "date_of_visit": " August 2014", "rating": "2", "title": "Chavy, non friendly service", "comment": "7 pm and blasting house music? Seriously? Talk about peaking too early... Upstairs bar staff quite unfriendly, drinks 90% ice and very basic. For a classic chavy shoreditch experience, come here (don't!)", "date_of_review": "13 August 2014"}
{"review_id": 195, "restaurant_id": -15, "username": "Sam L", "date_of_visit": " September 2014", "rating": "1", "title": "AVOID THE GOLDEN BEE LIKE THE PLAGUE!!!", "comment": "Atmosphere was forced, As a cocktail bar it was way below any standerd I would expect from a \"swanky\" Shoreditch cocktail bar, the staff were armatures and rude (specifically the black guy with the short dread locks who was actually very aggressive for no reason when I tried to order a drink). I will never go to the Golden Bee EVER again or recommend anyone to go there! AVOID THE GOLDEN BEE LIKE THE PLAGUE!!! (Should be called the pissed off wasp rather than the Golden Bee)", "date_of_review": "4 September 2014"}
{"review_id": 196, "restaurant_id": -15, "username": "Amelia G", "date_of_visit": " December 2014", "rating": "4", "title": "Lovely ", "comment": "The golden bee is a lovely hidden rooftop bar in shoreditch. The staff are lovely and the cocktails are different. Went here for a few drinks on a saturday. Reserved a spot on the roof for around ten people. It was forcasted to rain soon so i was told i would be allocated downstairs under a covered area when it rained but they kept it open for as long as they could which was nice. The heaters really allowed you to enjoy yourself without shivering in the typical british weather. Its my 3rd visit here and ive never had a bad experience. Defo will be returning as again. ", "date_of_review": "1 March 2015"}
{"review_id": 197, "restaurant_id": -15, "username": "Kingkenny72", "date_of_visit": " February 2015", "rating": "3", "title": "Small & very sweaty bar but good music.", "comment": "We recently visited Golden Bee, i booked guest list but upon arrival was not on the there until i produced a confirmation email, after the £10 entrance we walked upstairs and found the bar to be very small, the drinks were quite expensive and the service not great but it was a Saturday night and to be expected.  The roof top bar was great but dread to think what it would of been like if everyone was inside as the bar/dance-floor was very small, the music was great and a good crowd - very young though (for me) I would go again but not rush...", "date_of_review": "4 March 2015"}
{"review_id": 198, "restaurant_id": -15, "username": "cherifkh", "date_of_visit": " September 2014", "rating": "5", "title": "Happy hour happy people", "comment": "Went there to catch up with 2 friends. Really friendly staff, and really good deals during happy hour. We also had some shots offered to us. Would highly recommend especially when the weather is good to be able to enjoy their marvellous roof top.", "date_of_review": "6 October 2014"}
{"review_id": 199, "restaurant_id": -15, "username": "SF1992", "date_of_visit": " December 2014", "rating": "4", "title": "a hidden gem", "comment": "it was my friend's birthday and she took us all to the golden bee late on a Saturday night, it was so unexpected. You go in and the whole place was completely modern and clean, even the cloakroom only cot £1! the music was brilliant and the atmosphere was fun. not a lot of room to dance it is on the tiny side which is a shame. The roof was brilliant and well heated, great smoking area for my friends. Overall it was a fun night full of young people and great music, I would recommend this place as a place to visit", "date_of_review": "8 December 2014"}
{"review_id": 200, "restaurant_id": -15, "username": "twloakes", "date_of_visit": " October 2014", "rating": "1", "title": "Awful Place", "comment": "Hot, dark, pricey full of itself and really just naff. Ordered a dirty martini and got half a glass and when I complained was told 'we are busy that is what you get'. I then had to pay full price. Shore Ditch is full of great bars and pubs. Don't bother with this dingy, over priced hole with pathetic bar staff.", "date_of_review": "20 October 2014"}
{"review_id": 201, "restaurant_id": -15, "username": "Alison W", "date_of_visit": " August 2013", "rating": "4", "title": "Another good summer bar", "comment": "Golden Bee, built up its reputation for a great summer bar this year, it has to be one of my favourite rooftop bars. Its not very big and the guest list for the top floor can get booked out really quickly. Happy hour on cocktails are reasonable but after that be prepared to splash a bit of cash, as the night goes on the party tend to move more indoors and as most roof bars can get a little packed.  Music is decent, the DJ played a good mishmash that seemed to keep everyone happy, atmosphere is quite chilled out average age is probably around 25. All in all another nice bar in the summer, not sure I would go out of my way in the winter.", "date_of_review": "3 December 2013"}
{"review_id": 202, "restaurant_id": -15, "username": "SashaLDN", "date_of_visit": " June 2014", "rating": "4", "title": "The rooftop bar is worth the visit!", "comment": "I went to the Golden Bee on saturday. I'm a west londoner and don't frequent the east except for the Shoreditch House. A friend had a birthday party at the rooftop bar and I was wonderfully surprised. It feels like you're in a tropical island of some sort with the palm trees decor. The seating is very comfortable and the cocktails absolutely lovely! I will revisit and do recommend it.", "date_of_review": "1 July 2014"}
{"review_id": 203, "restaurant_id": -15, "username": "xloudedahx", "date_of_visit": " April 2014", "rating": "5", "title": "Best hidden secret in shoreditch!", "comment": "Not the most easiest of places to find but what a gem!! Had an area in the roomtop bar reserved, the roof is all heated so the cold weather should not put you off. we ordered 2 platters of sushi.. the best sushi i have had in a long time!!! best cocktails.. must try the haribo sweet one!!! already booking up for my next visit!", "date_of_review": "4 April 2014"}
{"review_id": 204, "restaurant_id": -15, "username": "Richard N", "date_of_visit": " March 2014", "rating": "4", "title": "Summer drinks", "comment": "Great for summer drinks on the roof terrace. Quite a few steps for ladies in heels to the top but well worth it. They have blakets and heater and a fire pit so doesn't feel cold even on a chilly evening. They don't do pints which is annoying but all teh same it's a great place to sit out in the sun and drink. I booked an area for 20+ friends for my birthday but we only got one small table to seat 6 which was a bit annoying. I'd still recommend it though.", "date_of_review": "25 April 2014"}
{"review_id": 205, "restaurant_id": -15, "username": "Miss T", "date_of_visit": " June 2014", "rating": "2", "title": "Don't go for late night drinks.", "comment": "We visited Golden Bee on Saturday for late night drinks. It may have been an oversight on our part but I had no idea that the roof terrace closes at 11pm. We arrived at exactly 11pm and the club was rammed with people that had headed down from the terrace. We paid £15 for two G&T's and crammed into a corner of the smoking area. Within twenty minutes a fight broke out between a customer and a bouncer, we watched a huge bouncer continuously punch a guy until the fight was moved outside. I've seen tons of fights in clubs but none as bad as this. A girl next to us had her foot cut open by flying glasses. I have read reviews of Golden Bee and reports of violent and aggressive bouncers and our experience only confirmed this. We left after an hour. It may be different in the daytime when the terrace is open but not sure I will be visiting again.", "date_of_review": "9 June 2014"}
