{"review_id": 1, "restaurant_id": -2, "username": "MHB4634", "date_of_visit": " September 2020", "rating": "4", "title": "Absolutely proper VIP style, but no pints...", "comment": "I was gobsmacked when I got off the lift. We were greeted by friendly staff. We were led to our table and given an unbelievable view of the Tower of London, Tower Bridge, The Shard and The Gherkin. It was utterly amazing and i felt like a high roller. They take tabs and in the COVID 19 pandemic they do table service. Theres smoking facilities. A balcony with amazing skyline. They only take card at this time. HOWEVER i was a bit disappointed when I found out they didnt do pints. Only bottles. And 1 bottle of budweiser cost £6. Ok its London and a very posh place, but no pints? Not too happy with that. But everything else? Top notch. Defo worth a visit ", "date_of_review": "25 September 2020"}
{"review_id": 2, "restaurant_id": -2, "username": "Nic S", "date_of_visit": " July 2020", "rating": "3", "title": "Wanted to love it but didn't", "comment": "I think if I had gone to this bar in normal times it would have been fantastic. Thanks to COVID it felt really quite surreal, a bit like being in a David Lynch show.  First we were met on the ground floor by someone checking we had a reservation; they called someone else to let them know we had arrived and called the lift for us. When we got upstairs we were met again and offered hand sanitiser and shown to our table. It felt slightly military-esque. We ordered cocktails which were incredibly strong, to the point of not being very pleasant to drink. The view was nice but the seats we were on were very hard, so we asked to move.  If the bar had been busy I can imagine it having a really good atmosphere but sadly despite it being a Saturday it felt quiet and a bit soulless.", "date_of_review": "27 July 2020"}
{"review_id": 3, "restaurant_id": -2, "username": "reeve96", "date_of_visit": " August 2020", "rating": "5", "title": "Nice View ", "comment": "Although it took a while to be served after being seated it was a pleasant surprise to have the drinks complimentary. The view is fantastic and the service good despite the delay. Drinks are well worth the money and I would return. ", "date_of_review": "28 August 2020"}
{"review_id": 4, "restaurant_id": -2, "username": "LornaH72", "date_of_visit": " September 2020", "rating": "5", "title": "Views are amazing", "comment": "Again the views here are spectacular. Friendly efficient staff. Great range of cocktails which where divine. Good atmosphere. Cant wait to go back", "date_of_review": "13 September 2020"}
{"review_id": 5, "restaurant_id": -2, "username": "Michellehelenar", "date_of_visit": " September 2020", "rating": "5", "title": "Great view for a warm night! Lovely fairy lights", "comment": "Really great layout for a warm night, with blankets provided for when it gets cold. It was a shame they served no food but the drinks were good.", "date_of_review": "18 September 2020"}
{"review_id": 6, "restaurant_id": -2, "username": "PaulBthebrit", "date_of_visit": " August 2020", "rating": "5", "title": "Superb Cocktails and Views", "comment": "Evening with friends flew by as we watched the sun set and shared a few cocktails on a Saturday evening. Of course we had to book but we're not rushed and spent a full evening in this fantastic roof bar.", "date_of_review": "21 August 2020"}
{"review_id": 7, "restaurant_id": -2, "username": "973jandirak", "date_of_visit": " August 2020", "rating": "1", "title": "A strange service", "comment": "I went with my friend, and the reception was good, but they asked us for our credit cards to keep, and only deliver it at the end, I thought it was ridiculous, and I thought there would be more cards when I went I only had my card and my friend's, I don't know if this is a company policy, but if it is a little strange and against the law. And I was in doubt if it had anything to do with our skin tones", "date_of_review": "8 September 2020"}
{"review_id": 8, "restaurant_id": -2, "username": "Ch28437", "date_of_visit": " October 2020", "rating": "1", "title": "Disappointing - poor service and steep prices", "comment": "I had booked Savage Garden for weekend drinks and was disappointed with my experience. Upon arrival, we were met with a grumpy door staff by the lift. We then went upstairs and ordered a few drinks - an eye-watering £18 each for cocktails and gin and tonics! Throughout our two hours there, there was very little service. For the price point, we expected slightly more for the service - (a smile would have sufficed). Views are good but also achievable elsewhere with better service and the same price.", "date_of_review": "12 November 2020"}
{"review_id": 9, "restaurant_id": -2, "username": "C6912XCsophief", "date_of_visit": " November 2020", "rating": "5", "title": "Amazing atmosphere", "comment": "Had some lovely drinks and amazing food here.  Sadly was raining so could not use the rooftop but the food and atmosphere made up for this Lovely original cocktails which are strong Food was scrumptious especially the sliders and the slow cooked lamb. Would highly recommend  A smart casual vibe (heels and dress)", "date_of_review": "23 November 2020"}
{"review_id": 10, "restaurant_id": -2, "username": "isobelh216", "date_of_visit": " September 2020", "rating": "5", "title": "Loved it", "comment": "Me and my friend spent the weekend in london and visited Savage Gardens on the Saturday night. We absolutely loved it! We originally reserved a table inside so we asked to be moved outside. The lady said that would be fine, however, we would lose the seats inside. We agreed and sat outside... and it started raining! So we sat under the covers and the owner came outside and very kindly offered us a seat inside again! We were so thankful and he was so pleasant. He even made us cocktails of our choice that weren’t on the menu. I chose a Sex on the Beach and WOW... the best one I have ever tasted!!! Brilliant service and we can’t wait to visit again :)", "date_of_review": "29 December 2020"}
{"review_id": 11, "restaurant_id": -2, "username": "TheBearMurray", "date_of_visit": " July 2020", "rating": "5", "title": "Great night and afternoon", "comment": "Great night and afternoon before went out for dinner , lovely hotel bar with amazing views and Callum on front of house couldn’t do enough for us . Great service and amazing drinks ", "date_of_review": "4 July 2020"}
{"review_id": 12, "restaurant_id": -2, "username": "StephenCr0ss", "date_of_visit": " February 2020", "rating": "5", "title": "Excellent views!", "comment": "Nice bar and bites of food in the top of the hotel. The views are amazing and it’s worth it just for that! Recommended ", "date_of_review": "17 February 2020"}
{"review_id": 13, "restaurant_id": -2, "username": "146ver_nicad", "date_of_visit": " February 2020", "rating": "5", "title": "My experience at Savage Garden", "comment": "My experience at Savage Garden was wonderful. Cocktails and food at the entrance provided by the smiley hostess were very nice. It’s been one of the best ones in London so far.", "date_of_review": "16 February 2020"}
{"review_id": 14, "restaurant_id": -2, "username": "975piotrekb", "date_of_visit": " March 2020", "rating": "5", "title": "Best day ever", "comment": "It was my first time in London with my wife at Savage Garden and it was great. Delicious drinks and snacks, perfect service, beautifull views. I will definetly visit again.", "date_of_review": "1 March 2020"}
{"review_id": 15, "restaurant_id": -2, "username": "457zuzannal", "date_of_visit": " March 2020", "rating": "5", "title": "I will come back!", "comment": "I visited Savage Garden again with my friends and again we had great time. We enjoyed some snacks and beef sliders very much. Their signature cocktails are distinguished!", "date_of_review": "1 March 2020"}
{"review_id": 16, "restaurant_id": -2, "username": "Thejetsetters2012", "date_of_visit": " February 2020", "rating": "4", "title": "First visit ", "comment": "Came here whilst storm Dennis was in full force. Smaller than I was expecting and nothing special but pleasant enough with nice view of Tower Bridge. The staff were friendly and attentive but there were only a few of us so it was pretty quiet and no atmosphere. We enjoyed the doughnuts and the extra gimmick of injecting your fillings. They were yummy. I would go again but would worry about lack of seating on a busy day. ", "date_of_review": "18 February 2020"}
{"review_id": 17, "restaurant_id": -2, "username": "jstrat", "date_of_visit": " February 2020", "rating": "5", "title": "Terrific Rooftop Bar, Good Food, Excellent View of Tower Bridge!", "comment": "Savage Garden, atop the Hilton Doubletree Tower of London is a fun bar with yummy bar bites and an incredible view. The bar has a nice energy, very talented bartenders, and one of the best views in London.  I recommend spending a happy hour of late night at Savage Garden.", "date_of_review": "2 March 2020"}
{"review_id": 18, "restaurant_id": -2, "username": "AliE241", "date_of_visit": " March 2020", "rating": "3", "title": "Great view, cocktails and", "comment": "Great view, cocktails and food but the live music ☹️. Always enjoy going to the roof bar to meet friends. However at 7 pm last night after 30 mins of very annoying sound checks a live duo started to play. At 710 we departed. Too loud, singer was flat and the atmosphere dipped. A number of other tables also left. We were sitting quite close to the duo, maybe if we had been round the corner or gone outside it may have been more palatable. ", "date_of_review": "11 March 2020"}
{"review_id": 19, "restaurant_id": -2, "username": "v_ctorg2014", "date_of_visit": " March 2020", "rating": "5", "title": "Terrific views and amazing outdoor terrace", "comment": "This rooftop bar is a must-visit if you are around Tower Hill. Staff is very professional and helpful. Just perfect for afterwork drinks. Nice cocktails and some good bites. Great energy and vibe at the terrace. Views from the terrace are astonishing.", "date_of_review": "14 March 2020"}
{"review_id": 20, "restaurant_id": -2, "username": "803daisyd", "date_of_visit": " March 2020", "rating": "5", "title": "Amazing Night Because of Carlos !!!", "comment": "We had the most amazing time !!!! Carlos.R our server made us feel so at home and was such a fun and friendly character!!! Made our night and we fell in love with him, cannot wait to return, beautiful scenes, brilliant service! Carlos recommended the French Martini which was insane! We loved it !!! LOVE YOU CARLOS - Daisy & Joanna xx ", "date_of_review": "14 March 2020"}
{"review_id": 21, "restaurant_id": -2, "username": "Char F", "date_of_visit": " February 2020", "rating": "5", "title": "Fabulous rooftop bar great atmosphere", "comment": "I was a fan of the previous offering in this space, a bright super modern roof top bar in the centre of the city with stunning views across tower bridge so was keen to see what had been done. I was not disappointed, the design is cool and edgy and dark whilst maintaining the modern twist with fabulous neon decoration and funky touches of opulence.. fab cocktails and nibbles great for Business drinks or friendly catch up.. one of my favourite “top” spots in the city", "date_of_review": "15 February 2020"}
{"review_id": 22, "restaurant_id": -2, "username": "yorgos2015", "date_of_visit": " January 2020", "rating": "5", "title": "Amazing bar and staff!", "comment": "Visited this place for the first time and I am definitely going back soon!  Excellent cocktails, amazing staff and the view...OMG.. Hidden gem in the City of London!!", "date_of_review": "17 January 2020"}
{"review_id": 23, "restaurant_id": -2, "username": "jorgehernando87", "date_of_visit": " January 2020", "rating": "5", "title": "Definitely a must!!", "comment": "I was there on Saturday celebrating my anniversary with my girlfriend. It was Superb!! Go for the Kohinor cocktail! Really profesional waiting staff!", "date_of_review": "20 January 2020"}
{"review_id": 24, "restaurant_id": -2, "username": "n4tou", "date_of_visit": " January 2020", "rating": "5", "title": "Cocktails with a view", "comment": "Great place for cocktails and food.. the views of Tower Bridge and the Shard are amazing! The members of staff are really friendly and offer a great service!! Would definitely recommend and we ll be back soon!!", "date_of_review": "18 January 2020"}
{"review_id": 25, "restaurant_id": -2, "username": "katinelis21", "date_of_visit": " December 2019", "rating": "5", "title": "Wonderful place!", "comment": "it's a wonderful place with a beautiful view to spend a good time. Good food, cosy atmosphere and very friendly staff. This is the place you want to comeback!", "date_of_review": "21 January 2020"}
{"review_id": 26, "restaurant_id": -2, "username": "neetneets", "date_of_visit": " January 2020", "rating": "5", "title": "Can’t wait to go back again!! ", "comment": "I had a great experience here. We ordered the carnivores plate and devils advocate cocktails. Great views as well! Will definitely be visiting again. ", "date_of_review": "20 January 2020"}
{"review_id": 27, "restaurant_id": -2, "username": "liamm443", "date_of_visit": " January 2020", "rating": "5", "title": "Highly recommended", "comment": "Went here for work drinks with a client team, 18 in total. Had a great night. Views, food and drink all very good and attentive service during the night. Would highly recommend it.", "date_of_review": "4 February 2020"}
{"review_id": 28, "restaurant_id": -2, "username": "Sea98", "date_of_visit": " January 2020", "rating": "4", "title": "Great views", "comment": "Great views of Tower Bridge and Tower of London and the Shard, good atmosphere, not a wide selection of wines.....The service was touch and go. I had to go to the bar several timers to order drinks.... 1 glass of Chardonnay is £17.00 + Service. You pay for the view. The waiters can be more attentive.", "date_of_review": "22 January 2020"}
{"review_id": 29, "restaurant_id": -2, "username": "bethquad", "date_of_visit": " February 2020", "rating": "5", "title": "Lovely views and staff ", "comment": "We visit Savage Garden for my partners birthday and boy did we enjoy it. The staff were very welcoming when we first arrived and we were quickly whizzed off to our seats which had astonishing views of the Shard and Tower Bridge. Our waiter was lovely! She assisted us with favourites on the menu. We ordered a bottle of champagne, and came back regularly to top us back up. She also came back to make sure everything was ok and we were enjoying the food. The staff had even surprised by partner with a little birthday treat which was sweet of them. The waiter had even wished him a happy birthday. We had such a lovely time at this place. The views are amazing and very picturesque! Would definitely go back and would recommend! ", "date_of_review": "2 February 2020"}
{"review_id": 30, "restaurant_id": -2, "username": "DimitriS423", "date_of_visit": " February 2020", "rating": "4", "title": "Great boozy brunch with a view!", "comment": "Booked a surprise boozy brunch for my girlfriend and this was great! Service was very efficient and nice! The view of the place is definitely a must as you have a clear one on Tower Bridge. The food was tasty and original! Definitely recommend the savage doughnuts for two which were incredible! It's great to have a filling but healthy brunch! (well I guess other than the doughnuts!)  If you can try to sit close to the window on the high tables so you make the most of the scenery!", "date_of_review": "5 February 2020"}
{"review_id": 31, "restaurant_id": -2, "username": "tsea2019", "date_of_visit": " December 2019", "rating": "1", "title": "If you are looking for a nice afternoon tea experience, DON'T GO THERE!", "comment": "The website and pictures looked good and we booked. What a mistake! The view from the bar is amazing.  Afternoon tea was served in a sort of long corridor. Extremely loud and chaotic. Seemed like we were sitting in a public thoroughfare. We changed seats, credit to the nice nice Head waiter (??). He was very polite and did his best but still chaotic and noisy. The occasion was a surprise birthday celebration. Had called weeks earlier to ask if they would do something special....oh yes we will!..a candle to mark the occasion. Did they even care or remember?..of course not! Didn't want to mention this to our waitress as we decided against it in order not to confuse her. Why? - while choosing our teas, she tried to explain that Tea is included in the price :) :) :) The sandwiches were OK. Nothing to write home about. Scones were great. The jam and cream could have been served in a better way. The cakes were mediocre. Tea quality was average. We definitely don't recommend this venue for afternoon tea.", "date_of_review": "7 December 2019"}
{"review_id": 32, "restaurant_id": -2, "username": "457zuzannal", "date_of_visit": " January 2020", "rating": "5", "title": "Great place to hang out", "comment": "Cozy bar on 12th floor with amazing view and excellent food, worth to visit when in London. We had great time here", "date_of_review": "14 January 2020"}
{"review_id": 33, "restaurant_id": -2, "username": "samanthadI7492YP", "date_of_visit": " December 2019", "rating": "1", "title": "You've made a resevation but we are closed", "comment": "During our stay in London we've made a reservation to have an afternoon tea here, but upon Arriva they told us they were closed today. No compensation what so ever. Their problem with their bookingsystem resulted in us not being able to enjoy an afternoon tea in London during our trip.", "date_of_review": "10 December 2019"}
{"review_id": 34, "restaurant_id": -2, "username": "Chris J", "date_of_visit": " December 2019", "rating": "5", "title": "Fantastic Work Drinks", "comment": "We went for our christmas social, and we certainly made the right choice. We are the HR team from luxury London hotel. Still, we were very impressed. Stunning view, attentive, friendly service; and great food. Highly recommended!", "date_of_review": "17 December 2019"}
{"review_id": 35, "restaurant_id": -2, "username": "CarTin10", "date_of_visit": " December 2019", "rating": "5", "title": "Superb Cocktails", "comment": "Located within the Double Tree Hilton, this is a nice cocktail bar that serves food and drinks. Great views across London, with a nice terrace for outside seating. Great views across Tower Bridge, Tower of London and The Shard.  Seating outside even in the colder weather is comfortable due to the electric heaters placed all around. Fantastic selection of cocktails, but you can also get spirits and beers too.", "date_of_review": "11 December 2019"}
{"review_id": 36, "restaurant_id": -2, "username": "EppingGirlie", "date_of_visit": " December 2019", "rating": "1", "title": "Savage Schloss - a big disappointment - must try harder", "comment": "I booked a table at Savage Schloss - which is supposed to be an alpine bar themed pop up. The web pictures (which I think now were computer generated) bore only a passing resemblance to the actual venue. Starting with the description of the lift up to the venue as a \"gondola\" - this actually turned out to be some snow scenes pasted to the inside of the lift. There was no snow (fake or otherwise) that I saw, and really very little theming. A few dividers between tables with red checked clothes and a couple of barrel tables does not make an alpine bar. Lots more trees, some fake snow, cosy cabins etc was what I was expecting and was disappointed. So much so that we left before even eating.", "date_of_review": "20 December 2019"}
{"review_id": 37, "restaurant_id": -2, "username": "BernieKipps", "date_of_visit": " November 2019", "rating": "5", "title": "Great Drinks Great Views", "comment": "We have visited this hotel bar several times, Its located on the top floor and always has a great buzz. The gin and tonics are mixed to perfection by bar staff that although are busy are always attentive . This is a great after work / evening venue and is preferable to the slightly stuffy bar at the four seasons. ", "date_of_review": "6 January 2020"}
{"review_id": 38, "restaurant_id": -2, "username": "trravellingman", "date_of_visit": " December 2019", "rating": "2", "title": "Good views, bad service", "comment": "Sure, Savage Garden has some pretty good views of London Tower, the Tower Bridge and the Shard. That's the main reason our group of 4 decided to spend a couple of hours wiling away a Sunday afternoon with a few cocktails. And we were ok to pay through the nose for the privilege of enjoying the views, but what lets this place done (a lot) is the poor service. The joint was pretty quiet and seemed overstaffed, yet we still had to wait an age to get a simple bowl of olives (it felt like they were flying them in from Spain) and didn't get our coffee order at all. Despite us pointing this out, the waiter still had the audacity to add a 12.5% \"service\" charge to our bill. Did I pay it? Hell no! What part of crap service did you not understand? Expecting a tip for ordinary service has become the norm in London. It now appears that expecting one for poor service is also acceptable. Want a tip on top of already overpriced drinks? Earn it!", "date_of_review": "22 December 2019"}
{"review_id": 39, "restaurant_id": -2, "username": "furija_666", "date_of_visit": " January 2020", "rating": "5", "title": "A lovely place with amazing", "comment": "A lovely place with amazing view! Service second to non! Brunch one of the best in London! If you a dog lover there is one a month brunch for dog owners", "date_of_review": "6 January 2020"}
{"review_id": 40, "restaurant_id": -2, "username": "Thomas Y", "date_of_visit": " January 2020", "rating": "5", "title": "great food and amazing customer service !", "comment": "I had the most amazing experience. Having spent the day in Central London, I couldn't have enjoyed a better ending to my day than I did at Savage Garden. Great staff, excellent food, amazing atmosphere !", "date_of_review": "14 January 2020"}
{"review_id": 41, "restaurant_id": -2, "username": "Chrissymissy", "date_of_visit": " October 2019", "rating": "5", "title": "Nice bar, cocktails and views", "comment": "My friend reserved a table for an afternoon cocktail and it was great. Very relaxed. We enjoyed some plantain chips and hummus too. Yum! On a good weather day, you can sit outside.", "date_of_review": "29 October 2019"}
{"review_id": 42, "restaurant_id": -2, "username": "Malc-Souter", "date_of_visit": " December 2019", "rating": "1", "title": "Boring", "comment": "Very disappointed with this establishment. The reviews online and flyers bill this place as quirky, exiting and fun. Whoever wrote the drinks menu deserves an Oscar for deceiving the anticipated punters. Dull as ditch water don’t bother going. One positive aspect, good views over tower bridge and the walkie talkie.", "date_of_review": "7 December 2019"}
{"review_id": 43, "restaurant_id": -2, "username": "Cloe_2009", "date_of_visit": " November 2019", "rating": "2", "title": "Do we really need an alpine cottage", "comment": "..in the city?  The answe is not. I have been to corporate events at the Savage Garden twice. Not impressed any of the two times. Even less tonight at the alpine cottage style area where surely we did not need Narnia temperature considering 4 degrees outside. Poor overall and too much deeep fried food.", "date_of_review": "7 November 2019"}
{"review_id": 44, "restaurant_id": -2, "username": "Andrew A", "date_of_visit": " November 2019", "rating": "4", "title": "PAY POLICY", "comment": "I visited this establishment on the 13/11/2019 with the future mother of my children for evening drinks and food. The waiter offered me two payment methods, open a tab or pay as you go. I said pay as you go, thinking i would pay once we were ready to go. As we began our meal, after the second bite the waiter placed the bill on the table whilst we were eating. To say nearly lost my s##t would be an understatement. After a lengthy conversation with the waiter, which left me feeling very guilty it had transpired that his actions were due to the number of people walking out and not paying. He also divulged that should this occur on 3 occasions the waiters/waitresses have their salaries deducted, as company policy. I find this without question massively unfair and would urge Savage garden management to review this management process/company policy. On a positive note....the food and waiting staff were top draw. Thank you.", "date_of_review": "14 November 2019"}
{"review_id": 45, "restaurant_id": -2, "username": "LondonGirl64", "date_of_visit": " November 2019", "rating": "3", "title": "Disappointed ", "comment": "As regular visitors to the Doubletree, we always use the rooftop bar. It’s one of the reasons we like to stay. The bar is great - stunning views and a good vibe. The customer service however is poor. In central London and at the prices charged I expect much better. After a 10 minute wait (the bar was busy but not ridiculously), the female staff took my order then walked off to serve someone else without any explanation. Absolutely rude! Anyway long story short, we left and won’t be returning. In total contrast, to the hotel staff who are amazing.", "date_of_review": "17 November 2019"}
{"review_id": 46, "restaurant_id": -2, "username": "loretourrrrr", "date_of_visit": " November 2019", "rating": "5", "title": "AMAZING!!!! no words !", "comment": "My experience here has been incredible!!!!A friend told me about this bar and exceeded my expectations! The staff treated us like kings and served us quickly, with a smile and good conversation all the time. They were very friendly, super attentive and were at all times for and for us.  The coktails were amazing, and the food made me fall in love. We couldnt eat everything between two people, they were large dishes and the presentation was spectacular. I really love the croquetes, and hummus with plantain!!!!!! I found it a very stylish place, affordable prices, unbeatable views, very good conditioning the place and the treatment by the staff made it much more valuable. It's nice to go to places where you feel so comfortable and with impeccable treatment. i will Repeat for sure!", "date_of_review": "25 November 2019"}
{"review_id": 47, "restaurant_id": -2, "username": "robsR757NU", "date_of_visit": " November 2019", "rating": "3", "title": "Nice Bottomless Brunch Followed By Poor Bar Staff And Overpriced Drinks ", "comment": "The title sums it up really.  I’ve stayed at The DoubleTree a few times and took my wife to the roof to bar.  We ended up enjoying the bottomless brunch served by a lovely waitress. That evening we returned and had a totally different experience. Bar staff were arrogant and rude. Drinks are expensive, you have to wait what feel like forever to get served and poor quality cocktails. For example the signature cocktail is £16 and served in a plastic beaker!  To sum up. Great in the day time. Avoid in the evening. ", "date_of_review": "25 November 2019"}
{"review_id": 48, "restaurant_id": -2, "username": "BecciT", "date_of_visit": " November 2019", "rating": "5", "title": "Fantastic cocktails and view ", "comment": "Fantastic cocktails and well presented. Excellent spacious modern sky bar with amazing views- one way gherkin etc the other Tower bridge etc. Friendly staff. Loved it. ", "date_of_review": "1 December 2019"}
{"review_id": 49, "restaurant_id": -2, "username": "simo750", "date_of_visit": " October 2019", "rating": "1", "title": "Avoid eating here", "comment": "My boyfriend and I had a dinner reservation last night and I can honestly say we were served the worst food I think we have ever had in London.  To start we ordered the calamari which was inedible, the waitress said there had been a mix up in the kitchen and we had been given the wrong order, somebody had ordered calamari well done!! The mains were not quite as bad, we both ordered sea bass, but the fish was bland and not cooked enough. I mentioned how bad the food was to one of the waiters, and was told it wasn’t really a restaurant. If this is the case I don’t think they should be serving food!! In summary do not come here for food, have a drink, look at the view and then leave.", "date_of_review": "26 October 2019"}
{"review_id": 50, "restaurant_id": -2, "username": "jodymm", "date_of_visit": " November 2019", "rating": "4", "title": "Pre-lunch Cocktails ", "comment": "Nice venue with good views and interesting cocktail menu. We only had a few drinks before lunch but it was ideal for that purpose and we will visit again in the evening to see what the atmosphere is like when it’s busy", "date_of_review": "19 November 2019"}
{"review_id": 51, "restaurant_id": -2, "username": "Everyones_favourite", "date_of_visit": " November 2019", "rating": "5", "title": "Top Marks!", "comment": "Came to celebrate my birthday with my girlfriend... not a bad way to turn 30 something! The cocktails were lit, the vibe was great, and the picturesque scenery had my girlfriend smiling ear to ear in every selfie!  10.10", "date_of_review": "6 December 2019"}
{"review_id": 52, "restaurant_id": -2, "username": "laurella76w", "date_of_visit": " August 2019", "rating": "5", "title": "Fantastic views", "comment": "We have just stayed at The Hilton Double Tree over the Bank Holiday weekend where this bar is located on the 12th floor. The views across to Tower Bridge are amazing. We have visited a few roof bars over the years in London and this did not disappoint. You can sit indoors or outside. The menu is nice and you can also order snacks to accompany your drinks. We will return. ", "date_of_review": "26 August 2019"}
{"review_id": 53, "restaurant_id": -2, "username": "alliander100", "date_of_visit": " August 2019", "rating": "1", "title": "Shocking Customer Service", "comment": "We arrived at your venue at appox 7:10 on Friday evening, early for a 7:30 reservation. We were told that our table was not yet ready, and were led to the bar area at a 'stand up' table to wait until our table was prepared. This was not an issue, the young lady who showed us to the 'waiting' table was very polite. Howver, we were then approached by a waiter, who advised us that we could not stand at this particular table as it was reserved. We explained the situation and advised him we would like to order drinks whilst we waited. Unfortuantely, he became too distracted by what was happening in the outdoor area to actually take our order. He actually held his finger up to my husband to indicate he should be quiet!! Whilst we were being ignored by this member of staff, another member of staff approached us to again say we could not be waiting at this table due to it being reserved. We again explained the circumstances, but was again told that we could not wait at this table. We found both members of staff to be quite rude and not in anyway customer focused. Due to the fact that no alternative arrangement was offered, we had no choice but to leave the premises. We are very disappointed in the service. I have mailed them with details of our experience, with no response. Cleary customer service is not their top priority!!", "date_of_review": "22 August 2019"}
{"review_id": 54, "restaurant_id": -2, "username": "Missronilondon", "date_of_visit": " August 2019", "rating": "1", "title": "Not worth the money ", "comment": "Booked this place as I have seen few Instagram posts but like they say Instagram is far from the reality. Not a great experience. Staff running around like a headless chickens.  Booked the table 3-4 weeks in advance. When we turned up on Saturday evening majority of the place was blocked off for private party and the was very limited space of what we could actually use.  We were sat at a very low table (like what you get in your GPs waiting room just bit more fancy) with a view of the hotel rooms. I have asked to move to a normal hight table as we were planning on eating but was told the normal tables were all reserved and they didn’t have anything spare. We only ordered appetizers as the low tables are not designed for eating with a fork and knife.  Appetizers came at different times so by the time the second lot came out first dish was cold. Cocktails very overpriced for what they actually are.  Visit not worth the money spent. ", "date_of_review": "4 September 2019"}
{"review_id": 55, "restaurant_id": -2, "username": "MilliReview", "date_of_visit": " September 2019", "rating": "4", "title": "Great for lunch", "comment": "12th floor of Double Tree Hilton at Tower Bridge. Walk through the hotel lobby and the lifts are in the far right corner or walk through the restaurant and they're right at the back.  I only visited in the day and by fortune arrived just as it opened so had the pick of the entire place. There are some great views to be had of the London skyline. Cocktails are expensive but that is to be expected as it is London afterall. I thought the waiters and bar staff were great. Didn't wait long at all for food & drink. The chips and black garlic mayo were exceptional! However I did have the worst cocktail I've ever tasted! The clue is in the name (penicillin) and it literally smells and tastes like a hospital. Great that it has an outdoor smoking area as well. Would happily return.", "date_of_review": "7 September 2019"}
{"review_id": 56, "restaurant_id": -2, "username": "francescamassa97", "date_of_visit": " August 2019", "rating": "5", "title": "Afternoon tea", "comment": "Wonderful service and special attention given to every little detail. Staff welcomed us in the most warming way. Thanks for the lovely afternoon.", "date_of_review": "24 August 2019"}
{"review_id": 57, "restaurant_id": -2, "username": "Kellz3156", "date_of_visit": " September 2019", "rating": "4", "title": "Amazing Views, good drinks", "comment": "This was a treat to find. Absolutely beautiful views of London and Tower Bridge. The drinks were really good but pretty expensive. I guess you can expect that in London city center. Definitely a cool place to experience, just be prepared to spend a little extra for the views.", "date_of_review": "23 September 2019"}
{"review_id": 58, "restaurant_id": -2, "username": "Andy G", "date_of_visit": " September 2019", "rating": "3", "title": "Disappointing after all the hype", "comment": "We were looking forward to having a meal on the 12th floor at savage garden, Hilton so we booked. Arrived on time down below where the ambiance was pretty ok so anticipation was high especially having seen the website. Out of the lift greeted by friendly and helpful staff. So far so good. Taken through to our table and that.s where disappointment started. No table set at all in a very casual area.Food menu...what menu? Only one veggie dish and a few things to choose from. This was Saturday afternoon and the choice was more than limiting. The best thing about this place are the staff. They tried and were doing their best. No view to speak of and very average food- a real disappointment. If you want to go and have a few drinks it is ok but that is the limit.", "date_of_review": "1 October 2019"}
{"review_id": 59, "restaurant_id": -2, "username": "Meritxell B", "date_of_visit": " September 2019", "rating": "5", "title": "Beautiful views", "comment": "This bar is located on the 12th floor of the DoubleTree by Hilton Tower of London hotel. The views of the Tower of London are spectacular. It is the perfect place if you want to surprise your partner. The food is excellent and the staff very polite.", "date_of_review": "20 September 2019"}
{"review_id": 60, "restaurant_id": -2, "username": "Debster1962", "date_of_visit": " July 2019", "rating": "3", "title": "Nice view, very expensive drinks", "comment": "£15 for a gin and tonic, 12.5% service charge added as well for literally putting drinks on a tray and moving 5 steps to our table. Only because it was a birthday did we not complain.  View is good but it was too expensive for what we got.", "date_of_review": "28 July 2019"}
{"review_id": 61, "restaurant_id": -2, "username": "ollieojj", "date_of_visit": " July 2019", "rating": "3", "title": "Nice but pricey ", "comment": "Lovely location and stunning views, on the pricy side, paid 44 pound for two gin and tonics, 20% service charge even tho had to wait about 15 mins to get served, so many bar staff behind the bar yet service is still so slow ", "date_of_review": "28 July 2019"}
{"review_id": 62, "restaurant_id": -2, "username": "Donna-Louise H", "date_of_visit": " July 2019", "rating": "1", "title": "Service charge", "comment": "We went here for a hen party with 19 other people. We specifically requested to be by the bar for the views but when we arrived we were told we either had to sit at two tables in the bar which were not close together and the space would be shared with another party, or sit in our own space at the back. We chose the latter but whilst waiting to be seated I ordered a cocktail and a non-alcoholic cocktail at the bar which came to £29.25! They have the cheek to add 12.5% service charge to bar orders which is crazy! I've never experienced this anywhere in London and it's disgraceful. As the day progressed we realised that they do this as the service is terrible and they would never get tips! Some of the party said some of the bar staff were moody. The tea was average and you literally get 4 mouthfuls of savoury bites. We left soon after the tea, will never use this bar again, not worth it for the money, for a minute I thought I was back in Paris and being overcharged for everything!!", "date_of_review": "29 July 2019"}
{"review_id": 63, "restaurant_id": -2, "username": "Dovile M", "date_of_visit": " August 2019", "rating": "5", "title": "Hen party !!!", "comment": "Amazing place to celebrating!!!! It was so unique and the stuff was so friendly and the food was really delicious. Thank you so much !!!!!!!! Amazing Excellent ☺️☺️", "date_of_review": "11 August 2019"}
{"review_id": 64, "restaurant_id": -2, "username": "Patricia D", "date_of_visit": " August 2019", "rating": "5", "title": "Increíble service", "comment": "Everything was perfect, the service was good and fast. Avocado hummus was espectacular, definitely i'll be black.", "date_of_review": "4 August 2019"}
{"review_id": 65, "restaurant_id": -2, "username": "sergiodiaz11", "date_of_visit": " August 2019", "rating": "5", "title": "Nice experience", "comment": "Nice place for a first drink. Beautiful views and a really good service. We were on the terrace and the experience was incredible.", "date_of_review": "4 August 2019"}
{"review_id": 66, "restaurant_id": -2, "username": "Toma A", "date_of_visit": " August 2019", "rating": "5", "title": "Miss", "comment": "I visited the Savage Garden in Femchurch street and it was absolutely amazing! Atmosphere, food, location and view was just stunning, but the best was the people working there, super friendly, positive they made my hen party unforgettable!! Definitely will recommend this great place to my friends and family!!", "date_of_review": "11 August 2019"}
{"review_id": 67, "restaurant_id": -2, "username": "969jonathand", "date_of_visit": " August 2019", "rating": "4", "title": "Good views ", "comment": "Visited for drinks with my wife on a Sunday afternoon. You can sit either inside or outside with views from the twelfth floor. Really good views. Surprisingly not busy.  Not inexpensive but nice vibe. Service okay. Could have been better. We were told to buy our drinks at the bar so either they added a service charge for a non existent service or I was short changed. If not for that would have given five blobs/stars. ", "date_of_review": "11 August 2019"}
{"review_id": 68, "restaurant_id": -2, "username": "Bouloys", "date_of_visit": " August 2019", "rating": "5", "title": "Quite a sensory experience!", "comment": "Great food and cocktails.  We visited for a late lunch and were not disappointed. The food was amazing and so were the cocktails! There was also live music and the view was second to none. Worth a visit if you are in London, I will definitely be back.", "date_of_review": "11 August 2019"}
{"review_id": 69, "restaurant_id": -2, "username": "PaulFrance12", "date_of_visit": " April 2019", "rating": "4", "title": "Dinner and drinks", "comment": "I went there for our anniversary with my husband. The food and the drinks were really nice, not spectacular but nice. The view was certainly magical but despite the fact that we have requested a table with a view when we made the reservation they gave us a table really in the middle of the restaurant. That was a bit disappointing because this is the reason that we booked at this restaurant at the first place.", "date_of_review": "12 August 2019"}
{"review_id": 70, "restaurant_id": -2, "username": "Amanda M", "date_of_visit": " October 2019", "rating": "5", "title": "Great View, Fun for Drinks", "comment": "Savage garden is at The Hilton Double Tree on the 12th floor. The views across to Tower Bridge are amazing. We have visited a few roof bars over in London and this did not disappoint. You can sit indoors or outside. Later evening they have music, dancing and a very fun atmosphere. We only had a few drinks, but definitely worth checking it out for the fun staff, great bartenders and amazing view! Next time we are in London, we would go back", "date_of_review": "10 October 2019"}
{"review_id": 71, "restaurant_id": -2, "username": "jane a", "date_of_visit": " July 2019", "rating": "4", "title": "Lovely views ", "comment": "This is a rooftop bar in the doubletree Hilton, so nice views of tower bridge and the shard, hotel prices but if you just fancy a place to see the incomparable London skyline well worth a short visit! Might get pricey if you stayed longer! Only marked down as bar staff a bit disinterested and certainly not interested in letting me know of any soft drink options so ended up having a coke. ", "date_of_review": "28 July 2019"}
{"review_id": 72, "restaurant_id": -2, "username": "Chizzamerica", "date_of_visit": " June 2019", "rating": "4", "title": "Good bar, great views near Tower Hill", "comment": "Enjoyed a drink and evening here with friends on a summer evening. Super views on a clear night; friendly staff. Pricey, but good for a special occasion ", "date_of_review": "5 July 2019"}
{"review_id": 73, "restaurant_id": -2, "username": "samc_eng", "date_of_visit": " June 2019", "rating": "1", "title": "Don't be fooled, it's just ANOTHER hotel bar", "comment": "We cam here for some cocktails for my Mum's 60th Birthday because it looked quirky and had some interesting sounding cocktails and the website and photos made it look really cool... it's not. It's just a hotel bar. You're served by staff who aren't really that interested and your then handed a bill at the end that is FAR too expensive for what you've just consumed. Considering the photos and description on the website, this bar has absolutely no atmosphere or personality at all and our whole party left after 1 (expensive) drink and all very disappointed. They also sell themselves on the outdoor areas, but they don't tell you when you book that you cannot book a table outside, so you're left stuck inside unless you want to go and try and find some space on a very crowded terrace and give up your pre-booked table", "date_of_review": "6 July 2019"}
{"review_id": 74, "restaurant_id": -2, "username": "wyatt2210", "date_of_visit": " July 2019", "rating": "1", "title": "RIP off", "comment": "£6 for a bottle of beer and a 12.5% service change with no table service when your on the rather tatty terrace! We understand its london and london prices but the feeling of being ripped off will mean we will not go back.", "date_of_review": "14 July 2019"}
{"review_id": 75, "restaurant_id": -2, "username": "Ancuta B", "date_of_visit": " July 2019", "rating": "5", "title": "My Birthday", "comment": "I celebrated my birthday there , it was so unique and the stuff was so friendly and the food was really delicious! The atmosphere was great- all together it was a unique memory of London that I will never forget! Thank you", "date_of_review": "14 July 2019"}
{"review_id": 76, "restaurant_id": -2, "username": "Kteener", "date_of_visit": " July 2019", "rating": "1", "title": "Good view terrible attitude", "comment": "I have to echo a similar review. Staying at the hotel which is lovely but the people that work here are a disgrace to be working in customer service.  Over priced with a side order of rude.", "date_of_review": "16 July 2019"}
{"review_id": 77, "restaurant_id": -2, "username": "ErinFP", "date_of_visit": " July 2019", "rating": "5", "title": "A beautiful, sexy evening spot to start a couples night!", "comment": "Visited on our honeymoon and is definitely a great spot to set the mood for a night out! Food and drink prices were fairly high, but no more than any other hotel or cocktail bar. Service is fairly spotty but if you're not in any hurry it's a great place to grab some small plates and any one of the sexy and creative cocktails on their very unique menu. Would definitely recommend a seat out on the terrace, great view of the sun going down over the Tower, Tower Bridge, and the Shard. Note that this is NOT the place to end your evening, it is just a bar, there is no entertainment or dancing of any kind. But if you don't mind the price and are looking for somewhere creative, with great ambience and a little bit of sex-appeal for a night out, it's definitely worth a stop.", "date_of_review": "16 July 2019"}
{"review_id": 78, "restaurant_id": -2, "username": "tads48", "date_of_visit": " July 2019", "rating": "4", "title": "Great views, delicious cocktails", "comment": "I love this place, spectacular views over the Tower of London and Tower Bridge and a great selection of cocktails just seconds away from all the hustle and bustle. It ain’t cheap but very worth a visit", "date_of_review": "18 July 2019"}
{"review_id": 79, "restaurant_id": -2, "username": "sophisar", "date_of_visit": " April 2019", "rating": "5", "title": "Rooftop with great ambience and view", "comment": "Go there before the mad rush of happy hour. The food is quite decent but you wouldn’t be going there if it weren’t for the lovely rooftop with ample seating. Tip: Natural Kitchen next to the lobby offer a much better dining option before heading up to Savage Garden for drinks.", "date_of_review": "21 July 2019"}
{"review_id": 80, "restaurant_id": -2, "username": "sooze223", "date_of_visit": " June 2019", "rating": "5", "title": "After dinner drinks", "comment": "Came here for drinks after a birthday meal out. Good atmosphere and gorgeous views of the city  Nice place for sunset drinks", "date_of_review": "22 July 2019"}
{"review_id": 81, "restaurant_id": -2, "username": "t1965a", "date_of_visit": " June 2019", "rating": "3", "title": "Ok for views, extremely expensive for unbranded drinks, & big service charge ", "comment": "Went here for the view, but what a rip off, all unbranded drink, charged a fortune, which we stood at the bar to get, they charged 12.5% service charge, didn't even say!! No waiter service for us, then you expect a charge, so barman got a £10 tip, he only made 1 cocktail, the rest was bottle beer, & spirit & mixer, so not hard, got £10 for it, only noticed after when looked at receipt!! Wouldn't mind but we waited a while to get served. Wouldn't go back", "date_of_review": "1 July 2019"}
{"review_id": 82, "restaurant_id": -2, "username": "Diego B", "date_of_visit": " May 2019", "rating": "5", "title": "Old gang reunion", "comment": "It had a breathtaking view all over the river, food was delicious and great staff. No doubt the place deserves another visit ", "date_of_review": "30 May 2019"}
{"review_id": 83, "restaurant_id": -2, "username": "Vikki S", "date_of_visit": " June 2019", "rating": "3", "title": "Afternoon tea", "comment": "Booked an afternoon tea for my best friends birthday. Seated quickly but then waiting around 15 mins to be served. Followed by a further 30 mins for our drinks to arrive. Afternoon tea was nice. But I have had better. Odd staff. I don’t know if they were shy or rude. The outside area is lovely and managed to get a seat. 2 glasses of wine was 24 pound which is fine but a service charge of 4 or 4 pound is not good as all he did was pour ! So we went dirty martini after. 241 cocktails and much nicer.", "date_of_review": "2 June 2019"}
{"review_id": 84, "restaurant_id": -2, "username": "normantalktalk", "date_of_visit": " May 2019", "rating": "5", "title": "A fun filled evening", "comment": "Staying overnight in the Hilton we had to give Savage Garden a try. Not expecting too much at our age we decided to go for a drink. I am so glad we did. Even we oldies had a great time. The cocktails were delicious. My dirty martini exactly as I liked it. The music was DJ’d by a boogying young lady but not played to the extent that you had to shout. The weather was rainy so we did venture out to see the view which, again, was well worth it. Lovely to see London lit up at night. After another cocktail we thought maybe a bite to eat to soak some of it up. Sesame Prawn toast, delicious, and tempura oysters went down a treat. Making us quite thirsty so, naturally, another cocktail ordered. A wonderful few hours and I am so glad we ventured upstairs and booked a table. Great venue, wonderful service and so friendly.", "date_of_review": "31 May 2019"}
{"review_id": 85, "restaurant_id": -2, "username": "61Vandav", "date_of_visit": " June 2019", "rating": "5", "title": "Only had a look...........", "comment": "Staying at Double tree Hilton we had to pop up and have a look at the view from the roof top Bar known as Savage Garden. Didnt stop for a drink but the views are amazing. Go up during the day and fantastic photo opportunities. 12th floor Hilton.", "date_of_review": "10 June 2019"}
{"review_id": 86, "restaurant_id": -2, "username": "muzzpomp", "date_of_visit": " June 2019", "rating": "1", "title": "Service charge.", "comment": "Nice location, but ordered drinks at the bar and was automatically charged a 12.5% service charge. If it was table service fair enough but I ordered at the bar! And then the service charge was just added without me being made aware. I feel that this is fundamentally wrong and dishonest. I am all for tipping staff, but this should be at my discretion. Be aware.", "date_of_review": "21 June 2019"}
{"review_id": 87, "restaurant_id": -2, "username": "analorente213", "date_of_visit": " January 2019", "rating": "5", "title": "Romantic lunch", "comment": "Was a lovely place, staff was wonderful and we had such a nice time! We really recomend it for a romantic time", "date_of_review": "30 May 2019"}
{"review_id": 88, "restaurant_id": -2, "username": "T7479XJmarkh", "date_of_visit": " June 2019", "rating": "1", "title": "Run away!!!!", "comment": "I am staying at the Doubletree below this shower so thought I would pop up for a feed before bed. The service is beyond awful, sneering and patronising teenagers. I could go on but the words I would need to use could never be published! I ordered something called a Pork Tomahawk. This is a pork chop: that would have been fine. What arrived tasted of spoiled fish and was served with utterly desicated black pudding and no veg.  I feel more than a little unwell and if I could have awarded negative points I would have done so.  Please avoid!!!!!! NB: views are nice. ", "date_of_review": "27 June 2019"}
{"review_id": 89, "restaurant_id": -2, "username": "Mike R", "date_of_visit": " June 2019", "rating": "1", "title": "Great view , Great location but thats as good as it gets!!!", "comment": "Summer evening with friends in London. We decided on Savage garden for the views. Unfortunately thats as good as it got. Too few bar staff to start with but drinks were good. Unfortunately I would advise not eat here. We ordered food at 8:30pm, only to be told that 5o% of the menu was unavailable. Then we waited 35mins for starters to arrive and when they did, so did one of the main courses. When we said to the the waitress that we didn't want one of the main courses now, we were told we had ordered it!!!!.  Considering its in a Hilton Hotel it was a joke.....", "date_of_review": "29 June 2019"}
{"review_id": 90, "restaurant_id": -2, "username": "Martino C", "date_of_visit": " June 2019", "rating": "5", "title": "Brilliant: excellent food with a view", "comment": "Situated on the 12th floor of the Doubletree by Hilton Hotel near Tower Hill, it is a very relaxing place. While everybody was out last Thursday under the scorching sun, we were inside, with a nice cool draft created by the open doors and enjoyed a very superb lunch for only £18,00 per person. Congratulations to the Hotel management.", "date_of_review": "29 June 2019"}
{"review_id": 91, "restaurant_id": -2, "username": "LizzieNil", "date_of_visit": " May 2019", "rating": "5", "title": "Birthday drink after the flowers", "comment": "Been here before and was looking forward to returning. Good mellow vibe and great views across the capital. Drinks and music great fun will come back again.", "date_of_review": "29 May 2019"}
{"review_id": 92, "restaurant_id": -2, "username": "Judit P", "date_of_visit": " April 2019", "rating": "5", "title": "A quick visit for drink because of the view", "comment": "Very nice place with very nice people and good gin and tonic was made there :) All the waiter and waitress were kind and helpful.", "date_of_review": "20 May 2019"}
{"review_id": 93, "restaurant_id": -2, "username": "Bex T", "date_of_visit": " May 2019", "rating": "5", "title": "So yummmm", "comment": "Amazing service, delicious food (especially the plantain chips and dip), super yum drinks!! Ridiculous view from the rooftop, will definitely be back!", "date_of_review": "22 May 2019"}
{"review_id": 94, "restaurant_id": -2, "username": "Hayley W", "date_of_visit": " May 2019", "rating": "5", "title": "Amazing!!", "comment": "Awesome bar with amazing views and cocktails! Service was really good and the food was great. Will definitely come back!", "date_of_review": "22 May 2019"}
{"review_id": 95, "restaurant_id": -2, "username": "Sammy W", "date_of_visit": " May 2019", "rating": "5", "title": "Fantastic service! Great atmosphere", "comment": "Went into Savage Garden for drinks and nibbles with my friends!! Everything was awesome! Great atmosphere and fantastic service!!! Servers were super friendly and helpful! Highly recommend coming here for the service and the terrific views of Tower Bridge! Andre and Manuel were fantastic the whole evening!", "date_of_review": "22 May 2019"}
{"review_id": 96, "restaurant_id": -2, "username": "etreviewseverything", "date_of_visit": " May 2019", "rating": "1", "title": "Shocking. ", "comment": "Incredibly rude staff with a audaciously pompous attitude. We left our table to look around, and when we returned we were told our table was reserved (yes, by us!) and that we were not allowed to sit there. We were then turned away. I am appalled that the Hilton allows such poor service, and such socially inept and inadequate staff on their property. ", "date_of_review": "26 May 2019"}
{"review_id": 97, "restaurant_id": -2, "username": "Loola77", "date_of_visit": " May 2019", "rating": "4", "title": "Fantastic views but they have the cheek to charge service charge at the bar!", "comment": "My sister booked a table here as part of a surprise Birthday day out in London for our Dad for his 70th Birthday. We chose Savage Garden as it has amazing views of Tower Bridge. Fantastic bar as it was lovely weather so we ditched the table indoors as we were lucky enough to get seats out the balcony in front of the bar (best views there). We planned to have a few drinks each here, however..... I was less than impressed when I went to the bar to get our drinks and was charged service charge!...REALLY?!!!!! All the bar tender did was open a fridge door and take three bottles of beer out of it. What a cheek. Table service yes, bar service no! Due to this we decided to just stay for the one and go and spend our money elsewhere (I'm big on principles). Shame as we could've been there for the duration if they hadn't been so greedy.  All in all a great place if you want the views but be prepared to be overcharged for it!", "date_of_review": "26 May 2019"}
{"review_id": 98, "restaurant_id": -2, "username": "Desi Slava M", "date_of_visit": " May 2019", "rating": "5", "title": "Amazing place/Best in London", "comment": "Best cocktail bar!!!If you wanna have a drink in London and don’t know where, then Savage Garden cocktail bar is the one” I went yesterday with my friends and so happy to be there...food,drinks,service are Exelenet. I recommend you-best place to enjoy in London.   ", "date_of_review": "27 May 2019"}
{"review_id": 99, "restaurant_id": -2, "username": "Pavlina P", "date_of_visit": " May 2019", "rating": "5", "title": "Pavlina", "comment": "A stunning bar on the roof of Hilton in the heart of city of London with amazing views. We were met and served by the staff (Andre, Rebeca, Sylvia) as an VIP guests! Good ,the food bites were unusual and tasty. We also enjoyed some dancing! I will be back.", "date_of_review": "27 May 2019"}
{"review_id": 100, "restaurant_id": -2, "username": "swoody22", "date_of_visit": " May 2019", "rating": "1", "title": "not great☹️", "comment": "Booked. Table weeks in advance but when we arrived our table wasn’t ready. Took an age to be served. When food was bought out it was in drive and drabs and the food was cold. When we spoke with a waiter he was very standoffish. Left after one drink and cancelled the rest of the food order. Was such a shame as we were celebrating a friends birthday. Will not recommend it although the view was fab.", "date_of_review": "27 May 2019"}
{"review_id": 101, "restaurant_id": -2, "username": "justsharifa", "date_of_visit": " April 2019", "rating": "5", "title": "My favourite spot", "comment": "I came here before, and this time it was even better, really enjoyed my time. Came for afternoon tea", "date_of_review": "19 May 2019"}
{"review_id": 102, "restaurant_id": -2, "username": "_Annie_Cycles", "date_of_visit": " April 2019", "rating": "5", "title": "Lovely sunset", "comment": "Visited the roof top bar with some friends for a drink at the end of a sunny day. The atmosphere was great, music was pleasant, staff were very friendly. Thank you! ", "date_of_review": "25 April 2019"}
{"review_id": 103, "restaurant_id": -2, "username": "joannemcn", "date_of_visit": " April 2019", "rating": "4", "title": "Lovely afternoon tea, fantastic views", "comment": "This was my second visit to Savage Garden and I absolutely loved it. The afternoon tea is very good value. Nice selection of savoury snacks, rather than traditional sandwiches, including beetroot and salmon roulades, chicken tacos and beef on rye. There were gluten free scones which were delicious. The sweet treats were lovely, including cherry lamingtons. The venue itself is beautiful with views over Tower Bridge. My only gripe is that the drinks are very expensive but it’s worth it for a special treat.", "date_of_review": "27 April 2019"}
{"review_id": 104, "restaurant_id": -2, "username": "Giubru93", "date_of_visit": " April 2019", "rating": "5", "title": "Best rooftop in London!", "comment": "This view is breathtaking, I recommend it for a sunset's drink. The cocktails are really good and not too expensive, staff friendly and professional. I really recommend it.", "date_of_review": "26 April 2019"}
{"review_id": 105, "restaurant_id": -2, "username": "Alex_Favilli", "date_of_visit": " April 2019", "rating": "5", "title": "A place you must visit", "comment": "The view is amazing, you can choose between the great inside bar or the rooftop terrace - either way you can enjoy the view around London ! They also just opened this really nice wine bar. The staff is really nice + food and cocktails are really good - definitely try the sesame prawn toast - I love this place!! ", "date_of_review": "26 April 2019"}
{"review_id": 106, "restaurant_id": -2, "username": "fernandamorgadinho", "date_of_visit": " April 2019", "rating": "5", "title": "Best of London", "comment": "It was my first time in London. Savage Garden rooftop was the cherry of the top of the cake. Amazing view, beautiful place,amazing staff I would like to mention Rebecca,Ligia and Manuel for being extremly profesional and kind. Cant wait to come back,thank you for become my time in London so special.", "date_of_review": "30 April 2019"}
{"review_id": 107, "restaurant_id": -2, "username": "Climber60419381273", "date_of_visit": " April 2019", "rating": "5", "title": "Excellent", "comment": "I went to London with my family. It was the first time we went to savage garden. This place is amazing, has a fantastic view and a high quality service. The atmosphere is excellent. Rebeca, Lígia and Manuel thank you for your professionalism and hospitality.", "date_of_review": "30 April 2019"}
{"review_id": 108, "restaurant_id": -2, "username": "Christinasfeedback", "date_of_visit": " May 2019", "rating": "5", "title": "Great place", "comment": "Me & my friends had a lovely time celebrating our friends birthday last night. Such a nice spot to go to, I’ve already recommended it to a couple friends. The garden is stunning, felt like holiday settings. The DJ was playing great house music tunes. The staff were great, expecially our server Ligia. Great food, great drinks, great all round atmosphere! x", "date_of_review": "5 May 2019"}
{"review_id": 109, "restaurant_id": -2, "username": "Billericayresident", "date_of_visit": " May 2019", "rating": "5", "title": "Wow", "comment": "Just amazing! We visited here for a few drinks before dinner elsewhere. And boy we wished we had stayed for dinner here too! Amazing views, amazing drinks, great service and very friendly staff. Will be visiting regularly now! ", "date_of_review": "14 May 2019"}
{"review_id": 110, "restaurant_id": -2, "username": "34Lindsay", "date_of_visit": " May 2019", "rating": "5", "title": "Bar with a view", "comment": "Lovely welcome from the front of house staff, the bar is comfy with stunning views. We enjoyed a light lunch and glass of fizz. Service was a bit slow at first but warmed up during our visit. Food was good and fizz was cold the perfect combination. Not so happy about the service charge that is automatically added to the bill think that should be a matter of choice.", "date_of_review": "15 May 2019"}
{"review_id": 111, "restaurant_id": -2, "username": "Brooke T", "date_of_visit": " April 2019", "rating": "3", "title": "For the view", "comment": "In the bar currently and less than impressed. The view of tower bridge is wonderful, but if you are actually looking for a good cocktail go to the alchemist. It’s walkable. Do not be fooled by the drinks on the website like we were. Not at all the same. Gimmick at best.  Getting an average ranking because that is basically what you will find here. An average drink alongside a marketable view. ", "date_of_review": "22 April 2019"}
{"review_id": 112, "restaurant_id": -2, "username": "skullevan", "date_of_visit": " March 2019", "rating": "5", "title": "You need to visit this place !!", "comment": "My husband and I visited London last week, the view is breathtaking and the cocktails were amazing . Food was delicious , the ambiance was splendid and beautiful Kate took great care of us!! We will definitely come back to this place next time we ‘re in London !", "date_of_review": "4 April 2019"}
{"review_id": 113, "restaurant_id": -2, "username": "555aprill", "date_of_visit": " April 2019", "rating": "5", "title": "Amazing place! ", "comment": "We ate here last night as we were staying in the hotel for my birthday and it was so good!  Our waitress (her name was Sniega) was so accommodating and looked after us so well. She made great recommendations from the menu - which were delicious - and was so friendly but not too intrusive. After our meal and after finding out it was my birthday she brought out a complimentary dessert with ‘happy birthday’ on the plate which was such a lovely surprise. Her and the host (didn’t catch her name) were just fabulous and really made the evening.  The music from the DJ was great, the food was delicious and pretty reasonably priced and the view from the bar is just gorgeous.  We will return! ", "date_of_review": "6 April 2019"}
{"review_id": 114, "restaurant_id": -2, "username": "Jessica A", "date_of_visit": " March 2019", "rating": "5", "title": "Best Place ever for a special occasion", "comment": "I went to the Savage garden for my 30th Birthday and it has been the best choice i could make. The staff has been amazing since the time of the reservation. I had many requests and last minute which mad eye feel a bit stressed however I always felt accommodated and assisted. Mollie made my reservation and replied to me within minutes and put into place all my requests being able to manage a party of 20ish people. This was a great start as I felt much more relaxed. When I arrived to the place (it was my first time) I could enjoy an incredible time made up of an excellent mixture of nibbles, staff friendliness, quality of cocktail, music, ambience, people hanging out to the bar and trendy atmosphere. Everything was simply perfect. The view is incredible with space to smoke outside. The team at the bar was prompt to respond to our orders and requests with great mannerism. Savage garden simply made my birthday a perfect day. that was a very good fun time.Thanks to all of you!!", "date_of_review": "7 April 2019"}
{"review_id": 115, "restaurant_id": -2, "username": "angeltab", "date_of_visit": " March 2019", "rating": "5", "title": "Amazing!", "comment": "Amazing place!Breathtaking view ! amazing food with delicious cocktails and Katerina our waitress made our night even more wonderful ♥️", "date_of_review": "30 March 2019"}
{"review_id": 116, "restaurant_id": -2, "username": "NT8111", "date_of_visit": " April 2019", "rating": "5", "title": "Afternoon Tea", "comment": "Love it, best rooftop bar in london,extremely friendly staff, great food and drinks. I recommend to visit Savage Garden.", "date_of_review": "16 April 2019"}
{"review_id": 117, "restaurant_id": -2, "username": "Fanny M", "date_of_visit": " April 2019", "rating": "5", "title": "Afternoon tea", "comment": "Very nice afternoon tea with a view ! Original and tasty food from savoury to sweet. I loved the “nuit d’été” tea and the glass of champagne !  Friendly staff, very helpful. Definitely recommend it", "date_of_review": "16 April 2019"}
{"review_id": 118, "restaurant_id": -2, "username": "enikom2806", "date_of_visit": " April 2019", "rating": "5", "title": "Speechless view!", "comment": "Amazing rooftop in the heart of London. It is only 10min walk from Tower Bridge. Exceptional service! I highly recommend if you would like to have a nice drink with a wonderful view. It was very good that the music was not too late in the early evening so you are able to chat with friends. Well done Savage! ", "date_of_review": "19 April 2019"}
{"review_id": 119, "restaurant_id": -2, "username": "Andreea E", "date_of_visit": " April 2019", "rating": "5", "title": "Amazing service", "comment": "We came for drinks and we were helped and got a great service from Kristian, he is great with people and knows his job. Great recommendations abd knowledge in spirits. We will be back for sure", "date_of_review": "19 April 2019"}
{"review_id": 120, "restaurant_id": -2, "username": "Sheila G", "date_of_visit": " April 2019", "rating": "4", "title": "Fantastic rooftop bar with great views", "comment": "We visited on Easter Saturday which was a beautiful sunny day and a perfect day for visiting the rooftop garden. It was our first time visiting this bar which was on our way home and near Tower Hill station. The bar is on the 12th floor of the hotel and has two sides to it which are open and the middle bar area which is enclosed. There's a great atmosphere in the open-air bars - one has lots of flowers the other side has umbrellas and music and a perfect view of the Tower of London and the Gherkin as well as other areas of London. We were aware that drinks were going to be more expensive than normal but there was no service to the tables in the outside bar. After waiting a while we then went to the bar which did not appear that busy with people waiting but took an incredibly long time to get our drinks. To add insult they charge service charge at the bar which I think is very cheeky when you've had to go and get your own drinks, they've not been served to you. As we had to wait so long to get served we did not pay the service charge of 12.5%. I would expect that with table service even though I don't think that amount should be charged on drinks but certainly not if you're getting your own. It wouldn't stop us going back as it's a great location but service has to be better and quicker. Unfortunately making cocktails takes them a long time and they're really not great cocktails at £18. Two of our group had them and weren't impressed. ", "date_of_review": "21 April 2019"}
{"review_id": 121, "restaurant_id": -2, "username": "X7177LDamyb", "date_of_visit": " March 2019", "rating": "5", "title": "Birthday drinks", "comment": "I highly recommend this bar. Amazing views over London and amazing cocktails. I had the horny beast and my friend had the lady grey. Both were amazing and if we had more time, we would have ordered more cocktails and stayed longer.", "date_of_review": "28 March 2019"}
{"review_id": 122, "restaurant_id": -2, "username": "Elisadegen", "date_of_visit": " March 2019", "rating": "5", "title": "Perfect", "comment": "Nice view, good atmosphere and Friends service. Loved the new design! Would return again for sure...", "date_of_review": "15 March 2019"}
{"review_id": 123, "restaurant_id": -2, "username": "justsharifa", "date_of_visit": " July 2018", "rating": "5", "title": "Love it", "comment": "I came here once when it was Sky Bar, did not really like it. came back just when it reopened ( Savage Garden ). It is so much better, the decor of the place is amazing. Great cocktails, amazing services, staff very helpful and friendly. will definitely come back.", "date_of_review": "16 March 2019"}
{"review_id": 124, "restaurant_id": -2, "username": "Dopy1991", "date_of_visit": " March 2019", "rating": "5", "title": "Amazing cocktails", "comment": "I came here to meet with few friends and was amazed by the view of the city and quality of cocktails. The team is also super friendly", "date_of_review": "15 March 2019"}
{"review_id": 125, "restaurant_id": -2, "username": "TarynMeds", "date_of_visit": " December 2018", "rating": "4", "title": "Stunning location and hidden gem", "comment": "We stayed in the Hilton DoubleTree for a week and have used the bar several times. The location and view is amazing and the bar is clearly popular as it fills up quickly. The staff are very friendly and service is quick and fair. It is however very overpriced and not the greatest of cocktails considering the range of alcohol available which I guess is due to speed rather than quality.  I also have to say what wonderful Security staff, credit where it is due! Very friendly and gave us a small tour of outdoor area before it officially opened. Really nice and welcoming. I would certainly say it's worth a visit, and have a Sundowner, few places could equal the view, but its not somewhere I would go on a regular basis.", "date_of_review": "20 March 2019"}
{"review_id": 126, "restaurant_id": -2, "username": "JanetC2029", "date_of_visit": " February 2019", "rating": "5", "title": "Great views", "comment": "So close to the Tower, up on the 12th floor of the Doubletree at Hilton, you find this great cocktail bar with stunning views.", "date_of_review": "21 March 2019"}
{"review_id": 127, "restaurant_id": -2, "username": "affy1979", "date_of_visit": " March 2019", "rating": "5", "title": "Diamond venue in Tower Hill", "comment": "Who would think this was a stone throw from the tower. Hidden inside a hotel you will be pleasantly surprised. Bar is beautiful. Restaurant food was superb. Went for lunch and was blown away with the view and food. Tasty and value for money. A must go!!! ", "date_of_review": "19 March 2019"}
{"review_id": 128, "restaurant_id": -2, "username": "DecioVN", "date_of_visit": " March 2019", "rating": "5", "title": "Outstanding ", "comment": "Amazing bar, we went to this bar on a friends word, and it turned out to be a whole amazing experience. The terrace views are amazing, the staff are all very polite and attentive,even the security lady was so nice and cheerful with us, that’s not something we see everyday. We got Kristian looking after us, which made our night brilliant.  Cocktails were a top notch! ", "date_of_review": "23 March 2019"}
{"review_id": 129, "restaurant_id": -2, "username": "528stefaniae", "date_of_visit": " March 2019", "rating": "5", "title": "Great service", "comment": "I have been recently to Savage Garden with my friends and all I can say is : amazing. Starting from the great view until the great service and knowledgeable staff, made our experience unforgettable. We will like to thanks Kristian for looking after us and helping with the drinking choice. We will definitely come back. ", "date_of_review": "23 March 2019"}
{"review_id": 130, "restaurant_id": -2, "username": "Georgiana V", "date_of_visit": " March 2019", "rating": "5", "title": "Best cocktail bar!!!If you wanna have a drink in London and don’t know where, then Savage Garden cocktail bar is the one", "comment": "Wow...what a place, what a location, the view is to die for and the yummy delicious cocktails are just perfect  Me and my boyfriend we had the best night out at Savage Garden cocktail bar on Saturday the 23rd March and from our very first step in we were greeted and welcomed by the receptionist which took us to the table that Rimantas, the bar manager reserved for us. Andreas the waiter, took really good care of us and after each order we had he was coming and checking that everything is ok and if we are enjoying the cocktails...but how can you not like the most delicious and tasty cocktails in town? My recommendation is “Horny Beast cocktail” perfection  Manuel, the bar assistant was very attentive and made us feel so welcomed. And no, they weren’t nice and attentive just with us, they were going around making sure everyone is enjoying their time. I’ve been to few cocktail bars in London: The Shard, Aqua Spirit, Sky Garden in Fenchurch Street, Sketch, Bokan just to name a few but I have to give 10/10 to these guys at Savage Garden, they are the best out of all them, they really know how to make their guests feel good. The music is awesome, they have a terrace outside where you can have your drink while admiring the beauty of London from the 12th floor. I want to say a huge well done to Rimantas for the great job you do, you and your team.  The Best Cocktail Bar in London award is well deserved.!! I will be back soon with my crew friends ", "date_of_review": "24 March 2019"}
{"review_id": 131, "restaurant_id": -2, "username": "diaanaelena", "date_of_visit": " March 2019", "rating": "5", "title": "Great place", "comment": "Went with a friend and had a great time, the bar/lounge was not too crowded and the view from the terrace is gorgeous. Will go back soon :)", "date_of_review": "9 March 2019"}
{"review_id": 132, "restaurant_id": -2, "username": "Mike B", "date_of_visit": " February 2019", "rating": "4", "title": "Incredible London Views", "comment": "The venue is beautiful, the drinks are spot on - a bit expensive, but I wasn't expecting other thing from a London rooftop bar -, the coconut short ribs are delicious and the service was expectional.", "date_of_review": "19 February 2019"}
{"review_id": 133, "restaurant_id": -2, "username": "RiaTzani", "date_of_visit": " February 2019", "rating": "5", "title": "Amazing-Highly recommended!!!", "comment": "Everything was Excellent from service to food and drinks!!!! Outstanding quality! Cherry on top: breathtaking view!", "date_of_review": "18 February 2019"}
{"review_id": 134, "restaurant_id": -2, "username": "arteeemia", "date_of_visit": " February 2019", "rating": "5", "title": "Highly recommended ", "comment": "Amazing place with breathtaking view. The service was great, taking care of us throughout the night. Not to be missed ! ", "date_of_review": "19 February 2019"}
{"review_id": 135, "restaurant_id": -2, "username": "Annabel2805", "date_of_visit": " February 2019", "rating": "5", "title": "London’s best rooftop bar", "comment": "My experience at Savage Garden was absolutely amazing from start to finish. I went there with a group of friends without a booking.We were greeted by a very nice and polite host Tina which showed us around and explained all about the place. We could admire the amazing view from our table while the first class cocktails were prepared.The service during our visit was very good and the food we ordered delicious. I would like to thank all the staff for their kindness and professionalism. I will definitely be back and I do recommend this rooftop bar if you are looking for a luxury evening in cool atmosphere.", "date_of_review": "19 February 2019"}
{"review_id": 136, "restaurant_id": -2, "username": "Marita h", "date_of_visit": " February 2019", "rating": "3", "title": "Stunning setting, great hubub but my goodness, the prices!!!", "comment": "Came here on a very sunny February evening to meet a friend. The setting is amazing, with views to the Tower of London, Tower Bridge and the Shard to one side, and the Gherkin to another. Music was great. Wonderful outside tables with patio heaters so you can really enjoy the view. However, I don't recommend coming here unless you have a corporate credit card, your boss is paying, or you are prepared to sell a kidney. 2 SINGLE G&Ts were £38! I do expect to pay a premium for the location, but that is just ridiculous and to be honest, downright greedy. Unless a lottery win is on the horizon, I don't think I'll be back.", "date_of_review": "28 February 2019"}
{"review_id": 137, "restaurant_id": -2, "username": "dmnk18", "date_of_visit": " January 2019", "rating": "5", "title": "Great place to spend time with family/friends", "comment": "Such a great experience! Lovely staff and drinks are amazing;) A little bit pricy,but totally worth it.", "date_of_review": "28 February 2019"}
{"review_id": 138, "restaurant_id": -2, "username": "catherinef119", "date_of_visit": " February 2019", "rating": "2", "title": "Overpriced food no view", "comment": "Having been early to madisons rooftop bar have to say savage garden not a patch. We had booked a table but got one with no view and my friend sat with back to window. Left still feeling hungry as we couldnt have platter we wanted (min 4 people) and food we had had no sides so didnt fill us up. Drinks were ok but again pricey - even hotel was cheaper. Wouldnt visit again", "date_of_review": "24 February 2019"}
{"review_id": 139, "restaurant_id": -2, "username": "66travieosa", "date_of_visit": " March 2019", "rating": "5", "title": "Drinks and the Tower", "comment": "We thoroughly enjoyed our evening. The views of the Tower and the bridge are truly stunning. Being able to see the Shard was quite spectacular as well. We tried almost all of the signature drinks. My favorite and most potent was the Evil Eye. Don’t miss out on the charred octopus and the aubergine burger!! ", "date_of_review": "7 March 2019"}
{"review_id": 140, "restaurant_id": -2, "username": "Gabor_Treso", "date_of_visit": " March 2019", "rating": "5", "title": "Best rooftop bar in London", "comment": "Went for a quick cocktail and to enjoy the views. Maybe not the highest bar but the best views from any roofrop bar in London. I didn't attach a picture because you have to see it with your own eyes. Unique and tastefull cocktails made by skillfull bartenders. Abel and Clife is a great credit for the company.", "date_of_review": "6 March 2019"}
{"review_id": 141, "restaurant_id": -2, "username": "Scenic653133", "date_of_visit": " February 2019", "rating": "5", "title": "Relaxed", "comment": "The Narnia side is so chilled. Really lovely place to relax and the views are great! Really peaceful too", "date_of_review": "17 February 2019"}
{"review_id": 142, "restaurant_id": -2, "username": "LDD2019", "date_of_visit": " December 2018", "rating": "3", "title": "Breathtaking Views", "comment": "The views are absolutely spectacular and it's well worth going there for them. You can clearly see Tower Bridge, the Tower of London and the Shard. However, their cocktails were not that great and quite expensive. My friends and I mostly left them.", "date_of_review": "13 January 2019"}
{"review_id": 143, "restaurant_id": -2, "username": "Travelhouseuk", "date_of_visit": " January 2019", "rating": "2", "title": "Not as per they advertise online", "comment": "i dont know they have advertise in there Instagram so i visit there really terrible theme restaurant and the cocktails and all of the stuffs are just low quality as i think just waste my money there", "date_of_review": "9 January 2019"}
{"review_id": 144, "restaurant_id": -2, "username": "Alishapaige17_", "date_of_visit": " December 2018", "rating": "5", "title": "Lovely for evening drinks", "comment": "I decided to try this bar as I was staying in the hotel beneath it, and I wasn’t disappointed! It was classy, with beautiful views and lots of seating areas. We only had drinks so I can’t comment on food, the drinks were lovely but pricey as expected, but the experience made up for it. Would definitely return if I’m in the area.", "date_of_review": "13 January 2019"}
{"review_id": 145, "restaurant_id": -2, "username": "Naren P", "date_of_visit": " January 2019", "rating": "4", "title": "Breath taking views", "comment": "Nice bar and restaurant on the 12 floor, with great view of London city. The staff are very nice. It’s a bit pricey. ", "date_of_review": "13 January 2019"}
{"review_id": 146, "restaurant_id": -2, "username": "TartanTeddyBear", "date_of_visit": " January 2019", "rating": "4", "title": "The Views", "comment": "While staying at the Doubletree Tower Bridge hotel below, we dropped into the bar on the roof. Spectacular views across the Thames including Tower of London, Tower Bridge, The Shard etc. Prices spectacular too, but expected due to location and views. Definitely worth a visit.", "date_of_review": "14 January 2019"}
{"review_id": 147, "restaurant_id": -2, "username": "Maisywigsop", "date_of_visit": " January 2019", "rating": "5", "title": "Cocktails n view", "comment": "Such a amazing venue, view, music and the interior and outside garden is beautiful. Marco the barman made the best cocktails, recommended some cool places for after savage closed & made our night so fun! He is a great barman. Highly recommend for a night out. Dj was on point!!", "date_of_review": "19 January 2019"}
{"review_id": 148, "restaurant_id": -2, "username": "thedealhunter2018", "date_of_visit": " December 2018", "rating": "4", "title": "Fantastic service and great views over the city", "comment": "We visited This rooftop bar and restaurant when we stayed at the hotel which I also recommend. We had great service from start to finish and the bar is a very warm and relaxing place to be, well it was when we were there at lunchtime. I definitely recommend going there just for a drink to see the views but am not sure if its for hotel guests only or not though.", "date_of_review": "8 February 2019"}
{"review_id": 149, "restaurant_id": -2, "username": "Laura L", "date_of_visit": " February 2019", "rating": "5", "title": "Great night!", "comment": "I came here recently having visited when previously known as the Sky Lounge so wasn't sure what to expect. As soon as we got there the first thing I noticed was the luxurious decor and music. The DJ was fantastic and the bar itself was just like I remember...only better! The views in this place are spectacular and the food so so delicious. If you like a cocktail or two then this is somewhere you need to visit.", "date_of_review": "13 February 2019"}
{"review_id": 150, "restaurant_id": -2, "username": "scottsmitha3", "date_of_visit": " February 2019", "rating": "3", "title": "Poor service ", "comment": "In an awe inspiring location, we visited this bar as we was staying in the hotel. It has great views and a good vibe. However our host at table service was disappointing, they particularly tended to oblige in assisting the larger party near us and we both felt we was getting a second rate service after a couple rounds we was sick of it . Don't be put off it's still worth a visit to see the view and I'm sure there is some fantastic staff there as in the hotel in which it sits", "date_of_review": "17 February 2019"}
{"review_id": 151, "restaurant_id": -2, "username": "mcconbr", "date_of_visit": " November 2018", "rating": "5", "title": "Ms", "comment": "Me and my friend had Afternoon Tea at the Savage  Garden yesterday and it was very nice! Good food, friendly staff and amazing views! I will go back!", "date_of_review": "8 November 2018"}
{"review_id": 152, "restaurant_id": -2, "username": "h_qtr", "date_of_visit": " December 2018", "rating": "1", "title": "Very disappointed", "comment": "I saw the pictures in the Instagram and i liked the place especially the igloo  When I arrived there was nothing from the pictures i saw and no igloos! They place was empty! There was nothing related to Christmas or holidays..the food was i was really shocked", "date_of_review": "23 December 2018"}
{"review_id": 153, "restaurant_id": -2, "username": "Milly185", "date_of_visit": " November 2018", "rating": "1", "title": "Complete joke", "comment": "I didn’t even get as far as visiting this place as the customer service for the booking system is so appalling that I didn’t even make a reservation.  After sending an initial reservation enquiry and hearing nothing for 3 days, I called the reservations team and got through to Alina. She told me she did not have an e-mail from me and gave me a completely different e-mail address from the one listed on the website (?!) and told me to re-send my enquiry. I obliged and yet another day passed with no response. I sent another e-mail to her and again heard nothing. I called and got her answerphone. 6 days after the initial enquiry I got through to another girl on the reception desk. Her attitude was rude, dismissive and patronising. When I asked to speak to a manager and told her I wanted to complain, she miraculously became the ‘team leader’! She begrudgingly explained the food/drink package to me all with an air of arrogance. I asked her to e-mail these details to me and guess what?....she didn’t! There are so many wonderful places to eat and drink in London and I find it astonishing that an establishment which employs such appalling, self-important staff members still expects to attract custom! You will see from my other reviews that I usually write very balanced and overall positive reviews so take my advice and go to one of the many other fabulous places in London which deserve your custom unlike this joke of a place.", "date_of_review": "7 November 2018"}
{"review_id": 154, "restaurant_id": -2, "username": "Jayne200047", "date_of_visit": " November 2018", "rating": "5", "title": "Amazing view", "comment": "Great bar with views of The shard, Tower of London etc. We were there at sunset but unfortunately cloudy! Lovely to be there to see views by day and night though. Good mojitos but a bit pricey to be expected for the location however. Had a couple of snacky foods really nice. Staff lovely. We didn't book as arrived at about 4 but was much busier when we left. Lovely place to have a drink in London ", "date_of_review": "9 November 2018"}
{"review_id": 155, "restaurant_id": -2, "username": "Navigator43442494628", "date_of_visit": " November 2018", "rating": "3", "title": "Dissapointed", "comment": "Was realy looking forward, to going here, as we had traveled from inverness down, the photos online looked fab, but in reality the music is to loud, where you eat you dont realy get a view, its only when you go outside you get a good view, food pricey for what you get, its very tasty, but not a lot on sharing platters. Wont go back.", "date_of_review": "1 December 2018"}
{"review_id": 156, "restaurant_id": -2, "username": "lettuces54", "date_of_visit": " November 2018", "rating": "1", "title": "Don’t go here for a corporate event", "comment": "Was recommended to go here so decided to book it for our works Christmas do. Having confirmed availability and a date we were then asked for a deposit to reserve a space. I gave my credit card details and without confirming the exact numbers of people attending they debited £1,400 without permission. I have been trying to rectify this for a week now and it is impossible to get hold of anyone by phone, even after numerous messages or by email. I work for a large international firm and was hoping to recommend this as a venue for future events but it is a shame that we have not even had our event and we are already disappointed. I hope by writing this review they are able to look into their booking system and improve their customer service experience. This is part of the Hilton so I did expect more. ", "date_of_review": "30 November 2018"}
{"review_id": 157, "restaurant_id": -2, "username": "Martin T", "date_of_visit": " December 2018", "rating": "2", "title": "Rip Off ", "comment": "Visited here while staying at the Hilton. The views outside are really impressive but that's where it ends. Prices are a total rip off for what u get. Pompous bar staff who can wait to keep your credit card in the safe. Watch the spirit measures if you visit here. 2 stars for the views no stars for the rest. ", "date_of_review": "4 December 2018"}
{"review_id": 158, "restaurant_id": -2, "username": "icklesammypie1984", "date_of_visit": " November 2018", "rating": "4", "title": "Pleasantly surprised :)", "comment": "A friend & I where in London for a gig at the O2, decided to make a day of it & book somewhere nice for lunch. We made a very last minute reservation online (literally an hour & a half beforehand on our train journey up!) & booked for an offer they had running for 2 courses for £18 (absolute bargain considering the menu is quite pricey, I think one of our starters alone was priced at £18!). I was a little apprehensive that we would feel a little out of place but from the moment we arrived the staff could not have been more friendly, views where amazing, we had a little wander around, the narnia area, done up for the festive season looked gorgeous & the food was delicious. Although pricey I would definitely visit again as a little treat on a day out.", "date_of_review": "14 December 2018"}
{"review_id": 159, "restaurant_id": -2, "username": "dorisdouble", "date_of_visit": " December 2018", "rating": "1", "title": "Very disappointing ", "comment": "I booked ‘Narnia’ at Savage Garden based on the magical sounding experience detailed on their website....starting with a lift which is a wardrobe and themed cocktails! It really set the scene for a magical themed experience. Unfortunately this was not the reality...the lift was just a normal lift! Drinks were not themed and on top of that they didn’t have my booking and advised me I would have to go into the regular bar, upset by this as I had been looking forward to Narnia all day I was finally advised to stand at the bar in Narnia while they found us a seat. Upon entering the Narnia area I was faced with multiple empty tables (these were not reserved) I was also faced with rather lame decorations, loud 80’s music and non Narnia themed drinks on the menu...definitely not magical!  We were seated at one of the empty tables...no offering/apology for messing up my booking.  The bar staff advised me they are no longer allowed to use the Narnia theme as Disney complained....I feel this should be reflected on the website to ensure expectations are managed....as mine certainly were not! ", "date_of_review": "16 December 2018"}
{"review_id": 160, "restaurant_id": -2, "username": "LibmanUK", "date_of_visit": " December 2018", "rating": "2", "title": "Walked out before we ordered the meal", "comment": "We booked a 'table' for 5, on arrival we were shown to a 500mm square high table that had 3 high chairs around it, initially we all thought that this was just somewhere where we can wait for our table to be be ready for us. Not at all, this WAS our table!!! Bare in mind that we had booked a table for 5 and this very small, square, 4-sided 'bar table' that was pushed hard up against a twig, (more on that later) that was hard up against the window! There wouldn't have been enough room for 3 of us eating a meal let alone 5! Then there was the decorations which for this time of year was supposed to be themed 'Narnia'. There was absolutely nothing about a few white painted twigs that remotely resembled Narnia and there was very little else to try to back this theme up, a very poor showing. We checked out the drinks menu and even for central London we all thought that they were really expensive so only two of us bought drinks, (lower the prices and perhaps you'll sell more is my tip!). Then we checked out the food menu, looked at the small choice, looked at the extraordinary prices, looked around, looked at our very small table then all at once we looked at each other and said to each other: 'I'm not a Celebrity, get me out of here'. Well actually I've just made that bit up but 3 of us did say almost together that we didn't want to stay to eat here. So once we had googled the restaurants nearby and finished their drinks we left. We didn't go far, in fact we just went down 12 floors to the ground floor restaurant 'Natural Kitchen and oh boy were we glad we did that! I'm just about to write a review on that place as well so look that up.", "date_of_review": "19 December 2018"}
{"review_id": 161, "restaurant_id": -2, "username": "jane a", "date_of_visit": " November 2018", "rating": "5", "title": "Fantastic", "comment": "The views from here are fantastic , the London skyline practically all round.  I have visited before but happened to be there on bonfire night the fireworks were great from Greenwich or blackheath? and not so loud!  Not cheap but great and everyone can see the view.  An outside area too. ", "date_of_review": "5 November 2018"}
{"review_id": 162, "restaurant_id": -2, "username": "magnumboots", "date_of_visit": " September 2018", "rating": "5", "title": "AMAZING!", "comment": "A truly stunning venue! Breath taking views. Beautiful environment and decor. We had food and drinks with both being very delicious. The rib of beef was actually enough to share! However we also had the tomahawk pork chop which was also very delicious. Of course, London prices but on this occasion the venue and quality of everything was worth every penny! Cocktails were lovingly prepared and the staff were spot on! For a special occasion I would highly recommend this venue! ", "date_of_review": "24 September 2018"}
{"review_id": 163, "restaurant_id": -2, "username": "RobertLondon", "date_of_visit": " September 2018", "rating": "4", "title": "Good location.", "comment": "Stopped here for a drink on a sunny late afternoon. Great views and service was excellent. Well worth a visit. Bottle of Stella £6, Glass of wine £11 plus service charge.. so 2 drinks £19.13.", "date_of_review": "25 September 2018"}
{"review_id": 164, "restaurant_id": -2, "username": "chrissieb94", "date_of_visit": " October 2018", "rating": "5", "title": "Amazing!", "comment": "We had just checked into the Double Tree Hilton Tower Hotel and ventured to the roof top bar Savage Garden. We had cocktails and they were superb. When asking about nibbles the waiter asked if we’d tried the ‘injectable doughnuts.’ They were so scrumptious we had a second batch! Views were just amazing and there was so much to see. It wasn’t cheap but then you are paying for the whole experience. We returned late in the evening after our theatre show and had a nightcap. The bar was quite full and vibrant. Staff were really friendly. The atmosphere was amazing!", "date_of_review": "1 October 2018"}
{"review_id": 165, "restaurant_id": -2, "username": "E3726QBjackd", "date_of_visit": " October 2018", "rating": "2", "title": "Overpriced...", "comment": "The staff here are very good, you pay the price for the view. But unfortunately, they close the rooftop early so you can’t enjoy it. Therefore it just becomes another ‘trendy’ overpriced london bar. ", "date_of_review": "5 October 2018"}
{"review_id": 166, "restaurant_id": -2, "username": "Enikő P", "date_of_visit": " October 2018", "rating": "5", "title": "Best rooftop bar in London with breathtaking views", "comment": "We have visited Savage Garden on a Thursday. The bar is brand new and has very stylish interior. I think the best views over London with the Tower Bridge and the Shard. The cocktails were very nice and came with beautiful garnish. The prices are in line with similar Londonba venues. For us it was a special occasion and exceeded our expectations. We only had some very delicious nibbles but will try the food next time. Thanks very much for the attentive service Abel and his team!", "date_of_review": "19 October 2018"}
{"review_id": 167, "restaurant_id": -2, "username": "numzi1", "date_of_visit": " October 2018", "rating": "4", "title": "Our 1st night in London", "comment": "We had drinks here on our first night in London and it was a pleasant enough venue. Bar staff seemed on the ball. Some great views of London from up on the 12th floor. Nice place for evening drinks. ", "date_of_review": "20 October 2018"}
{"review_id": 168, "restaurant_id": -2, "username": "SansAlcohol", "date_of_visit": " October 2018", "rating": "3", "title": "Nice views but you pay for it", "comment": "Its a nice bar with lovely views, great to sit it the sun and take it all in. But crikey its expensive, and they even try to charge a service charge when you order at the bar. I wouldn't bother going back", "date_of_review": "9 October 2018"}
{"review_id": 169, "restaurant_id": -2, "username": "gemmalouiseb2018", "date_of_visit": " October 2018", "rating": "3", "title": "Nice views ", "comment": "Had a girls weekend away for my friends birthday and we stopped off here for a cocktail. Had planned to stay for dinner but the menu didn’t really have much to offer me (I don’t eat meat, wheat or dairy - so nothing personal against the venue. I’m just very hard to cater for)  It’s a nice bar, very trendy. We went on a Saturday early evening, about 7ish and it wasn’t too busy. Got a seat by the windows as was too windy to sit outside. My friend had their version of an espresso martini. She wasn’t a fan as it wasn’t like the original, but I think that’s more her taste than anything wrong with it. I had a dissarono and Diet Coke. The 2 drinks came to around £26. So it’s expensive, but that’s because of the views I guess. We didn’t stay for a second drink. It’s nice but I think there’s better places to go. ", "date_of_review": "21 October 2018"}
{"review_id": 170, "restaurant_id": -2, "username": "adriant248", "date_of_visit": " September 2018", "rating": "5", "title": "Great views", "comment": "Hadn’t been before and have now discovered another high rise classy vibrant bar with great views across London. Great atmosphere and mood lighting. Only stayed for drinks. ", "date_of_review": "20 September 2018"}
{"review_id": 171, "restaurant_id": -2, "username": "97anitaj", "date_of_visit": " November 2018", "rating": "4", "title": "Great views ", "comment": "Lovely recently refurbished bar with great views of the Tower of London, Tower Bridge, The Shard to name a few. Drinks menu is a bit wordy, every cocktail has a story which isn’t necessary. Mojito was delicious, alcohol free cocktails weren’t pleasant at all! Drinks were expensive but as you would expect in s hotel bar in London. Nice staff, comfy seating and great music. Worth the trip up to the twelfth floor. ", "date_of_review": "2 November 2018"}
{"review_id": 172, "restaurant_id": -2, "username": "IreneSteele2016", "date_of_visit": " July 2018", "rating": "4", "title": "Amazing views. Drinks very expensive but it's a London Rooftop Bar after all. Staff were quite rude.", "comment": "We stayed at Double Tree, Tower Bridge so had to visit the Rooftop Bar which we had heard so much about.", "date_of_review": "5 August 2018"}
{"review_id": 173, "restaurant_id": -2, "username": "owl1Uk", "date_of_visit": " August 2018", "rating": "5", "title": "Formerly Skylounge now called Savage garden - Service has Improved", "comment": "First visit back here since the bar has had a refurbishment & re named as Savage Garden. I always think this bar is worth a visit for the views alone - spectacular. We visited on a Saturday evening. No trouble getting a seat with a view. There was a DJ playing some great tunes. The best bit for me was the superb service from every member of staff, really friendly and smiley. The host of the bar came round to introduce himself to us and ask for our feedback on the new bar. How nice! The drinks are a bit pricey but worth it for the view. Bar is accessed through the Doubletree Hilton lobby - take the lifts on the left handsome to floor 12. if you want cheap go to the Wetherspoons round the corner. We had lovely time and will be back.", "date_of_review": "5 August 2018"}
{"review_id": 174, "restaurant_id": -2, "username": "Templegrafton", "date_of_visit": " July 2018", "rating": "4", "title": "Fantastic views", "comment": "An amazing place to watch the world go by after a hard day in the city. Good drinks selection, good service, reasonable prices and stunning views. What's not to like?", "date_of_review": "22 August 2018"}
{"review_id": 175, "restaurant_id": -2, "username": "PointsAdventure", "date_of_visit": " August 2018", "rating": "4", "title": "Good Drinks and Great People Watching", "comment": "Despite always feeling old when I come - it offers a vibrant atmosphere, a great outdoor area with lots of great drinks and people watching. It is generally very loud but what vibrant rooftop bar isn't? The drinks are expensive but again, it's a rooftop bar, it should be expected. Lines can form during busier nights and times but I've always enjoyed the people watching and outdoor area. Great place to go with friends and/or colleagues.", "date_of_review": "8 August 2018"}
{"review_id": 176, "restaurant_id": -2, "username": "Halcyondays33", "date_of_visit": " August 2018", "rating": "4", "title": "Nice location - great views", "comment": "We were staying at the Double tree so it was nice to pop up to this excellent roof top bar for a night cap. Staff are great but service can be slow (it was busy when we were there). The Security staff can be a little intimidating and can spoil the atmosphere - they monitor this place like a third rate night club - not a high end location. ", "date_of_review": "27 August 2018"}
{"review_id": 177, "restaurant_id": -2, "username": "RSP1983", "date_of_visit": " August 2018", "rating": "5", "title": "Delicious lunch, stunning views and great cocktails ", "comment": "We came here on a Saturday for my partner’s birthday, just the two of us for lunch. It’s on the 12th floor. The 2 course lunch menu is £18 a head which is exceptional considering the size and the standard of the food. Delicious lunch and a good variety to choose from. Cocktails are £14-17 each and are beautifully made. Views over tower bridge are stunning. Must book in advance to secure a spot as becoming increasingly popular. Very nicely decorated and just a really swanky but relaxing vibe. ", "date_of_review": "27 August 2018"}
{"review_id": 178, "restaurant_id": -2, "username": "Y2745DFchristinac", "date_of_visit": " September 2018", "rating": "5", "title": "Group dinner", "comment": "Great view, London bridge is shining under the sun. Food is nothing fancy, deco is. Golden pineapple, macaron coloured hamburger Rib is very tasty, it is my favourite, other seafood is fine but not overly excited", "date_of_review": "4 September 2018"}
{"review_id": 179, "restaurant_id": -2, "username": "Smudge43", "date_of_visit": " August 2018", "rating": "3", "title": "Ok but nothing to get excited about", "comment": "Certainly think that this place is a more \"style over substance\" kind of a place in my opinion. The location is great in terms of the view across the City. On the food choices and cost, well it's London so expect high prices e.g. a bottle of beer being £6.00, Buttermilk chicken slider (3 of them) £15.00 and a small portion of garlic dries £5.00. For me they didn't have a huge amount of choice so I would wonder out and explore in all honesty.", "date_of_review": "28 August 2018"}
{"review_id": 180, "restaurant_id": -2, "username": "dannyroy1981", "date_of_visit": " September 2018", "rating": "5", "title": "Miss reader", "comment": "Visited last night with my fiancée to celebrate our 2nd anniversary Were given a table with fantastic views and also a complimentary cake atmosphere was fantastic as was the service cannot wait to visit again.", "date_of_review": "9 September 2018"}
{"review_id": 181, "restaurant_id": -2, "username": "smayf", "date_of_visit": " August 2018", "rating": "5", "title": "Well managed bar/attraction ", "comment": "The new Savage Bar is really nice. We went for cocktails and they were great, don’t complain about the price, it’s London, in a nice hotel and with great views!  Our trip was made more satisfying by the great management. Thank you to the young man in the suit with the fancy ponytail! You certainly know how to look after customers, perhaps others should learn from you. ", "date_of_review": "4 August 2018"}
{"review_id": 182, "restaurant_id": -2, "username": "K9409LVjoannad", "date_of_visit": null, "rating": "1", "title": "Don’t bother - how rude", "comment": "Arrived at the rooftop for a pre dinner drink with friends. Apparently rebranded and now called Savage. Aptly named by the way we were greeted by Molly. Savage indeed. Won’t be going back. Such a shame as we were frequent customers - as Hilton Honours members we thought we would’ve been granted access!", "date_of_review": "16 June 2018"}
{"review_id": 183, "restaurant_id": -2, "username": "macglen", "date_of_visit": " July 2018", "rating": "4", "title": "New vibe", "comment": "Have visited sky lounge on numerous occasions always enjoyed the atmosphere views etc. It's had a refurb now called the savage garden has an area now for reservations and the bar area is for walk in customers. Was greeted by a friendly member of staff who directed us to the bar area as we had no booking. Tables were available and the new decor was good. Service as always friendly it is pricey but the views are excellent and that's a bit of what you pay for.still love it and would recommend.", "date_of_review": "17 July 2018"}
{"review_id": 184, "restaurant_id": -2, "username": "Jenny M", "date_of_visit": " June 2018", "rating": "1", "title": "Awful experience!!", "comment": "We were staying at the hotel for an anniversary treat and arrived at the rooftop bar for pre drinks. We were asked if we had a reservation, which we didn't (why would you need a reservation to go to a bar) we were then rudely told to stand to one corner where everyone else in a long queue was served and taken to the bar area! The manager has appalling customer service skills, he was extremely rude. When we confronted the manger for the way he treated us he then threatened to have us chucked out if we complained! There were also other couples having the same issues and raising complaints! Disgusting. We have been to many rooftop bars in London and never been treated in such a way. Will not be returning!!", "date_of_review": "27 June 2018"}
{"review_id": 185, "restaurant_id": -2, "username": "drnick265", "date_of_visit": " July 2018", "rating": "5", "title": "Breathtaking Views and Good Drinks!", "comment": "We stayed in the Hilton Hotel where this lounge is and loved the views both day and night! There is almost always something happening here...so go have some fun like my wife and I did! Dr. Nick", "date_of_review": "28 July 2018"}
{"review_id": 186, "restaurant_id": -2, "username": "Shelley B", "date_of_visit": " July 2018", "rating": "5", "title": "Amaaaazing views, brilliant cocktails!", "comment": "Visited many times but recently refurbished, lovely seating, great decor serviced by lifts to the 12th floor. Waiter service with unusual cocktails and any made for you but the price isnt cheap! Seating outside and inside and the views are totally amazing day or night overlooking the London sights", "date_of_review": "30 July 2018"}
{"review_id": 187, "restaurant_id": -2, "username": "barboraf370", "date_of_visit": " August 2018", "rating": "4", "title": "Breathtaking view, delicious food but disappointed about reservation system", "comment": "We went Savagegarden yesterday with our friends to spent nice dinner time. Basically we made reservation for dinner day before and when we came and ask for table hostess told us that table is not ready so if we are okay to have a drink and let us know when table will be ready. Unfortunately all tables were occupied so I had to ask member of staff her name was Ligia if she could let us now about any free table. Ligia was so NICE and HELPFUL so we got our table after one hour sitting inside and we even couldn’t talk to each other because of loud music. I can’t complain about food and drinks, it was amazing but I think it doesn’t make a sense to have reservation system if it’s not working in reality at all. Again many thanks to LIGIA, hope you will serve us again!", "date_of_review": "2 August 2018"}
