{"review_id": 1, "restaurant_id": -7, "username": "Katie M", "date_of_visit": " August 2020", "rating": "1", "title": "Worst place in Camden - staff are incredibly rude and go out of their way to be unhelpful", "comment": "Visited with a friend in August. With the new COVID rules you have to order online. We ordered two separate orders and one arrived one didn’t. After half an hour of waiting for a drink I went to ask at the bar if they had gotten the order and whether it was coming. The waiter said he would bring it over but after a further half an hour no drink was brought. It wouldn’t be an issue if I hadn’t paid but as I had, I felt like it was within my rights to get the drink. After over an hour we were leaving and i asked if I could get a refund because so much time was wasted and we had to get moving. Multiple bar staff tried to convince me that it would take so much time and hassle to request a refund but in the end it took less than a minute. I think it’s extraordinary and rather insulting that they were so unhelpful in giving money back. Whilst filling out the ‘refund details’ I was patronised and made to feel like my request was stupid, even though they had taken my money and not delivered and were now not wanting to give my money back. Special shout out to the waitress at the bar who lacked any decorum/decency and ridiculed to our faces that we asked for a refund. I’d be embarrassed to employ staff who clearly are not cut out to be around people and work in hospitality. After reading other reviews it’s pretty clear that this is not the first time someone has asked for a refund and by the sounds of it, not many people actually receive them. I would therefore recommend any other bar in Camden if you want to have a nice experience.", "date_of_review": "16 August 2020"}
{"review_id": 2, "restaurant_id": -7, "username": "bobbiea482", "date_of_visit": " July 2020", "rating": "1", "title": "Love to be ignored despite sending 6 emails and the promise of a refund", "comment": "We booked to go before lockdown and then amended the sate to 1st august. As restrictions are still on place we decided to get a refund. Emailed fest camden 2 months ago and they emailed back stating the refund was being processed. We have not received it and getting no response from emails sent. Poor poor communication and will never ever book with this company again.", "date_of_review": "27 July 2020"}
{"review_id": 3, "restaurant_id": -7, "username": "6vickiw", "date_of_visit": " November 2019", "rating": "5", "title": "Brunch with the boys", "comment": "Amazing! Best friend bought us tickets for bottomless Prosecco brunch with the boys, we’ll worth the money. Prosecco truly was bottomless for an hour and the drag act was fab, music was banging and the boys were super impressive. After show the music really started and we stayed for a couple of hours dancing and drinking, will definitely return! ", "date_of_review": "13 November 2019"}
{"review_id": 4, "restaurant_id": -7, "username": "darbo2017", "date_of_visit": " August 2020", "rating": "1", "title": "STILL NO RESPONSE - DISGUSTING", "comment": "booked yo go in March and yhen due to lockdoen amended to August. we decided against going due to current times and was promised a refund on July 13th.Still not made it to my bank account and getting no response whatsoever. this place is a shambles and never ever experienced such bad customer service.", "date_of_review": "18 August 2020"}
{"review_id": 5, "restaurant_id": -7, "username": "I1073IN_", "date_of_visit": " July 2020", "rating": "1", "title": "Very Disappointed", "comment": "On the 3rd of July I made an online booking at your venue for a friends 30th birthday. Paying a £25 deposit. When we attended your venue we were informed that food was still being served and available to order.  We sat down at the table and ordered drinks. I do not drink alcohol, so I ordered a “mocktail” for myself. Because of the policy in place at your establishment due to the Covid19, I was unable to order drinks directly from the bar. The waitress, name unknown, assured me, that if I ordered a pineapple juice, she would make it come as a non alcoholic mojito. This did not happen and instead it came as the pineapple juice. 10 minutes after the food order had been taken and paid, the waitress returned and informed us that the kitchen was closed and no food was available. The waitress then gave me a refund for the food and informed the deposit I had made online for the booking would be refunded on the 20th of July. Now over one week later, I have still not received my deposit back.", "date_of_review": "31 July 2020"}
{"review_id": 6, "restaurant_id": -7, "username": "Aabaana", "date_of_visit": " December 2019", "rating": "2", "title": "Entertainment? GREAT! - Food DISGRACEFUL!", "comment": "Whilst the signage needs to be vastly improved (communication is King), the staff were very welcoming and friendly. The setting and lighting was good with an enjoyable ambience. The menu was fine with good choices for starters, mains and sweets - and at £20 for three courses, had everything been edible, it would all have made for a great night; however, unfortunately, the food wasn't even satisfactory. From the quality of the meal, I hope it's simply down to a lack of qualified catering staff on the night - as there's simple NO EXCUSE, for serving heated frozen vegetables! - They were rank! Anyone in the hospitality industry will confirm, an eatery can best be judged by the excellence, or not, of the vegetables it serves. A lesson to be learned here. The three vegetables served:- tasteless, limp carrots; dry, dodgy tasteless roast(?) potatoes, and solid frankly awfully tasteless Brussel sprouts - and I usually love all three BUT these were the worst vegetables I believe I EVER experienced! Ultimately, if an eatery can't get the basics right, then don't take people's money - as simple as that. Had the entertainment been SO good, I would have refused to pay for at least the main course. Finally, the establishment knew the three guests sat at our table were unknown to each other and just happened to be sharing a table together, I was therefore showed to be presented with the expectation and bill, for me to pay for the whole bill! Sharing a table and an evening does NOT mean I should be expected to pay for two total strangers and felt compelled to do so, to avoid total embarrassment! The Cabaret was REALLY GOOD; the waiting staff; the bar staff; the evening was REALLY GOOD - all spoiled by the quality (or lack of quality) of the food - a main, if not THE main ingredient on offer to its Customers.", "date_of_review": "20 December 2019"}
{"review_id": 7, "restaurant_id": -7, "username": "mmil094", "date_of_visit": " December 2019", "rating": "5", "title": "Great night at the cabaret to kick off the Christmas season", "comment": "I went with a group of friends and we had a great night! Fabulous energy with the entertainment, who all had great voices, style and performing ability. We didn’t eat there but what we saw looked amazing value for money. Sure there are the little things that are maybe a bit run down if you want to nitpick - but really this is just part of the character of these character warehouses that offer entertainment and food in London. It’s not meant to be a luxury class restaurant - but a down-to-earth entertainment venue with a unique character. Standard wines and beers were also in line with London prices. So all in all for what you pay and the value of entertainment I think this place is well worth a visit. ", "date_of_review": "22 December 2019"}
{"review_id": 8, "restaurant_id": -7, "username": "Antonio G", "date_of_visit": " February 2020", "rating": "1", "title": "Poor organisation", "comment": "I booked a month ago and now I received an unjustified cancellation \"sorry is fully booked\" basically they forgot my reservation.", "date_of_review": "13 February 2020"}
{"review_id": 9, "restaurant_id": -7, "username": "Sara A", "date_of_visit": " January 2020", "rating": "5", "title": "Amy Winehouse tribute with 3 course dinner - Fabulous", "comment": "Such an amazing night! The Amy Winehouse tribute act was so much fun with an amazing voice and larger than life personality - she's a must see. The venue was really nice, fabulous 3 course dinner with cocktails and the staff were AMAZING! I went on a wowcher deal and would be more than happy to pay full price for such a fun filled night!! I am looking forward to the next tribute act in this lovely venue!", "date_of_review": "6 February 2020"}
{"review_id": 10, "restaurant_id": -7, "username": "Laitrace", "date_of_visit": " November 2019", "rating": "5", "title": "Birdcage Caberet fest", "comment": "What a night!!!!!! Highly recommended the caberet gold package included processco 3 course meal and shots. The acts were amazing, staff were so helpful we had Luca who was flying around helping everyone. The compare was brilliantly funny and witty and the atmosphere was electric. We were a group of 30 and we all loved it and will be back to the birdcage soon", "date_of_review": "3 November 2019"}
{"review_id": 11, "restaurant_id": -7, "username": "bensR4312CM", "date_of_visit": " August 2020", "rating": "1", "title": "Staff are actively RUDE", "comment": "Staff at this venue are very very rude. Do not visit this place as you will leave feeling very angry.", "date_of_review": "21 August 2020"}
{"review_id": 12, "restaurant_id": -7, "username": "Ellen O", "date_of_visit": " July 2019", "rating": "4", "title": "Summer drinks", "comment": "Great spot for drinks in the sunshine with some shade. Great service and tasty pizzas and mezze which we ordered for the table. Would recommend for a catch up with friends.", "date_of_review": "25 July 2019"}
{"review_id": 13, "restaurant_id": -7, "username": "ziggy_camp", "date_of_visit": " August 2019", "rating": "5", "title": "Drinks on the Terrace", "comment": "This is a great spot with good drinks and live music! The music was a delightful backdrop to friends catching up.", "date_of_review": "26 August 2019"}
{"review_id": 14, "restaurant_id": -7, "username": "andreablackman", "date_of_visit": " July 2019", "rating": "4", "title": "Soultown Supper", "comment": "We went to Soultown Supper, FEST, Camden and we had an absolutely amazing time if you like Motown Soul era - you’ll have a great time!!! Would definitely recommend, BUT the food is awful so eat before you go or after - personally I could have cooked a better three course meal and the drinks are expensive, it’s also crammed in there BUT the ambience is fabulous and minus the food we had a ball!!! ", "date_of_review": "26 July 2019"}
{"review_id": 15, "restaurant_id": -7, "username": "brunettevet", "date_of_visit": " August 2019", "rating": "5", "title": "Great evening with friends", "comment": "Enjoyed a great evening here at the Birdcage cabaret. Meal was great, cocktails good and the entertainment was fab! Lots of fun in the club afterwards too! Special thanks to Simon for being so attentive.", "date_of_review": "1 August 2019"}
{"review_id": 16, "restaurant_id": -7, "username": "Jessicabella5959", "date_of_visit": " July 2019", "rating": "3", "title": "Needs WORK!", "comment": "A group of us booked to see the Saturday night comedy, I paid 50+ for tickets and an additional £40 for a bottle of wine and a meat platter for the table. The “meat platter” literally consisted of a few chicken nuggets and some spring rolls... nice. Also didn’t get the wine until I’ve over half way through until I said I had paid for that too, so we didn’t even get time to drink it. Drinks were £65+ a round (fine) but you don’t really get what you pay for in terms of the place. They turned off the aircon and it was the HOTTEST day in London so far. 35 degreee heat and every person in there and one point fanning them self down with a napkin because they didn’t want it on. Totally takes the P. They just seem to “go with the flow” kind of place, seems it needs a manager of some sort. disappointing over all, and the comedy wasn’t great either. It’s a shame because it could actually be a really good place and had we gone when it wasn’t so hot and they were a bit more savvy, it would have made for a great night!", "date_of_review": "1 July 2019"}
{"review_id": 17, "restaurant_id": -7, "username": "Valentina P", "date_of_visit": " September 2019", "rating": "5", "title": "Birdcage cabaret", "comment": "Delicious food, excellent entertainment, with real west end performes, lovely venue. Highly recommended for a special night out.", "date_of_review": "3 September 2019"}
{"review_id": 18, "restaurant_id": -7, "username": "Barrington", "date_of_visit": " September 2019", "rating": "4", "title": "Cool venue", "comment": "As a venue it’s pretty cool. The staff are friendly and it’s easy enough to get a drink.  Inside there is a great space with a really good sound system The only negative really is the toilets which were just plain revolting as they were dirty, broken and overflowing. ", "date_of_review": "14 September 2019"}
{"review_id": 19, "restaurant_id": -7, "username": "Lawrence251", "date_of_visit": " September 2019", "rating": "5", "title": "Amazing!!!", "comment": "This place has everything you could want for a fabulous evening the staff and the acts were incredible I want to do it all again and will defiantly be back", "date_of_review": "8 September 2019"}
{"review_id": 20, "restaurant_id": -7, "username": "582giovannaf", "date_of_visit": " June 2019", "rating": "5", "title": "Fabulous!!", "comment": "We went for the Birdcage cabaret I would highly recommend! Compare was funny and an amazing magician. All the acts were fabulous lovely friendly atmosphere. Sat at a booth with my husband and made two new friends! Mixed age groups. Fun evening. Thank you ", "date_of_review": "27 June 2019"}
{"review_id": 21, "restaurant_id": -7, "username": "sss1992", "date_of_visit": " September 2019", "rating": "5", "title": "Great value for money if hiring out for lots of people", "comment": "We were looking tirelessly for a low-key venue that had a nice decor, wasn't out in the sticks somewhere and had a good drinks selection - which also didn't charge us ridiculous amounts to hire for an area for 60 people. Wonderfest terrace rooftbar was perfect! It was affordable, decroated very well and they gave us a generous sized area.", "date_of_review": "10 September 2019"}
{"review_id": 22, "restaurant_id": -7, "username": "MrsDuc", "date_of_visit": " April 2019", "rating": "5", "title": "Perfect spot! ", "comment": "We visited for lunch with a small family group as part of a birthday celebration.We had a table in a prime spot, in the sun, overlooking the market. The live music was great and the place had a lovely chilled vibe . The service was prompt and friendly and the pizzas were delicious ! We will be back for sure - thank you! ", "date_of_review": "21 April 2019"}
{"review_id": 23, "restaurant_id": -7, "username": "daniel r", "date_of_visit": " March 2019", "rating": "4", "title": "Great night", "comment": "Our first visit here, and I must say, IT WAS GREAT!  I’d give this experience a 8/10.  The entertainment was brilliant, the singing was out standing, the dancing was very good and so was the comedy and host. However the food was not great by any means. Dry,bland and left a lot to be desired. The cocktails were GOOD. The DJ’s in both the birdcage and the nightclub were shocking. They couldn’t mix a hot chocolate let alone mix 2 songs. You had to wait in silence between each track. I thought this would be a basic skill for a Dj. But as I said over all a great evening but yes it could do with a little fine tuning.", "date_of_review": "24 March 2019"}
{"review_id": 24, "restaurant_id": -7, "username": "CarmenAC5", "date_of_visit": " April 2019", "rating": "5", "title": "Fest terrace Camden", "comment": "I spent a very pleasant time, good food and live music. Highlight the treatment of staff, especially Gabriele who solved me many doubts (and in Spanish) because I just landed in this country. Charming", "date_of_review": "10 April 2019"}
{"review_id": 25, "restaurant_id": -7, "username": "aidin2017", "date_of_visit": " April 2019", "rating": "5", "title": "BRILLIANT cabaret birthday night", "comment": "Absolutely fantastic! I have booked over groupon tickets for the show and food for four. The price was very low for London which made me worry a little bit how its gonna be. It turned out to be ten times better than expected. We had so much fun, laughed to tears, danced and sang. Service was great, very fast and professional.  Would recommend thousand times!!!!", "date_of_review": "7 April 2019"}
{"review_id": 26, "restaurant_id": -7, "username": "Alba T", "date_of_visit": " April 2019", "rating": "1", "title": "Very bad service", "comment": "I asked a beer, he said that was not available and instead of offering that beer I wanted in can he just left to go eat his pizza ignoring me standing there so I was about to leave but because my mom wanted a PIMMS I went back to ask one and the guy put only 4 blueberries and 2 slice of lime then I went back to ask to add some black and redberries since he added it to the person after me but in a rude way he said that he didn't had it at that time so he didn't added it and then he throw some slice of lemon in my glass saying ok? I was like no I want it like you did to the other customer, I paid the same and is not the same and also he was really rude to me so I was already not happy. After I asked again he put 3 redberries that were already off so he was going to throw it anyway. This really was the worst thing he could do and really put me off. I will never come back again and I will say to do not come here to my friends or people asking me advices for places in Camden. The only good thing of this place is the terrace and the singer. He is really good. But really bad service, the 2 italian guys are really poor quality in service and customer care. Really disappointed and look at the rotten redberries here as well.", "date_of_review": "22 April 2019"}
{"review_id": 27, "restaurant_id": -7, "username": "Kristie-to", "date_of_visit": " April 2019", "rating": "5", "title": "A night filled with glitter and dancing!", "comment": "We had an amazing time dancing the night way at a fun cabaret event in this interesting and historical building. The performances were fun to watch, and the DJs really knew how to keep the crowd dancing. All in all, a fabulous night out with friends.", "date_of_review": "22 April 2019"}
{"review_id": 28, "restaurant_id": -7, "username": "joel h", "date_of_visit": " June 2019", "rating": "1", "title": "Can’t wait for this venue to close down and be redundant", "comment": "Horrendous experience here. Booked an area for the football- champions league final to be precise. Currently 45 minutes in and the tv in our area is completely broken. What a shambles of a company. This event was planned in advance and has left myself and my friends heartbroken. I cannot wait for the day that the free market forces this ‘pub’ out of service and it no longer exists. It is hell on Earth and I could not recommend avoiding enough. Avoid this venue as if it was a dog s*** on the only way home taking up the whole path. Horrid.", "date_of_review": "1 June 2019"}
{"review_id": 29, "restaurant_id": -7, "username": "John P", "date_of_visit": " April 2019", "rating": "5", "title": "Boys Brunch Bonaza", "comment": "A group of friends and I went to \"Brunch with the Boys\" - boylesque bottomless brunch. The bagels were decidedly average, however, everything else was great. The show was incredible and riotously enjoyable, the host - drag queen Ruby Murray was hilarious and the prosecco for 1hr was truly bottomless. Needless to say, we all had a really good time and got rather drunk. It was a talking point amongst our friends for several days. I've also been to the cabaret dinner at Fest about a year ago and that was also really exceptional and the food was delicious too. I will definitely be going again and the price is really reasonable.", "date_of_review": "7 June 2019"}
{"review_id": 30, "restaurant_id": -7, "username": "lindafQ4803PY", "date_of_visit": " March 2019", "rating": "4", "title": "Cabaret", "comment": "Great night at the Cabaret, Fantastic show, great compare, amazing artists. The food on the other hand was terrible, it would be a good idea to stick to meze style like the starter which was fab. The pork cutlet a lump of tough fat & lamb so tough .  Please sort the food out. We will definitely return as one of the best shows in London. ", "date_of_review": "24 March 2019"}
{"review_id": 31, "restaurant_id": -7, "username": "Débora T", "date_of_visit": " February 2019", "rating": "1", "title": "Worst service ever", "comment": "30 minutes without being acknowledged watching everyone after is being served. And we were told off for asking if we were in the right spot to order.", "date_of_review": "16 February 2019"}
{"review_id": 32, "restaurant_id": -7, "username": "carriee2652", "date_of_visit": " June 2019", "rating": "3", "title": "Could be better", "comment": "Booked a Saturday night visit to the cabaret show at Fest via Groupon for myself and my bestie to celebrate our 40th birthdays. Had to pay a £10pp surcharge (normal for weekends). We were both excited for this new experience. Upon arrival we were seated in a quite small booth in a corner under the DJ with another couple. We weren’t informed we were sharing. The space was very intimate to be sharing with strangers. The show started, there isn’t a stage. They just sort of parade around between the tables. The artistes were great, amazing voices, lots of dancing and showmanship. And our host for the night Miss Polly-Rae had the right level of dirty and sweet. The service for drinks and food is hit and miss, and hectic. They cram a lot of people into a small space and can barely cope with the amount of staff on hand (not sure if they were short staffed or it’s always that way). Once the cocktails arrived they were delicious but took a while. The food was tasty however it was stone cold, and lamb rump cold can be challenging, especially with blunt, cheap knives. Overall the entertainment was great and engaging, the service needs rethinking as I imagine it would taste a lot better hot. And I would suggest the sacrifice of a couple of tables for a stage area. A good night but I wouldn’t go again.", "date_of_review": "9 June 2019"}
{"review_id": 33, "restaurant_id": -7, "username": "Gargamella13", "date_of_visit": " February 2019", "rating": "5", "title": "A magic Night", "comment": "Lovely dinner, fantastic cabaret show: funny and entertaining....what else? An awesome night dancing with my fiancé in the club listening to my favourite songs! It’s been incredible and I’ll definitely come back with more friends. Cheers!", "date_of_review": "17 February 2019"}
{"review_id": 34, "restaurant_id": -7, "username": "Sol1303", "date_of_visit": " February 2019", "rating": "2", "title": "Live music but disappointed", "comment": "A family day out in Camden town . We were feeling peekish and decided to take a pizza and a Camden pale Hale there .  We went at the bar area and asked if we could order a pizza.The waiter, with no interest at all, pointed at the other end of the bar and said: food is there. Ok first impression: not very welcoming at all The waitress was here and took our order straight away . 23£ for 2 pizzas. Then we were back to square one and asked about draught beers. A different but still not interested waiter simply said: none available today. Ok then what do you have? He pointed out at the fridges and that's all. At this point I could myself on the edge of loosing my temper but asked if he could explain which type of beers they had. Still the same answer :: the finger pointed at the fridges.  That was it. Saw a man wearing a costume next to him and guessed that he must have been the manager and decided to make him aware about the poor and despicable service we were getting. Well i realised with total dispare that this guy must have had the manager position not to give good customer service but just to wear a nice costume. Stay away from the Fest Camden if you are after a good service. For the food maybe ( tho our pizzas were just ok) ", "date_of_review": "24 February 2019"}
{"review_id": 35, "restaurant_id": -7, "username": "Gill S", "date_of_visit": " February 2019", "rating": "1", "title": "Day out", "comment": "Whilst in Camden and venturing into the stables as I always do, I took my friend to Fest Camden for a drink as it’s situated in a lovely area.  There was a queue at the bar about 10 long , one bar person serving and two others mucking about doing nothing and goading the one person serving . They could see the queue and didn’t even bother at all.  In the end my friend and I left the queue .  This place really needs to sort out its bar staff and their customer service skills, such a shame as it’s a lovely place to sit, socialise and have a drink if you can get one ......", "date_of_review": "22 February 2019"}
{"review_id": 36, "restaurant_id": -7, "username": "TeeFree1", "date_of_visit": " February 2019", "rating": "3", "title": "mixed feelings", "comment": "The tribute show was great, the singer was amazing. We got a 3 course meal along with the show which was terrible!! The pork cutlet was just a plate of fat and tomato sauce, the rice main was dry and tasted microwaved. Not to mention the service by a lady called emma on the phone while booking the tickets was sarcastic and unhelpful. The singer was the best part and that would of been booked from elsewhere....", "date_of_review": "20 February 2019"}
{"review_id": 37, "restaurant_id": -7, "username": "Nortoner", "date_of_visit": " February 2019", "rating": "1", "title": "Service, what service??", "comment": "We found this place and decided to stop for a coffee. There were about 5 people behind the bar and I asked if they served coffee, to be met with blank stares. One of the 'staff' eventually went 'yeah' and walked away?? So, is anyone going to help then?? Managed to find someone who could be bothered to make us drinks, which took ages. He continued to have a 'hilarious' conversation with his friend behind the bar and another member of the bar staff joined in the conversation.....totally ignoring the fact that they had a customer. Drinks were lukewarm and over £3 each.....absolute rip-off. You might be having a great time lads but you'll soon end up with no customers unless you learn some customer service skills. There are restaurants in London renowned for poor customer service and they get away with it because they serve excellent food (so the service is seen as a quirk). Based on your coffee, I'd say you have a problem.", "date_of_review": "24 February 2019"}
{"review_id": 38, "restaurant_id": -7, "username": "jeremy_hartigan", "date_of_visit": " February 2019", "rating": "4", "title": "Pete’s Birthday ", "comment": "I joined an old friend Pete and his wife and friends for a impromptu birthday soirée last night before a gig and Roundhouse  Situated above the entrance to Camden Lock the restaurant and bar is partially open to the elements  However a series of patio heaters and cover present a very trendy lofted view across the lock , passage and canal  Pete arranged a selection of chips, pizza , snacks and drinks  The large pewter topped bar is well stock and staffed  Despite being busy there was no delay in service  A nice place to feel elevated above the frenetic buzz of Camden and enjoy a drink and light refreshment. I hope to return ", "date_of_review": "27 February 2019"}
{"review_id": 39, "restaurant_id": -7, "username": "londongirl106", "date_of_visit": " March 2019", "rating": "5", "title": "Fantastic cabaret", "comment": "We went to the Bird cage cabaret. The show was absolutely fantastic.  It was even better than our expectations and we'll definitely be going back. The acts were very good, and well worth the price of the ticket", "date_of_review": "19 March 2019"}
{"review_id": 40, "restaurant_id": -7, "username": "tkeating1", "date_of_visit": " March 2019", "rating": "5", "title": "Birdcage Cabaret & Cocktails in Camden", "comment": "Went with my friends to the Birdcage cabaret and WHAT A NIGHT!  The room was atmospheric, the food was surprisingly good and the entertainment was OUTSTANDING! Really - the fabulous performances were West End worthy!  Overall excellent value for money.", "date_of_review": "16 March 2019"}
{"review_id": 41, "restaurant_id": -7, "username": "Kitty T", "date_of_visit": " January 2019", "rating": "5", "title": "My Birthday", "comment": "I booked the cabaret show for my birthday with friends and I was not disappointed! The show was amazing! Me and my friends thoroughly enjoyed! We also pre-booked dinner which was great! We then partied into the early hours in the club after. Big thanks to the team who made my birthday memorable. Would highly recommend booking cabaret!", "date_of_review": "14 February 2019"}
{"review_id": 42, "restaurant_id": -7, "username": "juliecC703RD", "date_of_visit": " February 2019", "rating": "2", "title": "COMEDY CLUB - JUST THE TONIC", "comment": "Lack of communication, got there at 6.45 (as per tickets) ready to be let in, door staff said you can't come in until 7.45 ready for show at 8.00. Huge queues were forming and it was cold and wet. Went in a spoke to somebody sensible who did allow us in to spend money in the bar!!!! Acts were an acquired taste with some extremely blue material which was not to my taste. Many left after first two acts. Would not visit again as there are other comedy clubs to visit.", "date_of_review": "13 February 2019"}
{"review_id": 43, "restaurant_id": -7, "username": "Liz140391", "date_of_visit": " February 2019", "rating": "5", "title": "YAY! to Cabaret!", "comment": "Booked in to one of their cabaret shows in the Birdcage room and it was such a good night! Really delicious dinner and the cabaret was fantastic - the talent! I shall definitely be booking again as it's good value for money and so much variety. Thanks!", "date_of_review": "11 February 2019"}
{"review_id": 44, "restaurant_id": -7, "username": "Gemma H", "date_of_visit": " January 2019", "rating": "5", "title": "Boys brunch", "comment": "I came to fest for the boys brunch on the launch in jan. it was honestly one of the best days out I’ve had in a long long time. It was literally like a club and was so so much fun. I’ve told all my friends about it. I’m going to try and go to their cabaret too as my friends have said how bloody brilliant that is too!", "date_of_review": "8 February 2019"}
