{"review_id": 1, "restaurant_id": -8, "username": "Alex F", "date_of_visit": " September 2020", "rating": "4", "title": "Lovely view, easy to find bar", "comment": "It is such a quirky and vibrant place, we had a lot of fun with my girlfriend, however, we had to wait a bit of time to be serviced, but that's not a problem, at least at the end everybody was happy! Will pay you another visit! Thank you for making our date night memorable!", "date_of_review": "15 September 2020"}
{"review_id": 2, "restaurant_id": -8, "username": "bikkip2020", "date_of_visit": " August 2020", "rating": "1", "title": "very rude front of house", "comment": "I visited 2020 Aug Bank hol and as they only accepted walk ins took my chance.  When I arrived I politely asked if there were any tables for my girlfriend and I. I was told no and there could be a wait of up too 30 mins.  We decided to wait in the designated line. We were the only people waiting in the line at that time.  A couple then arrived and decided to ask the front of house staff if she had a table for two also. To our surprise they were told there was a table and taken through?  The front of staff was a short female with black hair in a short / shoulder length haircut.  There could have been a hint of racism as we were of Asian oritenstion and she was letting a lot of other people from white/ Caucasian backgrounds through without hesitation.", "date_of_review": "2 September 2020"}
{"review_id": 3, "restaurant_id": -8, "username": "Juliana8822", "date_of_visit": " September 2020", "rating": "5", "title": "Best spot in Shoreditch", "comment": "Visited with friends for drinks and dinner on the terrace last night and had an incredible evening! The steak and calamari dishes were exquisite! The Passion Mint cocktail is definitely worth coming back for too. Couldn't have asked for a better time - the staff made it a very special evening for us.", "date_of_review": "3 September 2020"}
{"review_id": 4, "restaurant_id": -8, "username": "scallder", "date_of_visit": " September 2020", "rating": "4", "title": "Nice food but outrageous 15% tip", "comment": "Visited here with my wife for our 5th wedding anniversary. Upon arrival it was made very clear to us (kind of strayed into the aggressive category) that we had our table for 2 hours and it would be needed back at the set time. Fully understand the need to turn tables, but really think that message could have been communicated in a much better way. Anyway, the food and cocktails were great and decent portion sizes too. Service was alright but nothing spectacular so then rather offended to receive the bill with a 15% tip on it. Obviously understand tips are optional (and a tip was still left) but then the waiting staff seemed hugely offended that the full 15% wasn't paid. I struggle with paying 15% in the USA but for that you do usually get excellent service so feel having their standard service charge at 15% is pretty offensive", "date_of_review": "5 September 2020"}
{"review_id": 5, "restaurant_id": -8, "username": "Kammy2094", "date_of_visit": " August 2020", "rating": "1", "title": "Incredibly rude staff. Don’t bother wasting your time!", "comment": "We arrived as a walk in as the roof terrace does not accept bookings but were told by the very rude and arrogant woman at the entrance there was no space.  You work in hospitality - be accommodating and polite to your customers!!  Most definitely will not be returning not worth wasting your time or money here. There are many more beautiful rooftop bars in London with friendly accommodating staff. The boundary is most definitely not one of them. Don’t bother, stay away!!!", "date_of_review": "2 September 2020"}
{"review_id": 6, "restaurant_id": -8, "username": "bellen2705", "date_of_visit": " September 2020", "rating": "4", "title": "This bar was great, although ", "comment": "This bar was great, has great views of the surrounding area. We managed to see this gorgeous sunset. Stayed for 2 hours. Service was good and staff were nice. Although it’s on the expensive side I spent £45 on meal and 3 drinks. You’re paying for the view today. Portion sizes are small and not wide range.Would recommend for drinks not food ", "date_of_review": "2 September 2020"}
{"review_id": 7, "restaurant_id": -8, "username": "Laura W", "date_of_visit": " October 2020", "rating": "2", "title": "Disappointed..", "comment": "Had been really looking forward to this meal, however: Service- waited outside for a bit in the rain by a sign that said 'wait here to be seated'. When no one came we went inside and were greeted by a disinterested maitre d. Whilst waiting to meet our server the ladies next to us were asked to leave to make space for the next seating of customers. Eventually got to order, later heard new couple sitting next to us to hurry up and order as the kitchen was shutting. Whilst eating, a server cleared our side plates, moving the chips and sauce onto the table.. not sure why? Ambience - loud, hot, humid. Cramped together tables. Covid - no distancing between tables at all. Given heat and humidity this would be a high risk transmission environment. Couldn't see the QR sign in code. Food - starter was unpleasant. Ate less than half as it was so greasy. Waiter clearly clocked id not eaten it and then didn't ask what I thought and just cleared the plates. Steak was nice. Chicken and chorizo skewers were good. Chips could have literally come from the freezer at Iceland. Aioli was lovely. Cocktails were okay. Cost- I would happily have paid 30-40 for this meal.however, it cost just shy of 100 pounds. No printed bill given and when presented on an ipad the added service charge was not highlighted (15%). Upon booking a room at the boundary, we were advised that we would receive a glass of champagne each with a main meal. This was not offered to us, and we did not ask as by this point we wanted to leave.  I would never return here.", "date_of_review": "2 October 2020"}
{"review_id": 8, "restaurant_id": -8, "username": "FJRCL", "date_of_visit": " October 2020", "rating": "4", "title": "Great rooftop restaurant", "comment": "Return visit for me and my loved ones - definitely one of our favourites during Covid. Safe spacious dining area and outdoor covered terrace seating perfect for cocktails! Friendly team who have always looked after us. We miss the seafood platter though :(", "date_of_review": "5 October 2020"}
{"review_id": 9, "restaurant_id": -8, "username": "810glens", "date_of_visit": " October 2020", "rating": "4", "title": "Nice rooftop bar, very friendly", "comment": "Nice rooftop bar, very friendly and speedy service. Good bottle of Malbec, not massively expensive to what you may imagine for a Rooftop bar in the area", "date_of_review": "18 October 2020"}
{"review_id": 10, "restaurant_id": -8, "username": "L G", "date_of_visit": " September 2020", "rating": "1", "title": "Deceptive customer service ; professionally uncommitted", "comment": "Disappointed by the insensitive and casual attitude to customer service.. Booking was made on site, face to face a week before the event.... Found out at the venue, on the day of the event, that the booked Birthday lunch had to be cancelled because the receptionist made a wrong assumption about the attendees...  Imagine if it was a booking for a wedding!... Note: cannot comment on food and beverages as didn't had a chance to experience...", "date_of_review": "14 September 2020"}
{"review_id": 11, "restaurant_id": -8, "username": "charlieboychik", "date_of_visit": " August 2020", "rating": "5", "title": "A perfect evening", "comment": "A perfect evening.... we were staying at the hotel - and didn’t want a full meal. We were greeted upon arrival by a very friendly chap who took us to our table, brought us a complimentary glass of champagne and took our order without having to make a note of it - which was impressive!  You really feel like you are on holiday! With the view of the area, mood lighting, music ... great atmosphere...  The food we chose - charcuterie, a bit of seafood, buratina and chips! Yum yum  Oh and a cheeky glass of rose ...  Lovely .. perfectly lovely ", "date_of_review": "31 August 2020"}
{"review_id": 12, "restaurant_id": -8, "username": "153dih", "date_of_visit": " July 2020", "rating": "1", "title": "Totally Unwelcoming !", "comment": "Last night my friends and I went for drinks and dinner. We were greeted with the advice that our booking was for 2 hours only. We were early so wanted to have a drink before eating , there was some reluctance for us to sit outside on the terrace despite it being virtually empty. After dinner we had to negotiate to be able to return to the terrace despite the fact that there were plenty of empty seats ! Overall the venue is quite nice but nothing special , the food was average and the hospitality was unwelcoming . As there are so many wonderful places to go in London this will not be my choice again !", "date_of_review": "15 July 2020"}
{"review_id": 13, "restaurant_id": -8, "username": "pedwards01", "date_of_visit": " July 2020", "rating": "3", "title": "Let down by the service but great food", "comment": "Let down by the service but great food and overall good ambience, would return to give it another chance ", "date_of_review": "20 July 2020"}
{"review_id": 14, "restaurant_id": -8, "username": "PeterVindevogel", "date_of_visit": " July 2020", "rating": "4", "title": "What a wonderful place ", "comment": "Came here two times and I plan to come back. Great view and great atmosphere. When you make a reservation, ask for a place in the sofa's if you're not planning to eat ", "date_of_review": "13 July 2020"}
{"review_id": 15, "restaurant_id": -8, "username": "Lynn W", "date_of_visit": " August 2020", "rating": "4", "title": "Cocktails on the roof", "comment": "We enjoyed cocktails with a view, pricey but very nice. Staff very friendly. Busy had to queue for 30 mins due to covid-19 precautions.", "date_of_review": "14 August 2020"}
{"review_id": 16, "restaurant_id": -8, "username": "Monaam T", "date_of_visit": " August 2020", "rating": "5", "title": "Anniversary dinner", "comment": "My girlfriend took me here on our anniversary last Saturday and we had the loveliest dinner ! The food and drinks were great not to mention the amazing atmosphere. The staff were so friendly and accommodating especially our Cristina was absolutely brilliant and made the experience extra special ,we LL be back for sure ", "date_of_review": "15 August 2020"}
{"review_id": 17, "restaurant_id": -8, "username": "carlocU117DQ", "date_of_visit": " July 2020", "rating": "5", "title": "Amazing Location and Service", "comment": "I went with friends for the first time on this roof top located on the best Shoreditch 's part !! Service and drinks were pretty good i would raccomend to everybody this fancy place, i have to be thankful certainly to Christina the waitress for help me out to choose with her advices our drinks and let us feel welcome!", "date_of_review": "13 August 2020"}
{"review_id": 18, "restaurant_id": -8, "username": "Kwhite661", "date_of_visit": " August 2020", "rating": "5", "title": "Relaxing Sunday morning on the terrace.", "comment": "Cozy atmosphere, great service and delicious food. Wish I could stay longer to try the cocktails. ", "date_of_review": "16 August 2020"}
{"review_id": 19, "restaurant_id": -8, "username": "FJRCL", "date_of_visit": " August 2020", "rating": "5", "title": "Wonderful covid safe venue", "comment": "Lovey dinner with my friend for her first dinner out post-lockdown. Great social distancing measures and the staff made her feel very safe. Luckily the sun was out so it made the night perfect. Cocktails and dishes were scrumptious!", "date_of_review": "17 August 2020"}
{"review_id": 20, "restaurant_id": -8, "username": "Jeffe247", "date_of_visit": " July 2020", "rating": "5", "title": "After a very good experience", "comment": "After a very good experience dining in the sister kitchen downstairs at the Albion decided to try the Boundary on Saturday night , have to say the way it was well worth the short wait we had due to the safety precautions they had put into place due to Covid , all the staff were friendly and welcoming while at the same time ensuring safe practices, the menu choice is small but varied and there’s something for everyone, food was really good and well presented, our waiters serving us were really friendly and helpful, would highly recommend. ", "date_of_review": "13 July 2020"}
{"review_id": 21, "restaurant_id": -8, "username": "JMereCF", "date_of_visit": " August 2020", "rating": "5", "title": "Really fantastic evening", "comment": "Really fantastic evening. Sadly the weather took a turn but it wouldn't be a UK summer without a bit of rain!! The glass covered area we had dinner in was cosy and spaced really well given covid. Service was speedy and not too imposing. Really friendly team and the food was tops. We managed to get a spot under one of the umbrellas after dinner for cocktails. Great shoreditch spot!", "date_of_review": "16 August 2020"}
{"review_id": 22, "restaurant_id": -8, "username": "Ivalali", "date_of_visit": " December 2019", "rating": "5", "title": "Excellent meal", "comment": "We had a wonderful evening with my family at Boundary roof top. Cocktails were superb and calamari probably the best I’ve had. Definitely recommend trying the fondue! Overall it was beautifully hosted meal.", "date_of_review": "4 December 2019"}
{"review_id": 23, "restaurant_id": -8, "username": "Ashley1987Y", "date_of_visit": " April 2019", "rating": "3", "title": "Nice but poor\nFood", "comment": "I usually come here as my works meetings in shoreditch area, it is a nice place afterwork to enjoy a cocktail in the middle of the urban neighbourhood. The only thing is the quality of food, would need an improvement on that and than will Be perfect.", "date_of_review": "23 January 2020"}
{"review_id": 24, "restaurant_id": -8, "username": "Juliana8822", "date_of_visit": " February 2020", "rating": "5", "title": "Gorgeous place", "comment": "A few days ago I celebrated my birthday with my friends in Boundary Rooftop. The Restaurant has a fantastic view, fancy cocktails. I would like to say many thanks for the staff They made my day gorgeous. I strongly can recoment this place to anyone. I believe in the summer is the best spot. Many thanks for Boundary Rooftop team.", "date_of_review": "15 February 2020"}
{"review_id": 25, "restaurant_id": -8, "username": "Z4268XQrb", "date_of_visit": " February 2020", "rating": "1", "title": "The rooftop bar has seriously gone downhill", "comment": "Not sure what has happened to this place but it seems to have lost its way. We visited as a large group on Friday evening and did not have a great experience.  To begin with we entered through the lobby only to be unnecessarily held waiting whilst someone phoned up to confirm if there was room for us. A few minutes of waiting we are told there is and that we can go up. What we found when we came out the lift was maybe two or three tables of people, no more. There were more staff than customers so you’d think they’d hurry you up and in rather than waiting downstairs in a small cramped lobby.  We were ‘served’ (if you can call it that) by a lady who seemed to strongly resent being there. Rather than walking around the table menus were thrown on one side and when the drinks came they were passed to one person to pass around the entire table. With the unfriendly attitude we received we did not stay for more than one drink.  It was only when we decided to leave did our unfriendly waitress smile and actually express some pleasantries.  Should not have paid the service charge. For a place like this where you can sit outside with heaters on a cool February night in central Shoreditch for it to be almost empty on a Friday evening others must also not be happy with something. A shame.  It’s easy to lose regular customers but tricky to get them back once they’ve gone.", "date_of_review": "9 February 2020"}
{"review_id": 26, "restaurant_id": -8, "username": "karenb21", "date_of_visit": " January 2020", "rating": "5", "title": "It’s all about the service ", "comment": "I can’t for the life of me remember the name of our waiter but he was soo much fun. Really lovely buzzy place . We did sit inside as it was January but the view was still great . Food reasonably priced wine not so cheap though. Good standard of food here would love to go back in the summer !", "date_of_review": "26 January 2020"}
{"review_id": 27, "restaurant_id": -8, "username": "Joanna1322", "date_of_visit": " September 2019", "rating": "4", "title": "Perfect weekend afternoon spot ", "comment": "Visited the rooftop on a Saturday afternoon and it was perfect. The sunshine was out and the space and vibe was super chilled. Chairs were comfy and drinks were spot on would definitely recommend to others! ", "date_of_review": "22 September 2019"}
{"review_id": 28, "restaurant_id": -8, "username": "BarryCLondon2019", "date_of_visit": " November 2019", "rating": "3", "title": "Good views over London but poor service and average food", "comment": "I sent an email to the Boundary about my experience, and didn't get a reply. I visited The Boundary rooftop bar on Sunday 17th November. I arrived with a friend and had two drinks each on the terrace which was great, we had booked a table for lunch for 2pm. The cocktails were great, but the waiter was slow in taking our order. The service wasn’t at all attentive, and was not up to the standard of somewhere charging the prices they do. In the restaurant, we had to call over twice to order our food from a waiter.   I mistakenly spilled some of the bottle of red wine we had ordered on the table (I knocked my water glass against it – an accident). A member of staff came over and offered to get us two glasses of the wine – we had assumed this would have been on the house. When we asked for the bill (which was approx £200) we noticed the two glasses of wine were on the bill, we queried this with the waiter who checked with a manager and were abruptly told we were to be charged for the wine.  We paid our bill in full – but took off the optional service charge because of this and the general bad service. I normally would have complained in person, but as I was on a date I didn’t want to get into it yesterday. I emailed this to The Boundary on Monday - and didn't get a response. Bad service like this really lets the place down, and clearly by not even responding to my email, management here don't care.", "date_of_review": "20 November 2019"}
{"review_id": 29, "restaurant_id": -8, "username": "kims386", "date_of_visit": " September 2019", "rating": "3", "title": "Could of been 4 ", "comment": "Visited for my friends birthday. Beautiful place and was looking forward to the seafood... which was sold out. This was just one thing of a long list that wasn’t available on a already small menu. Gutted. Ordered chorizo and octopus skewers. After trying my friends calamari to start I was excited because the calamari was good! Unfortunately the octopus was so small I couldn’t really taste it. Then.... we all ordered the apple dessert to be told a few minutes later they had none. Having a really small dessert menu left me not really liking the other choices so was left disappointed. The service was good but I believe if I had of had the meal I wanted it would been higher. But travelling all the way to London to go here I was left very let down. ", "date_of_review": "18 September 2019"}
{"review_id": 30, "restaurant_id": -8, "username": "Alastair G", "date_of_visit": " July 2019", "rating": "5", "title": "Fab times....", "comment": "Great place and great staff. Thanks Iman for looking after us so well! Thanks for also re locating us and outside when the sun came out! Alastair", "date_of_review": "27 July 2019"}
{"review_id": 31, "restaurant_id": -8, "username": "AL2986", "date_of_visit": " June 2019", "rating": "1", "title": "Rude Manager with some anger issues! Avoid this place.", "comment": "Avoid this place! The manager has some anger issues. An honest mistake of calling him to order starters, to which he responded \"Do I look like a f***ing waiter to you?\" (Great job of undermining job of your own team!). When we showed our annoyance and questioned his aggressive and rude behaviour, he asked us to leave the place and says \"Aggressive means different to him\" while clenching his fist, to that we replied “are you f***ing crazy?”, this was the only time we acted outside respectable language and we decided to end the conversation as he again acts disrespectfully by telling the bouncer “dump them out”. Not going to this place ever again and surprise to see such behaviour. I guess they have forgot that they are in a hospitality industry and not hostility.", "date_of_review": "14 July 2019"}
{"review_id": 32, "restaurant_id": -8, "username": "oliviacha24", "date_of_visit": " August 2019", "rating": "5", "title": "Perfect spot for a birthday meal", "comment": "Had a great evening celebrating my 21st in the Orangery. The food was a selection of sharing platters and seasonal. Great sunset views and atmosphere while service was friendly. Made for a very enjoyable celebration. Thank you!", "date_of_review": "24 November 2019"}
{"review_id": 33, "restaurant_id": -8, "username": "Suziwoozy25", "date_of_visit": " July 2019", "rating": "1", "title": "Rude staff", "comment": "I visited this restaurant and rooftop bar for my sons birthday and all I can say is don’t bother ! The food was very average to say the least and my daughter didn’t even receive a meal although they very kindly said the would remove it from the bill big deal ! but no other compensation or apology was given just that the waitress had forgotten .We then moved outside and some others friends arrived I then had the unique experience of being shouted at by an extremely rude and officious young man as I stood up to greet them .He yelled across the table that no one was allowed to stand on the terrace and I must sit down ,which I had intended to do anyway without his unpleasant remarks .This was a family occasion for a special birthday but unfortunately the whole experience left me feeling extremely disappointed and I honestly wish we had never booked it .", "date_of_review": "20 July 2019"}
{"review_id": 34, "restaurant_id": -8, "username": "Charlielgim", "date_of_visit": " July 2019", "rating": "5", "title": "Cristal", "comment": "We came as a group of 4, we had a fantastic afternoon on the amazing roof terrace. We got looked after by Iman who couldn’t have done any more for us. Loved the cote be boeuf and he advised us on some great wine. Loved it", "date_of_review": "26 July 2019"}
{"review_id": 35, "restaurant_id": -8, "username": "665diegos", "date_of_visit": " August 2019", "rating": "3", "title": "Nice view but service could be better", "comment": "Nice view and nice location too. The wine list as the menu are average price so that’s ok but the waitress (nice girl) couldn’t open the bottle as the bottle opener was damaged and even worst they wanted to serve us wine inside ridiculous glasses you can’t even find inside a bloody pub: need to improve on that!!!!! Despite this the location just looks great and there another very rare pro: as you go to the loo you have a hand cream and as well a very fancy hand soap with salty minerals inside do deep clean your hands. The thing is that you can see a huge effort but the place gets lost on the basis. You can definitely improve guys. Let’s go, you can make it!!!!!", "date_of_review": "6 August 2019"}
{"review_id": 36, "restaurant_id": -8, "username": "Kwhite661", "date_of_visit": " February 2020", "rating": "5", "title": "Best Saturday night!", "comment": "Umbrellas, heaters and blankets to keep you warm & dry outside. Tasty drinks and excellent service from the waiter. Love the rooftop!", "date_of_review": "16 February 2020"}
{"review_id": 37, "restaurant_id": -8, "username": "lulusailorgirl", "date_of_visit": " September 2019", "rating": "5", "title": "Perfect to catch the last rays of the summer", "comment": "Wonderful relaxed setting with comfortable seating and views of Shoreditch and the city. We had tea and deserts which were beautifully executed and full of flavour. The price tag is higher and worth the experience. Definitely worth booking fir lunch and dinner.", "date_of_review": "3 September 2019"}
{"review_id": 38, "restaurant_id": -8, "username": "983rachelv", "date_of_visit": " September 2019", "rating": "5", "title": "Great views! Great atmosphere !", "comment": "This is our third time at the rooftop bar, the views are great and the drinks reasonably priced. The atmosphere is very laid back with nice background music, the staff were very good. Bianca on the reservation desk downstairs couldn’t have been more helpful and accommodating, big thanks to her for being smiley energetic and friendly. ", "date_of_review": "1 September 2019"}
{"review_id": 39, "restaurant_id": -8, "username": "622pk1", "date_of_visit": " September 2019", "rating": "1", "title": "Mouse in the bar", "comment": "Arrived for drinks and maybe dinner, was seated on the rooftop. Second drink in and spot a mouse running around the rooftop bar. Decided not to stay for dinner (!!) and left promptly. No acknowledgement from staff that this was odd, no discount offered. Really not great at a cocktail bar - won’t be back in a hurry!", "date_of_review": "18 September 2019"}
{"review_id": 40, "restaurant_id": -8, "username": "816kayleighr", "date_of_visit": " September 2018", "rating": "4", "title": "Unique", "comment": "On a warm evening, it’s delightful. They have blankets for when it gets chilly and a good drinks menu. A lovely place to while away a few hours.", "date_of_review": "9 August 2019"}
{"review_id": 41, "restaurant_id": -8, "username": "Cohkarek", "date_of_visit": " July 2019", "rating": "4", "title": "Excellent rooftop restauarant with superb seafood", "comment": "The food was great , the atmosphere was a bit noisy with all that funky music being boomed out early evening but this was a great place for seafood and a view of contemporary Shoreditch", "date_of_review": "2 July 2019"}
{"review_id": 42, "restaurant_id": -8, "username": "Footprints590493", "date_of_visit": " May 2019", "rating": "5", "title": "Fantastic Saturday Evening With Friends", "comment": "We returned to Boundary on a Saturday eve for dinner and drinks, and although it was a bit windy, we couldn't actually feel the cold as they have heathers and blankets. Gabriel, who seemed to be in charge, looked after ourselves; the staff was very polite and their food and drinks were top of the class. Will definitely be returning! ", "date_of_review": "12 May 2019"}
{"review_id": 43, "restaurant_id": -8, "username": "MrMMrsK", "date_of_visit": " May 2019", "rating": "4", "title": "Started off well !....... ", "comment": "A lovely bar with cool tunes , however ....  Get there early , book a table , and be very prepared to share any small amount of space you may think you have to yourself.  The operation is ran with military precision by a team of staff who seize on any opportunity to squeeze more people in.  The food is lovely, the oysters were superb, however the fact you are squeezed in really does ruin any experience you may well have had here.  In addition if you are a non smoker not the best place as you are so tightly packed in chances you will be near smokers ! Having said that we would return. ", "date_of_review": "27 May 2019"}
{"review_id": 44, "restaurant_id": -8, "username": "Melisa00986w6", "date_of_visit": " May 2019", "rating": "1", "title": "Horrendous service - Arrogant staff", "comment": "Recently booked a table for my sisters 28th birthday. No one acknowledge us from the get go, and when they did they were rude. Almost every waitress spoke to us terribly. I wanted to discreetly ask for a birthday cake to come out, and the waitress was blunt and lacked any enthusiasm, made me repeat myself to the point of ruining the surprise of the cake as my sister had enough time to leave and come back to see everything, but nothing was seriously done, and the cake wasnt even taken it was a complete embarrassment. Then i was abruptly told i would have to pay a 20 pound fee (for the cake that i paid for and bought with me) just to be brought out - on top of the surprise being ruined even though they knew that the booking was for a birthday they had no intention of helping at all. Staff were so unprofessional and acted as if they weren't working but were casually walking around joking with one another while we were constantly waiting to be seen to. On top of having a birthday meal ruined, they were unapologetic and disgustingly impolite. It got so bad that we didnt even order food. We paid for our drinks and left. I seriously wouldnt bother spending any money here, especially as the prices arent exactly the cheapest. Definitely dont go for a special occasion!!!", "date_of_review": "14 May 2019"}
{"review_id": 45, "restaurant_id": -8, "username": "Belinda S", "date_of_visit": " June 2019", "rating": "5", "title": "A special place with sumptuous food and superb service in the sunshine", "comment": "How do I do justice to this wonderful rooftop venue? Let me first sing the praises of Emmanuel and Iman who were our champions - from the moment we arrived for lunch in the restaurant and throughout the relaxing afternoon on the rooftop sofas, they guided us through the menu, encouraged us to try the Italicus based Sassy Bergamotto cocktail, which is not only sublime, but quite honestly summer sunshine in a glass - and they were on hand to meet all our needs! We were initially a group of 3 and enjoyed the octopus & chorizo skewers and the plateau de fruits de mer. After lunch we took up a relaxing prime position on a sofa on the roof top, where we we were shaded by one of the olive trees and surrounded by pots of herbs used in the cocktails. Joined by a further 2 family members we then spent the rest of the afternoon sipping cocktails in a wonderfully sunny and vibrant atmosphere. I would have happily stayed and had dinner, but I had to go to the airport for my flight! ", "date_of_review": "3 June 2019"}
{"review_id": 46, "restaurant_id": -8, "username": "nadiacarmel", "date_of_visit": " May 2019", "rating": "1", "title": "Rude and entitled staff member", "comment": "A friend and I had been in the Shoreditch area and walked into Boundary with the hopes of being seated in the rooftop bar. We were kindly advised by the friendly desk staff that there was a wait and we would be placed on a waiting list, with a text sent once seating was available. We ended up getting the text quite soon on and proceeded to the rooftop. We were graciously welcomed and seated at an available spot. We expressed to one of the hosts that the spot we were at was hot due to the electric heaters and whether we were able to be seated elsewhere; which was not an issue. The problem began when a staff member of the name Bianca got involved and claimed that we were not able to be seated as we had moved 3 times, which was false as we’d only just arrived. She became very unreasonable and rude, not accepting any kind of explanation, where her colleague was happy to seat us elsewhere. Her attitude was disgusting and not the kind of service we are use to from previous visits. There was no excuse for her behaviour which in the end resulted in us leaving with no desire to coming back. We explained the situation once we left to the desk staff, to which we were told she was under it due to a colleague being unwell and her having to juggle a lot. That is no excuse and I will not accept that as being an opportunity to being rude to guests. Very distasteful attitude and most likely will not be coming back particularly if the likes of staff members such as Bianca. You risk losing valuable visitors if attitudes do not change. ", "date_of_review": "24 May 2019"}
{"review_id": 47, "restaurant_id": -8, "username": "Jo P", "date_of_visit": " June 2019", "rating": "2", "title": "Poor service, bad attitude", "comment": "Visited with a group for a friend’s birthday - felt like we were at school. Constantly told to sit down and despite saying children were welcome in the email, we were repeatedly hounded by the staff to remind us that children needed to leave by 5. Service was slow, rude with an air of arrogance and drinks were overpriced. A nice location but let down by the rude, inflexible staff. Table service only and a large number of our party spent a long time waiting for drinks and yet an extortionate service charge added to the bill at the end. Would not return.", "date_of_review": "8 June 2019"}
{"review_id": 48, "restaurant_id": -8, "username": "Bezzieburger", "date_of_visit": " June 2019", "rating": "5", "title": "Wonderful mean on the hottest day of the year", "comment": "I was slightly concerned about having booked this restaurant due to some of the mixed reviews . However, a family group of 7 of us were there on Saturday, the hottest day of the year. All the staff were lovely and very professional and the food was superb. We would visit again without hesitation.", "date_of_review": "1 July 2019"}
{"review_id": 49, "restaurant_id": -8, "username": "Jessica L", "date_of_visit": " June 2019", "rating": "1", "title": "Shocking service", "comment": "The bar itself is lovely and has great views over London.  However my friends and I had a terrible experience here last night. We had to ask over and over again to be served, as were being completely ignored by the bar staff. It took us 30 minutes to order our first drink. Despite only ordering a bottle of wine, this then didn't arrive for another half an hour, and this pattern continued all evening with us increasingly being ignored. When I got up to inquire about a lime and soda which had been forgotten in our order, when the waitress came over she accused me of lying and already drinking my drink, when she saw the empty glass from my only other order that evening! Also to charge £4.50 for a lime and soda is completely ridiculous. Unfortunately our evening was ruined by the rudeness of the service.", "date_of_review": "7 June 2019"}
{"review_id": 50, "restaurant_id": -8, "username": "Andre_90_M", "date_of_visit": " May 2019", "rating": "5", "title": "Perfect dinner with my family ", "comment": "I had a gorgeous evening with an awesome sunset, good food and drinks. My family was very excited about this place and about that friendly staff.  I tried the seafood plateau, very fresh and big! Very good beef, cooked perfectly.  One of my cousins ​​ordered a cocktail that was not on the menu, he was surprised how well the bartender made this cocktail. All the cocktails that we ordered very tasty (old Nichol Kanu and Serendipity are perfect), I recommend this bar / restaurant if you want to go out with your family or your friends, this is the place to be: positive energy, stunning view, very clean restaurant, tasty food and great drinks!!!", "date_of_review": "28 May 2019"}
{"review_id": 51, "restaurant_id": -8, "username": "DANIELdrakes", "date_of_visit": " February 2019", "rating": "5", "title": "Great service great cocktails great food !", "comment": "We arrived early to the rooftop to secure a table knowing that it gets busy and you can end up waiting a long time for a table. what else can you expect when it is such a beautiful place. We were looked after by Andrea who was just a delight and couldn't be more accommodating we had food on terrace some bread olives and amazing calamari and one would say to many cocktails . I thought the our bill was very good especially because you are paying for quality the 12.5% serivce charge was more than fair as it does go the staff and we happily paid it and left extra for andrea. all in all a great visit and would highly recommend to all.", "date_of_review": "21 February 2019"}
{"review_id": 52, "restaurant_id": -8, "username": "laura_russell", "date_of_visit": " March 2019", "rating": "2", "title": "Great view but hugely overpriced food", "comment": "I went here for dinner with 4 girlfriends on a Saturday night. The place is very lovely with a great terrace, nice view and pretty fairy lights. It was also very busy and atmospheric. However, the next time I come here I will not be eating. The menu is horrendously overpriced and with not a lot of choice.  We all ordered the Robata king prawns (£21) and when they arrived we each received a TINY bowl with roughly 7 prawns with a bit of sauce. Luckily we had ordered a couple of sides but these we also very expensive. I never normally complain but I was so shocked by the tiny portions that I mentioned this to the waitress and told her were we all hugely disappointed. I had expected that perhaps we'd be given a gesture of goodwill to make up for this but we received nothing. The food also took a very long time to come to the table, I know it was busy but no attempt was made to apologise for the delay.  Overall I would go back but purely for drinks and not the ridiculously overpriced and average food.", "date_of_review": "4 April 2019"}
{"review_id": 53, "restaurant_id": -8, "username": "AlexandraCsomos90", "date_of_visit": " April 2019", "rating": "5", "title": "Amazing!!", "comment": "With an impressive menu, spectacular views and an exclusive atmosphere, it’s not hard to see why Boundary Rooftop is considered the best rooftop bar in London .  All the staff it’s very friendly and will go extra mile to make sure you are happy.", "date_of_review": "5 April 2019"}
{"review_id": 54, "restaurant_id": -8, "username": "Bing1990", "date_of_visit": " April 2019", "rating": "1", "title": "Terrible. Not worth it at all.", "comment": "We had a terrible dinner experience here and sadly I can’t really say anything positive. When we arrived we were shown to a table along with another party which meant there was lots of confusion about where we were sitting. We were left standing in the restaurant between tables wondering where we should sit. We then just decided to choose a table ourselves as the staff didn’t seemed bothered to show us. This was our first put off. Then whilst we were enjoying our drink the staff were sat at one of the restaurant tables having there hair played with by another staff member. I have never observed such unusual and rude behaviour from staff in a restaurant. At this point we were ready to leave but then we thought let’s give them the benefit of the doubt and see what the food is like. Sadly it was awful! We ordered a Cote de Boeuf to share with a side of grilled vegetables. The piece of meat which apparently was to share was tiny and really a portion for one, most of it was also fat! We had about 5 mouthfuls each before it was gone. For £30 per person this is certainly not enough food nor was it at a standard and quality it should have been. The grilled vegetables were awful too, they were over cooked, cold and in a small pudding bowl. We sent these back as they looked pretty horrible, I wouldn’t serve them myself to guests at home. The staff ordered us something else, chips! The chips were also disgusting. Mac Donald’s chips are better! We complained about the food and the portion sizes and the manager (after he was finished having his hair done) kindly gave us a drink on the house and a cheese plate (which was average and the crackers were from a Jacobs sharing box!). Our waitress was very pleasant but just didn’t seem to enjoy working there- I don’t blame her.  All in all the food is terrible, not cheap, and uninterested staff. The views are all it has going for it. Sadly what could be a great venue and restaurant in one of the best cities in the world, was shameful and somewhere we will never go again. ", "date_of_review": "27 April 2019"}
{"review_id": 55, "restaurant_id": -8, "username": "Gabor V", "date_of_visit": " March 2019", "rating": "5", "title": "Fantastic Atmospher, Friendly staff", "comment": "A hidden garden with a great atmosphere. We would like to say extra thanks for the staff to make our day really enjoyable and relaxing and thanks for the Chef's for the tasty food.", "date_of_review": "4 April 2019"}
{"review_id": 56, "restaurant_id": -8, "username": "BeckyJo1", "date_of_visit": " February 2019", "rating": "2", "title": "I’d expect more", "comment": "The wait staff seemed very friendly and helpful but were instructed by their manager to ask us to move after we had been seated. The manager on shift then proceeded to patronise us when discussing the menu, telling us that if there was anything we “didn’t understand” he would be more than happy to “explain” it to us. Not only was this incredibly rude, it was also inconsistent with what was said to other customers that evening. Our whole evening seemed to be rushed by the manager, who was not helping his customers as much as he was having a non work related conversation with the head chef. As I said before, the wait staff seemed very pleasant and my only real feedback for them is that, when people are paying over £100 a head, please offer to take their coats. Saying that, most of our queries (made to multiple employees) were answered with “I’ll check for you” and I’m guessing they are not allowed to take any initiative in their role, maybe that should be reviewed.", "date_of_review": "2 April 2019"}
{"review_id": 57, "restaurant_id": -8, "username": "reviews_all_around", "date_of_visit": " April 2019", "rating": "4", "title": "Perfect for a sunny day in Shoreditch", "comment": "It’s not the first time that we came at Boundary and every time we are happy with the experience. Yes, i agree that pricing is a bit steep and definitely compared with other places in shoreditch but, at the same time is one of the few places where you can enjoy a nice drink during a sunny day in this side of London. I think it worth to try it but, if you go there thinking to eat and drink without spending a lot, you will definitely be disappointed. All in all, i consider it one of my favourite rooftop in east london. Just as advice, if planning to go there always try to book before because otherwise you might end up spending lot of time in the queue.", "date_of_review": "27 April 2019"}
{"review_id": 58, "restaurant_id": -8, "username": "DANIELdrakes", "date_of_visit": " April 2019", "rating": "5", "title": "New menu !!!", "comment": "Came in to london and had to visit again to find they had changed the menu ! They did not disappoint everything from the door table and exit was just perfect the staff clearly enjoy working at such a incredible venue thanks again boundary see you soon.", "date_of_review": "27 April 2019"}
{"review_id": 59, "restaurant_id": -8, "username": "Soniadcd", "date_of_visit": " August 2018", "rating": "5", "title": "I love this place", "comment": "EXCEPTIONAL FOOD AND COCKTAILS!!Lovely and efficient staff. So good that I came back again and ordered my favourite dish Duck Confit. This is the best place to enjoy the summer. Highly recommend this place. Thank you.", "date_of_review": "27 August 2018"}
{"review_id": 60, "restaurant_id": -8, "username": "anacpap", "date_of_visit": " May 2018", "rating": "4", "title": "Good to impress!", "comment": "It has been several times now that I have visited Boundary Rooftop - not just visits with friends but also for big business dinners. I am very satisfied from the food, service, and location. If you are in Shoreditch looking for something different then by all means give it a try and you will not regret the nice views.", "date_of_review": "25 August 2018"}
{"review_id": 61, "restaurant_id": -8, "username": "Gail657", "date_of_visit": " October 2018", "rating": "4", "title": "Great views and Nice Cocktails", "comment": "A little hard to find , as Hotel not obvious , but Rooftop Bar has a large outdoor area and pleasant interior too . Cocktails nice", "date_of_review": "11 November 2018"}
{"review_id": 62, "restaurant_id": -8, "username": "Meander570618", "date_of_visit": " March 2019", "rating": "3", "title": "Good cocktails, not sure about the food!", "comment": "So had seen this bar in time out, so when my friend works in the area it made sense to check it out. My friend booked it ( so even if your going for drinks you have to book it). It was a nice evening and they was going to originally put us inside but we insisted on sitting outside which the staff was accommodating. We had cocktails that were good but pricey.  We then wanted food to soak up the cocktails, my friend is vegetarian and the options for her was limited but she chose the cheese with tomatoes. She didn’t like it at all and did not eat it. I ordered the pouson (baby chicken), I sent it back coz it looked pink inside. The staff and manager tried to assure me that it’s cooked coz they steam it but for my personal taste my chicken has to not be pink. The staff was happy to cook it further on the grill and after that and it was then better for my taste. The staff are nice too. I would go back again for the nice drinks and staff only.", "date_of_review": "16 April 2019"}
{"review_id": 63, "restaurant_id": -8, "username": "mamine88", "date_of_visit": " December 2018", "rating": "5", "title": "Thanks to the Greek manager on duty", "comment": "It wasn't the first time  But as always we had a great time. Thanks to the whole staff especially Alex the manager for his recommendations and professionalism. We'll be back for sure", "date_of_review": "17 December 2018"}
{"review_id": 64, "restaurant_id": -8, "username": "krittn", "date_of_visit": " November 2018", "rating": "4", "title": "Exceptional rooftop bar & terrace perfect for summer AND winter!", "comment": "I challenge you to find anyone who doesn't like a rooftop bar. When it's in Shoreditch, you know it's going to be popular with those in the know.  This alfresco retreat is perched about a boutique hotel and a restaurant. This means you get impressive views of the City, especially when night falls.  Naturally, this little oasis is perfect for the warm summer months. But did you now that it's just as good in the winter? You can lounge about on wicker chairs surrounded by shrubbery, blankets, heaters and a wood-burning fire to keep you warm. Keep the Boundary rooftop terrace in mind next time you're looking for drinks with your chums. It's a bit of a hidden gem that deserves your attention.", "date_of_review": "29 November 2018"}
{"review_id": 65, "restaurant_id": -8, "username": "deniceschagen1", "date_of_visit": " January 2019", "rating": "2", "title": "Food tasted good, very overpriced", "comment": "The food tasted good, however, very overpriced for the portion you get. A day after the bill we received a present from the restaurant saying we didn’t attent the booking, putting us on the black list of no-shows. The day after they appologized. ", "date_of_review": "1 January 2019"}
{"review_id": 66, "restaurant_id": -8, "username": "321liviab", "date_of_visit": " April 2019", "rating": "5", "title": "Fantastic experience with friends", "comment": "We had a great Friday night. Food was very delicious, great atmosphere. We will come back again and I will recommend it to friends and family.", "date_of_review": "27 April 2019"}
{"review_id": 67, "restaurant_id": -8, "username": "scotieee", "date_of_visit": " February 2019", "rating": "5", "title": "Beautiful all round", "comment": "We booked for valentines day and was not disappointed the rooftop had been decorated beautifully with roses and petals scattered everywhere the atmosphere was so good and the staff really adhered to our every need giving us privacy but also being there exactly when we needed them the food was amazing we both tried the oysters for the first time and were both pleasantly surprised how amazing they were. we were taken down to the vault for canapes and champagne before our dinner and very much look forward to visiting there on another day to.", "date_of_review": "21 February 2019"}
{"review_id": 68, "restaurant_id": -8, "username": "LordN_12", "date_of_visit": " February 2019", "rating": "3", "title": "Great setting, OK food and average service", "comment": "Location is great and the rooftop is a lovely setting. The food was ok but it was far too expensive for what it was. Definitely a case of paying for the location and the surroundings. The service was also a little slow and the chap running the bar outside was rude and a little self important. They were more friendly in the restaurant but still slow. Fun place to go as a group but accept you will be paying over the odds.", "date_of_review": "18 February 2019"}
{"review_id": 69, "restaurant_id": -8, "username": "BiancaRennie55", "date_of_visit": " January 2019", "rating": "1", "title": "Bad food poisoning", "comment": "I’m normally not one to do this but I’m in so much pain and now having to take time off work because I’ve contracted food poisoning from this establishment. I know it’s from When I ate at the boundary on the 30th dec because my friend, who ate with me and shared the oysters and mussels is feeling the same and it’s the only thing we ate together that day. Contaminated food, making someone sick in this day and age is horrendous but when you’re paying higher prices you never expect this. I’ll be making sure I leave this review on your Facebook page also what makes matters worse was the added a service charge of nearly £20 into the bill, which I appreciate is standard for London restaurants but considering the service wasn’t anything special I asked for it to be taken off. Much to the dismay of the waitress. It’s disgressionary for a reason. I’d never return. Might save me a trip to the doctors!", "date_of_review": "2 January 2019"}
{"review_id": 70, "restaurant_id": -8, "username": "ClaireH1397", "date_of_visit": " February 2019", "rating": "2", "title": "Drinks only", "comment": "This place came highly recommended, I was very disappointed came here for my 40th birthday was sent downstairs as the roof terrace was full, staff downstairs were disorganised and rude however they looked professional, we were just about to leave when we were told we could go up stairs the setting is breathtakingly stunning however the staff were rude, slow and uninterested they charged £9 for a splash of lemonade (in a white wine spritzer) and our total for 2 of the worse tasting house wines I’ve ever had was £26 it was undrinkable, the waitress also failed to bring my change, I understand people paying by cash is rare in Shoreditch however that doesn’t give the waitress the right to pocket my change!! Such a shame as the setting is bliss however the staff, service and drinks were vile would never go again nor would I recommend", "date_of_review": "20 February 2019"}
{"review_id": 71, "restaurant_id": -8, "username": "markrQ8762EP", "date_of_visit": " August 2018", "rating": "2", "title": "Lovely place but a little expensive", "comment": "I felt a bit ripped off to be honest although I am sure that they excuse the cost with a \"it's London and a rooftop\". The London bit is a little iffy, it's Shoreditch and despite the volumes of people saying it's trendy, it is still a dump compared with... Well most places in the country really. The Boundary Project is very nice, I stayed in the hotel and it is quite cool . The food was expensive, I ordered chicken kebabs with Tsatsiki and it was \"minimalist\" if you get what I mean. It was nice, but not special. It was all a bit pricey. Chicken kebab, a small portion of chips and a bottle of wine for £55...not good. The only thing that saves it is the rooftop experience, a wonderful summers evening. The resteraunt didn't have much influence on the weather though. Walk 400 yards or so and go to Brick Lane.", "date_of_review": "1 August 2018"}
{"review_id": 72, "restaurant_id": -8, "username": "Tour794828", "date_of_visit": " August 2018", "rating": "5", "title": "Amazing vibe ", "comment": "I've been yesterday evening at Boundary. We spent a great time there. They are doing all the classic cocktails and they have amazing signature cocktails. Deffinetly reccomend this place.", "date_of_review": "2 August 2018"}
{"review_id": 73, "restaurant_id": -8, "username": "Bukes", "date_of_visit": " May 2018", "rating": "3", "title": "Nice rooftop but a bit overrated!", "comment": "Went there with a friend for cocktails and food. Impressed that we managed to turn up and they had a table free. Ordered a cocktail pitcher of pimms which was not very good, then tried to order a single cocktail and asked for drinks with no ice as we noticed some pitchers were half full of ice. We're told that all the drinks came with ice. Not good value for the price paid. Had the steak which was ok but have had better. The views were okay but nothing special. It was quite windy and nice that they gave us blankets to wrap around us. Would not go back for the prices they charge which is a shame as it is a nice setting in the summer!", "date_of_review": "22 July 2018"}
{"review_id": 74, "restaurant_id": -8, "username": "simon42470", "date_of_visit": " August 2018", "rating": "5", "title": "Amazing place!", "comment": "We decided to go for a stroll in Shoreditch and walking on the streets we did see a quite a few people down on the entrance waiting. we decided to go and see what is all about and we found out that they are waiting to go up on the Roof Nd that they have a nice terrace up there. Chatting between us we decided to stay and try it. In my mind we did say that it cant be that popular having people waiting on the street for a table upstairs. Finally we arrive on the Roof and what I can say is that was one the best Rooftop seen in London and one of the best experience to go out. They have a beautiful terrace, good food, amazing vibe and a good crowd is going in there.", "date_of_review": "2 August 2018"}
{"review_id": 75, "restaurant_id": -8, "username": "evelyntoma", "date_of_visit": " August 2018", "rating": "5", "title": "Wonderful cocktails", "comment": "Wonderful little gem, this place is heaven, a secret rooftop terrace with gorgeous decor & great cocktails.The staff are effortlessly attentive & made our evening really special. I really recommend this place.", "date_of_review": "2 August 2018"}
{"review_id": 76, "restaurant_id": -8, "username": "Urtė M", "date_of_visit": " August 2018", "rating": "5", "title": "Amazing experience", "comment": "Great view, cocktails and food. Friendly staff, relaxing atmosphere and music! Definitely coming back soon.", "date_of_review": "9 August 2018"}
{"review_id": 77, "restaurant_id": -8, "username": "malimo", "date_of_visit": " August 2018", "rating": "1", "title": "Totally Flawed", "comment": "Over-priced roof deck with poor food & cocktails served by minimum wage Eastern Europeans with poor language skills (not their fault) Peroni (yes Peroni!) the only beer Only thing it’s got is a view Why can’t a good venue get it right?!", "date_of_review": "5 August 2018"}
{"review_id": 78, "restaurant_id": -8, "username": "wittyone13", "date_of_visit": " August 2018", "rating": "1", "title": "Do not go! So rude! ", "comment": "If you are looking for a place for a quiet drink on a roof terrace before a nice dinner and pleasant service - then you should have come here last year or build a time machine. What was a beautiful gem of a place in London where customer service met exquisite views and reasonably priced but quality food has morphed into something else entirely. Now your quiet drink on the terrace has been replaced with a ‘we don’t have any space (shrug)’. When questioned about the good old times where a reservation in the restaurant meant a perfect service and quiet drink before dinner on the terrace, it was met with ‘there is nothing we can do’.  So if you want overpriced food with a half glimpse of a view of a terrace with a side order of rudeness from a clearly under qualified ‘general manager’ with no social skills and clearly no experience of running a decent restaurant that provides not just food but a service that makes the experience worthwhile... then this is your place.  My advice - build a time machine and go back here when it was run by skilled and competent staff, or avoid at all costs.  Sad but another quality location ruined by poor customer service... I will not be returning. ", "date_of_review": "8 August 2018"}
{"review_id": 79, "restaurant_id": -8, "username": "gabeszdt", "date_of_visit": " August 2018", "rating": "5", "title": "Ahidden treasure", "comment": "A few days ago I celebrated my birthday with my friends in Boundary Rooftop. The Restaurant has a fantastic view, tasty food, fancy cocktails. Iwold like to say many thanks for the staff They made my day gorgeous. I strongly can recoment this place to anyone.", "date_of_review": "10 August 2018"}
{"review_id": 80, "restaurant_id": -8, "username": "M798DBkellyf", "date_of_visit": " July 2018", "rating": "2", "title": "Disappointed ", "comment": "You are paying for the view , it’s evident from the minute you arrive. Service was average to poor as was the food. Shame as it didn’t feel to be busy but they are charging a premium for basic food. There are better places to go with a view in London and better quality food ", "date_of_review": "12 August 2018"}
{"review_id": 81, "restaurant_id": -8, "username": "Steffan D", "date_of_visit": " June 2018", "rating": "1", "title": "Big room for customer experience improvement", "comment": "It could be so good. But with a cooler-than-thou greeting, greasy tables, expensive menu, and a loud 'city' crowd it ends up quite unsatisfactory. There's a rude woman with an iPad 'checking you in' before you're allowed up to the terrace, I felt 12 and back in school when she chided me for heading for the lift without talking to her! Awkward start. When you've past customs control and reached the terrace it's nice enough and the food is ok. The underside of the dining tables are greasy and dirty, so if your knees touch there you'll have dirty trousers for the rest of your night. Waited ages to pay our bill. I suppose you pay for the terrace and view, but for easily better service and a wider range of food go elsewhere in Shoreditch. Would not head back to Boundary in a hurry.", "date_of_review": "21 June 2018"}
{"review_id": 82, "restaurant_id": -8, "username": "venettas", "date_of_visit": " June 2018", "rating": "5", "title": "Beautiful hidden gem", "comment": "What a lovely rooftop bar to sit in an while away a few hours in! Great views across all of london on a clear day. Certainly put us in a good mood! We visited on a sunny day at the weekend for early lunchtime cocktails. The bar was busy and had a good vibe... it feels quite exclusive, (and also a little bit difficult to find - my tip is to look up and try to spot the greenery!)  We ordered pitchers of cocktails rather than individual ones to stretch the budget a bit further, and ordered some almonds, olives and breads. The cocktails were lovely, as expected. The snacks were probably a bit overpriced, the breads were a little on the dry side and would have benefited from some olive oil or other dip.  I would definitely go again for drinks. ", "date_of_review": "18 June 2018"}
{"review_id": 83, "restaurant_id": -8, "username": "erikaLyg", "date_of_visit": " June 2018", "rating": "1", "title": "Not worth it", "comment": "We were initially told on the phone that no booking policy exists and it's first come first serve.  We arrived around 16:30 Friday afternoon and had to wait for more than half hour outside without even being allowed to see the rooftop as it was full.  We were then offered to wait at the underground bar/restaurant having a drink until a table empties. We later discovered that there was more than enough room on the rooftop with 3-4 empty tables while having waited for an hour and a half already. We asked to be transferred to the top floor and were told in a very rude and unwelcoming way that the bar is still full and the empty tables were booked despite the non-booking policy.  It was only when we asked to speak with the manager that 2 tables magically were available (coincidentally we were 2nd on the waiting list). Arriving on the top floor we found more than 5 empty tables and were given the opportunity to choose amongst all of them as none were booked after all.  Both the food and the drinks were mediocre and overpriced and considering the hassle we obviously refused to pay the 12.5% charged on our bill as discretionary tip. My recommendation to the manager would be to teach their staff and especially the hostess at the door to not lie to a customer's face and treat them in a more professional way. Not recommending it.", "date_of_review": "22 June 2018"}
{"review_id": 84, "restaurant_id": -8, "username": "Ema2050", "date_of_visit": " June 2018", "rating": "5", "title": "Best Rooftop in east London.", "comment": "I just visit recently the Boundary Rooftop and I must say the place is amazing , good music and the provencale calamari the best I had till now. It is a must to try if you are near by. Can be a wait on the door due to the popularity.", "date_of_review": "28 June 2018"}
{"review_id": 85, "restaurant_id": -8, "username": "Soniadcd", "date_of_visit": " June 2018", "rating": "5", "title": "perfect summer day out", "comment": "During my visit in London we did end up going by chance in Boundary Rooftop. Such a lovely place, the way is designed you feel like you are by the sea on a very cool terrace. The seafood platter which I tried was amazing. They had a thing going with Peroni Ambra.  I tried Ambra and they told me is an aperitf drink made from chinotto fruits . Really good one.", "date_of_review": "28 June 2018"}
{"review_id": 86, "restaurant_id": -8, "username": "Sarah13_mtl", "date_of_visit": " July 2018", "rating": "3", "title": "unhelpful staff and disappointing view", "comment": "Went there with my friends. when we arrived downstairs the person 'greeting' us was very cold and unhelpful. We wanted to get a drink on the terasse before getting dinner at the table we booked. she said it wasn't possible because they were too busy. so we had drinks elsewhere. came back for our dinner. the food was not particularly good and the view disappointing. I wouldn't go back. ", "date_of_review": "2 July 2018"}
{"review_id": 87, "restaurant_id": -8, "username": "Victoriamary5", "date_of_visit": " July 2018", "rating": "1", "title": "Dreadful", "comment": "Had so looked forward to eating here given ,the beautiful weather and the potential for a lovely view. The reality was shocking. The initial greeting from a surly, uninterested blonde girl with earpiece and frown should have been the warning signal. Yet we persisted and waited ( sweltered) in an underground bar before being eventually allowed rooftop. Our table was tin and the chairs plastic. It was grim. Food was mediocre and overpriced. The website is deceptive and all in all a huge disappointment.", "date_of_review": "14 July 2018"}
{"review_id": 88, "restaurant_id": -8, "username": "Grimboo", "date_of_visit": " July 2018", "rating": "1", "title": "Glacial service, uninterested staff, ludicrous pricing. Never again.", "comment": "Went to the rooftop bar & grill for lunch and to watch the RAF 100th birthday flypast. Ground floor entrance is small and gloomy. We were directed in a very lacklustre manner to the lift. Not a great start. Found a decent table and settled down for a pleasant lunchtime treat. Ultimately the only good thing about the experience was the flypast. The menu is ludicrously priced (£19 for a couple of chicken skewers, £39 for a middling white wine). Service was ridiculously slow, their only answer when politely asking when food may arrive was \"its coming, its coming\". It eventually arrived after 75 minutes (bearing also in mind we all only have an hour break from work for lunch) barely warm, no apology. It's not as if they have a complex menu, it's all straightforward stuff.   And then there is the \"discretionary\" 12.5% service charge. Factor that in to your pricing because they will argue against removing it, even when they give appalling service.  To top it all off, 2 out of 3 of our party fell ill within a couple of hours of eating there. A one off visit, never to be repeated. If you're not bothered about the rooftop (and why would you, the view generally isn't that great, its not high enough) there are plenty of better places to go.", "date_of_review": "11 July 2018"}
{"review_id": 89, "restaurant_id": -8, "username": "hippylinda", "date_of_visit": " June 2018", "rating": "4", "title": "Its a roof top with friendly staff but that's about all.", "comment": "Went here early on a Saturday , it was a gorgeous hot day so a roof top sounded a good idea. It had obviously been very busy as they were hurriedly cleaning tables and making things clean when we arrived .We were lucky and got a comfy sofa to sit on . I thought it was all a bit pricey and we decided not to eat there as we thought it was a tad expensive. The drinks were ok and the staff very good but the views -well where we sat there were not any really . Its a different spot to visit in this busy area but its missing something - maybe some gentle live music?", "date_of_review": "1 July 2018"}
{"review_id": 90, "restaurant_id": -8, "username": "H0liday_Rep", "date_of_visit": " May 2018", "rating": "1", "title": "Not worth the price, nor hype.", "comment": "Sadly nothing lived up to our expectations. The customer service was well below par, as was the food. Wait for food ridiculous.  When it finally arrived the haloumi was over cooked, chips were tasteless. This is simple stuff, pretty hard to get wrong. No check back whilst we ate. Well overpriced and 12.5% service still added to our bill, even when the service was dire. Just a joke. Will not return. Only good thing is the rooftop setting.", "date_of_review": "21 July 2018"}
{"review_id": 91, "restaurant_id": -8, "username": "CodyF261", "date_of_visit": " February 2018", "rating": "4", "title": "Great Atmosphere", "comment": "I went here with my girlfriend for our first valentines together and found that it had an amazing atmosphere and great food. The view of London was lovely, an even though it was raining, they had a way to compensate yet still provide a nice atmosphere.", "date_of_review": "3 June 2018"}
{"review_id": 92, "restaurant_id": -8, "username": "Ruby K", "date_of_visit": " February 2018", "rating": "2", "title": "Never left a rooftop bar more sober in my life.", "comment": "We had a table for three booked for a Sunday lunchtime. We arrived early and were told by very rude Front of House that we couldn't sit at one of the many free tables outside as they 'expected to be very busy', even though we were told 'first come first serve' for tables outside. Didn't receive our drinks for about 15 minutes, and when our cocktail pitcher arrived it contained enough for 3 small glasses - VERY poor for £29. Long wait to order food and no drinks offered to have with our food. Food was okay, the setting and the beautiful weather we had were the real saving graces. The covered area we ate in was ridiculously hot and stuffy, so we moved ourselves outside after we finished eating - but yet again, we weren't asked if we wanted to order anymore drinks. Note to the restaurant: we would have spent a lot more at The Boundary Project if the serving staff had been more bothered to keep an eye on us. Unsurprisingly we decided against leaving the 12.5% service charge that was automatically put on our bill. We probably could have walked out without paying and no one would have noticed.", "date_of_review": "3 June 2018"}
{"review_id": 93, "restaurant_id": -8, "username": "Ruby K", "date_of_visit": " June 2018", "rating": "1", "title": "Never left a rooftop bar more sober in my life.", "comment": "We had a table for three booked for a Sunday lunchtime. We arrived early and were told by very rude Front of House that we couldn't sit at one of the many free tables outside as they 'expected to be very busy', even though we were told 'first come first serve' for tables outside. Didn't receive our drinks for about 15 minutes, and when our cocktail pitcher arrived it contained enough for 3 small glasses - VERY poor for £29. Long wait to order food and no drinks offered to have with our food. Food was okay, the setting and the beautiful weather we had were the real saving graces. The covered area we ate in was ridiculously hot and stuffy, so we moved ourselves outside after we finished eating - but yet again, we weren't asked if we wanted to order anymore drinks. Note to the restaurant: we would have spent a lot more at The Boundary Project if the serving staff had been more bothered to keep an eye on us. Unsurprisingly we decided against leaving the 12.5% service charge that was automatically put on our bill. We probably could have walked out without paying and no one would have noticed.", "date_of_review": "3 June 2018"}
{"review_id": 94, "restaurant_id": -8, "username": "Cmonyawns", "date_of_visit": " June 2018", "rating": "3", "title": "OK - ish", "comment": "Visited at the end of a day up the smoke for my better half’s coming of age (plus a few years..). Had to apply for entry at the ‘reception area’ at the downstairs entrance who had to ring and ask if there were room - this was at around 3.30 on a Wednesday afternoon.  We were granted a right of passage and boarded the lift to the roof top, which we expected to be heaving. We were warmly welcomed by (presumably) the head waiter chappie who gestured for us to sit were ever we wish as there was loads of room. Very hot day and cocktails were ordered. They arrived fairly quickly (well there wasn’t that much competition). As a consensus, the cocktails were ok, but nothing to write home about. They were quite expensive for what they were and although we had the option to stay for more, felt that the Met line beckoned and had more promise of delivery. Would I return? Well, given the opportunity, no thanks", "date_of_review": "6 June 2018"}
{"review_id": 95, "restaurant_id": -8, "username": "tomica02", "date_of_visit": " June 2018", "rating": "5", "title": "A MUST VISIT", "comment": "Where to start, this roof top is a hidden treasure. Firstly the buliding is beautiful and the outside seating area is perfect for some nibbles and for amazing summer fresh cocktails.You can try Orange Provence, Perfect storm i love it, verry good. Servce is outstanding - love the fact that all the waiters are very polite and are very easy on the eye! The food is really good i can recommend octopus and chorizo, oysters lobsters very evident they take themselves very seriously, I've visited this roof top three times in the last two years and verytime the menu has evoloved. Well done Boundary Rooftop great job.", "date_of_review": "12 June 2018"}
{"review_id": 96, "restaurant_id": -8, "username": "veragazi", "date_of_visit": " June 2018", "rating": "2", "title": "Nice environment, Dissapponting diiner", "comment": "The oysters were very nice The rest of the dinner was not great. The platter with the dips overpriced Stale focacia. The main dish Bavette with mushrooms and onions was served cold with only one mushroom! When we’ve asked for the dessert, we were informed that the kitchen was closed. Many apologies , discount and a glass of wine did not made us happier.", "date_of_review": "10 June 2018"}
{"review_id": 97, "restaurant_id": -8, "username": "JiniaT", "date_of_visit": " June 2018", "rating": "5", "title": "One of the best Rooftops in London", "comment": "My friends and I came to the rooftop for a few drinks and aperratifes and the level of service and care the staff took towards us was excellent! Such a cute spot for instagraming and relaxind with your friends! I highly recommend it if you're looking for something to do around shoreditch on a sunny day !!!", "date_of_review": "12 June 2018"}
{"review_id": 98, "restaurant_id": -8, "username": "danni m", "date_of_visit": " June 2018", "rating": "1", "title": "Will not return", "comment": "We arrived with no welcome, no hello just 'What is your name?'. Sat down at our table to then wait 15 minutes before we were acknowledged, our table was uneven after asking 3 times for them to sort it it was eventually sorted. Food was basic, extremely overpriced and the staff had an attitude. Will not be returning.", "date_of_review": "11 June 2018"}
{"review_id": 99, "restaurant_id": -8, "username": "John L", "date_of_visit": " May 2018", "rating": "2", "title": "Average at best, very expensive", "comment": "Nice terrace but food and drinks very overpriced and service decidedly average. Limited menu and several items off. Definitely won't be returning.", "date_of_review": "7 May 2018"}
{"review_id": 100, "restaurant_id": -8, "username": "Chocolate_shaf", "date_of_visit": " May 2018", "rating": "3", "title": "Really slow but very friendly service", "comment": "Odd that on entry the hostess ask us to wait outside the front of the building prior to going up? Even though there are chairs inside, she wasn’t particular friendly. Always a great view, and have been here before. It must of taken 15 minutes to try and get a bottle of wine, where we had to walk up and prompt and then a further 30 minutes to try and order. The waitress was very friendly and accommodating. The wine was served in odd glassware which I would place as sophisticated or correct. The food took a life time to arrive but was ok, we had the sea bass and lamb cutlets. We ordered the desert which was actually hilarious because it was a espresso cup with chocolate in it? Hardly the chocolate desert we would expect. I ordered a Irish coffee which never came and a scotch. I would come back again, but I think kitchen service is poor and I think the waiter agreed. Also they need to update their menu, as it hasn’t changed in since last year. ", "date_of_review": "9 May 2018"}
{"review_id": 101, "restaurant_id": -8, "username": "Simiorina", "date_of_visit": " May 2018", "rating": "5", "title": "Must Go!", "comment": "I am a big fan of rooftop but never been to Boundary Rooftop. I was in Shoreditch yesterday so I’ve said “why not!?” as I have had this on my wish list for a wile. I was waiting a bit at the door in order to get a table but definitely worth it. Me and my friend have had a great time. Great service and high quality food. I’ll be back soon!", "date_of_review": "8 May 2018"}
{"review_id": 102, "restaurant_id": -8, "username": "tomiciz", "date_of_visit": " May 2018", "rating": "5", "title": "Superb Rooftop", "comment": "I did visit Boundary Rooftop couple of days ago. I did had the Chicken Skewers and a bottle of Rose. Great weather and really cool music. Rooftop are made to enjoy a good drink and a nice meal Food was fresh and on point.", "date_of_review": "7 May 2018"}
{"review_id": 103, "restaurant_id": -8, "username": "DanielD3342", "date_of_visit": " May 2018", "rating": "5", "title": "Outstanding! ", "comment": "I've been to this beautiful place a couple of days ago as it was recommended of one one of my friends. The food was really, really tasty and the staff was very friendly and charming. Such a great admosphere. Very hard to find this kind of places nowadays. Definitely highly recommend!", "date_of_review": "7 May 2018"}
{"review_id": 104, "restaurant_id": -8, "username": "AsierE61", "date_of_visit": " May 2018", "rating": "1", "title": "Totally disappointed, rude waitress, worst table on the place", "comment": "I booked a table for a date night via their website, we arrived to the place and we were attended by a rude waitress who immediately lead us to a table on the restaurant. We asked her that first we would like to have a drink outside, at this point she rolled her eyes at take us out to the worst table in the venue, she gave us a drink menu and left. We were not happy at all with the attitude neither with a table plus the menu was only for alcoholic drinks. After few minutes thinking we consider to left the place", "date_of_review": "7 May 2018"}
{"review_id": 105, "restaurant_id": -8, "username": "Ari W", "date_of_visit": " May 2018", "rating": "2", "title": "Mediocre food that's overpriced", "comment": "Yes, the space is great; open air, couches and tables etc BUT, the food is crap. We ordered the \"Mediterranean platter\" which was 5 tiny cups of dips with a hunk of bread that tasted like it came out of Tesco. All this for a whopping 18 pounds!! The cheese plate arrived with 3 tiny pieces of burnt toast. Awful The drinks are overpriced too; over 10 pounds for a cocktail and no Happy Hour. This is not a restaurant at all, but a place to hang out. If you're looking for good food, go elsewhere!", "date_of_review": "9 May 2018"}
{"review_id": 106, "restaurant_id": -8, "username": "simon42470", "date_of_visit": " May 2018", "rating": "5", "title": "Lovely place with nice view !", "comment": "We arrived in a sunny day at Boundary Rooftop.  The place was packed and the music was good. We had cocktails and food. Cocktails very tasty £12 one but hey you are on the Roof. Very well maintaned the plants looked gorgeous.  We will return. ", "date_of_review": "14 May 2018"}
{"review_id": 107, "restaurant_id": -8, "username": "962sanaeb", "date_of_visit": " May 2018", "rating": "5", "title": "6 hours of amazing service, food and drinks!", "comment": "Met some friends here over the weekend and absolutely loved the service here, super attentive and quality of food and drinks is really good. Would definitely recommend to sit on the rooftop when the weather is nice in London. ", "date_of_review": "31 May 2018"}
{"review_id": 108, "restaurant_id": -8, "username": "Em S", "date_of_visit": " May 2018", "rating": "1", "title": "Awful", "comment": "After queueing to get up to the rooftop, we were sent down to the basement restaurant bar to wait for a table. We had cocktails there which were so weak, and when flagged up were told \"It's just meant to be the taste, they're supposed to taste fresh\", which makes no sense. I love cocktails and these were really not great The girl on the door came down and walked past us to tell a couple on the next table, who had came after us, that their table on the rooftop was ready. I had to stop her walking past us again and asked if our table was ready as we had been waiting a little longer than the other couple. She told me \"I was told you'd left\", which was bizarre, but that our table was ready  We made our way to the rooftop to find they didn't have a table yet so it was a bit awkward just hovering around. Then when we were seated we were given menus and subsequently roundly ignored. We asked a boy if we could place an order and he said he'd get someone to come over. Nobody appeared so we just left  Not sure what the attitude was here but it was clear we weren't welcome. I wouldn't go back and am telling my friends to avoid", "date_of_review": "11 May 2018"}
{"review_id": 109, "restaurant_id": -8, "username": "Lisa908byrne", "date_of_visit": " June 2018", "rating": "1", "title": "Dissapointing", "comment": "We had lunch at the Boundary yesterday. A lovely vibe and great location but sooo disappointing. It could have so much going for it but it’s like they don’t care about even wanting good reviews or custom. A ridiculous rip off. I don’t mind at all paying good money for good food but this was a joke. The alcohol was extortionate prices and we wanted to order the house rose but they said they didn’t have any left so the next one up started at £55! For Rose - really?? And we ordered 2 shared platters for starters - these were just laughable!! About 6 egg cups half filled with a few dips with a glass of raw veg - just one piece of each kind of veg - in the middle and a bit of bread. Not enough to feed a rabbit!! I don’t understand why they wouldn’t want to try and give good value for money? I can’t see people visiting this place more than the one time. Maybe it’s just a nice place to pop into for ‘one’ drink before going elsewhere for good food! ", "date_of_review": "17 June 2018"}
{"review_id": 110, "restaurant_id": -8, "username": "Rossy S", "date_of_visit": " June 2018", "rating": "5", "title": "Relaxing evening out!", "comment": "I went there a couple of days ago for a quick drink before dinner with my fiancee. The setting was really unique as it feels like you are sitting in a garden. We had a passion fruit based cocktail and another with rum and prune brandy which were divine. Service was very casual and attentive which feels even more comfortable. Next time we will give a try also on the food as they have plenty of seafood options. ", "date_of_review": "13 June 2018"}
{"review_id": 111, "restaurant_id": -8, "username": "Waldy B", "date_of_visit": " May 2018", "rating": "1", "title": "Very poor", "comment": "Really not good.I just name a few things: We had a reservation at 21:30 and when we came in on time the host said the kitchen was closed. I told her I had a reservation and then the kitchen was open again. She told us that remark was for walk inns, thinking we were, which is strange because there is also a host downstairs. Anyways, we sat down and wanted to order and then heard that 4 of the 6 sides were out. We wanted bread but that was out too. We ordered the bavet which was okay except for the amount of two teaspoons of bearnaise sauce. When we did not have our food yet the waitress told us if we had something more for the kitchen to order because it would be closed. We then ordered dessert of which there were only 2 of 5 left. We ordered dessert and then got our maincourse. We did see another table now receiving bread which we thought was ackward. The location on itself is nice but the food and service are very poor.", "date_of_review": "7 May 2018"}
{"review_id": 112, "restaurant_id": -8, "username": "CliffB953", "date_of_visit": " April 2018", "rating": "2", "title": "So Disappointed", "comment": "Booked an early evening meal with my two daughters, one of them having a viewing to go to at 8.00PM. Arrived just after 6.00 PM and were able to order at 6.40, explaining that one of us needed to get away by 7.30. Our food took nearly an hour to arrive. The so called sashimi grade tuna was actually so overcooked and dry that it was inedible. My lamb cutlets, while correctly cooked, smelled like they had either been cooked on a dirty grill (ie burned on food) or had been cooked on the same area as fish and tasted bitter and also were inedible. We were sitting close to the grill and the pass and it was obvious that there was a major problem in the kitchen, observing the interaction with the waiting staff. An extra 2 guys turned up later, one of whom was cracking the whip and seemed to be getting a grip on the service when we left. I've given 2* here for the food. The waiting staff, and the manager who wrote the food off our bill, were great and the location of the bar/restaurant is fab. I will go back, but the owners of this establishment must address the problem in the kitchen.", "date_of_review": "18 April 2018"}
{"review_id": 113, "restaurant_id": -8, "username": "OllyTravel", "date_of_visit": " April 2018", "rating": "1", "title": "Attempted to take our table away, then overcharged", "comment": "I booked a table for the inside area in the restaurant, but then saw there was a table outside and took it with my friend (given it is first come, first served for tables outside). My friend arrived and then we tried to move to a better table, but we were told that it was reserved (despite the restaurant already saying it’s not possible to book outside), and THEN the staff tried to tell us that our original table was now void. We had to speak to the manager just to return to the original table we already sat at. We ordered a cocktail pitcher that was mostly ice. We got the bill and then were overcharged by around 50% of the total because they took our cards without showing us what we were paying. No receipts were provided. There were no redeeming qualities. The view would have been nice, but the frosted glass borders around the boundary prevented us seeing even that. Avoid.", "date_of_review": "21 April 2018"}
{"review_id": 114, "restaurant_id": -8, "username": "David M", "date_of_visit": " April 2018", "rating": "4", "title": "Decent cocktails, pretty good atmosphere - a bit disorganised", "comment": "Rooftop view of Shoreditch is maybe not the greatest in London but nice atmosphere. Drinks were expensive (about £10) but pretty good.  However, the service is disorganised, at best. When we entered downstairs, the reception people said they'd have to call up and see if there was room for 4. The reply was that they'd have to call reception back. When we got upstairs, lots of space, but took a while to get menus, then took a while to get service, eventually took a while to get someone's attention to get the bill. All with 12.5% \"discretionary\" service charge. I wondered whether this was because the circa 60-year old average age of our group of 4 was more than double the average for the rest of the clientele, or whether they are like that with everyone.", "date_of_review": "22 April 2018"}
{"review_id": 115, "restaurant_id": -8, "username": "Hollie H", "date_of_visit": " April 2018", "rating": "4", "title": "Overall good experience", "comment": "Myself and my friend had dinner at the restaurant last weekend. We had a bit of an issue with the kitchen closing early without warning but this was quickly rectified. Would like to thank our waiter (I believe called Alexarndur) who provided us with excellent service throughout our meal and his bubbly character made us smile throughout the evening.", "date_of_review": "25 April 2018"}
{"review_id": 116, "restaurant_id": -8, "username": "Elizabeth A", "date_of_visit": " April 2018", "rating": "4", "title": "Fantastic views, good food but a bit chilly the night we were there", "comment": "Well worth a trip upstairs for the view. Great outdoor area with heaters or indoor restaurant. Food was good, staff friendly.", "date_of_review": "25 April 2018"}
{"review_id": 117, "restaurant_id": -8, "username": "114gabrieli", "date_of_visit": " May 2018", "rating": "5", "title": "Fantastic rooftop", "comment": "Fantastic rooftop to have lunch on a sunny day. The food was delicious and fresh. Amazing view from the rooftop and excellent service. Totally recommend it, and I look forward to come back soon.", "date_of_review": "5 May 2018"}
{"review_id": 118, "restaurant_id": -8, "username": "723ollier", "date_of_visit": " May 2018", "rating": "3", "title": "I’d go again but wouldn’t rush back.", "comment": "Good but could be better. Tasty lobster and sea food. Great casual atmosphere and the roof terrace for sunset was a treat. Disappointment at £3.50 for stale bread, not sure what made it Mediterranean? The rest was good so this should be an easy fix. We commented this to the waiter and got a shrug. Service was unpolished (from our waiter at least) - he was attentive though and we didn’t need to wait/flag him down.", "date_of_review": "6 May 2018"}
{"review_id": 119, "restaurant_id": -8, "username": "bexd817", "date_of_visit": " May 2018", "rating": "2", "title": "Appalling service.", "comment": "Don’t come here unless you are prepared to chase for your correct food order and the menu... When it comes the food is actuallly v good but overpriced for what it is.", "date_of_review": "6 May 2018"}
{"review_id": 120, "restaurant_id": -8, "username": "M798DBkellyf", "date_of_visit": " May 2018", "rating": "3", "title": "Fairly average ", "comment": "Sad to say the reviews were fair. Take away the view and the Sunday bank holiday and you are left with something very average. Service was slow to say the least... we had a charcuterie which was tasty but doesn’t require any prep, yet it still took 45 mins. The staff made an attempt to apologise claiming it was slow, however there are max 20 tables. Half the menu wasn’t available and the bavette was fairly average... 2 hours for 2 mains. Just not great.... not a cheap meal, but really not hard to make the improvements needed. The view saved it .... ", "date_of_review": "6 May 2018"}
{"review_id": 121, "restaurant_id": -8, "username": "Yvonnesuffolk", "date_of_visit": " March 2018", "rating": "3", "title": "Friendly staff, wonderful feel, limited menu", "comment": "We arrived on a Monday evening early for a 7pm table - it was not busy at all so there was no problem seating us. I had expected it to get busier later in the evening but it remained very quiet all night.  This did not detract from the ambiance - it's a lovely space with all the greenery making for a really special atmosphere. Being on the roof, of course the views are good. Its not massively high and its setting might not mean a great deal to a lot of people - you cannot really see any particular sights or landmarks if that is what you are after, but it does give you a good feel of the area.  I found the menu slightly limited - seafood platters to share and oysters to start. The 'mains' are basically a choice of skewers. I tried the bavette and halloumi - both of which I found overcooked and dry for my taste, but others might disagree.  The staff were very friendly and attentive and helped us with any questions we had.  I would go again for a drink for sure - but not necessarily to eat.", "date_of_review": "18 April 2018"}
{"review_id": 122, "restaurant_id": -8, "username": "A2049NCdanielb", "date_of_visit": " January 2018", "rating": "5", "title": "Mr ", "comment": "Amazing view and food with great atmosphere and cosy wood fire. Food was great and the atmosphere as well, definitely recommend it. ", "date_of_review": "22 January 2018"}
{"review_id": 123, "restaurant_id": -8, "username": "Evington", "date_of_visit": " December 2017", "rating": "1", "title": "Exceptionally poor, unfriendly service. ", "comment": "Went midweek when this place was quiet. I was stunned by the poor quality of the service. So much so that I am actually wondering whether we did something wrong and that's why the service was so frosty.  This place is quite expensive and therefore, all the more reason why you'd hope to feel welcomed. Drinks are very expensive.  Great views. Elegant design. Trendy/cool place to hang out. ", "date_of_review": "6 January 2018"}
{"review_id": 124, "restaurant_id": -8, "username": "41alexb", "date_of_visit": " January 2018", "rating": "3", "title": "Delicious, if a touch expensive", "comment": "I’ll start by saying that my 3 rating is driven solely by the amount I spent! The food was delicious (cheese fondue, anyone? Back to the 80s!) and the service was excellent - not sure why there are reviews mentioned rude staff on here - the friendliest bunch. We didn’t use the outside area as it was too cold, but I can well imagine knocking back a few gin’s in the summer here. Worth a try.", "date_of_review": "23 January 2018"}
{"review_id": 125, "restaurant_id": -8, "username": "Laura S", "date_of_visit": " January 2018", "rating": "4", "title": "Friends dinner", "comment": "This place would almost certainly come into its own in the summer months. That said the views are great and the food also. Service was polite friendly and efficient.  We would definitely return on a summer evening.", "date_of_review": "22 January 2018"}
{"review_id": 126, "restaurant_id": -8, "username": "Sam M", "date_of_visit": " February 2018", "rating": "4", "title": "Drink with a view!", "comment": "We visited for a cocktail on a rainy Saturday afternoon. There's an indoor section so you still feel as though you're on a rooftop, but can stay warm and dry. Great view on a sunny day. A bit of a hidden gem in Shoreditch, feels quite exclusive, trendy décor. Would definitely visit again.", "date_of_review": "8 February 2018"}
{"review_id": 127, "restaurant_id": -8, "username": "Clacg", "date_of_visit": " October 2017", "rating": "4", "title": "Great atmosphere", "comment": "Nice atmosphere and interior but food is way too expensive for what it is. I would prefer going back just for drinks and nibbles.", "date_of_review": "26 February 2018"}
{"review_id": 128, "restaurant_id": -8, "username": "LondonerAbroad29", "date_of_visit": " June 2017", "rating": "4", "title": "Summer Sun, Views and Seafood", "comment": "Great views if you can get outdoor seating on the terrace; order a large seafood platter and enjoy with a couple bottles to Rose!", "date_of_review": "30 March 2018"}
{"review_id": 129, "restaurant_id": -8, "username": "Hannah T", "date_of_visit": " October 2017", "rating": "5", "title": "Best rooftop bar", "comment": "Love coming here. Most rooftop bars in London are posh and boring while this one has a nice Shoreditch feeling to it. Haven't had food there yet, but a glass of wine with a view is always a good option here.", "date_of_review": "17 April 2018"}
{"review_id": 130, "restaurant_id": -8, "username": "Pmgi01", "date_of_visit": " March 2018", "rating": "2", "title": "Bad behavior from staff ", "comment": "We had everything reunited for a great day, friends, the view, a perfect reunion after years of travelling everyone on its own. But the guy that took orders and billing was absolutely obnoxious and didn’t smile once. If we aren’t welcome or are bothering you just say it, that type of attitude killed the whole ambiance....", "date_of_review": "22 March 2018"}
{"review_id": 131, "restaurant_id": -8, "username": "NickW867", "date_of_visit": " December 2017", "rating": "5", "title": "Really good find - great location", "comment": "Really good bar and restaurant with friendly staff and a good atmosphere for the evening - nice in winter looking across rooftops", "date_of_review": "23 December 2017"}
{"review_id": 132, "restaurant_id": -8, "username": "Rebecca D", "date_of_visit": " August 2017", "rating": "5", "title": "Wonderful ", "comment": "Wonderful little gem, this place is heaven, a secret rooftop terrace with gorgeous decor & great cocktails. The sit down dinner was even better, fresh seafood & flame grilled skewers of deliciousness! The staff are effortlessly attentive & made our evening really special.", "date_of_review": "26 August 2017"}
{"review_id": 133, "restaurant_id": -8, "username": "Too_Much_Tapas", "date_of_visit": " August 2017", "rating": "2", "title": "Trading on the Boundary name", "comment": "A very poor experience after a very nice experience at Tratra in the basement. We were secured a table by the lovely staff at Tratra having finished our meal. We arrived to be told that the only table we could have was right next to a patio heater which is only an enjoyable experience if you want to smell of BBQ and overheat. Tables that arrived after us were relocated but we were left in the corner and ignored. We ordered two very average cocktails, mine was gin and grapefruit and had WHOLE black pepper corns in it, yes WHOLE black pepper corns which went up the straw and caused me to cough up. Paid £28 for a round and with surly and unhelpful service. Trust me, there is no danger of getting drunk up here, service is so slow and apathetic, you wonder how the two businesses exist in the same building.", "date_of_review": "27 August 2017"}
{"review_id": 134, "restaurant_id": -8, "username": "matthX5639LF", "date_of_visit": " August 2017", "rating": "4", "title": "Great spot to relax in the sun", "comment": "Open roof top made it a great place to drink and relaxing in the sun. I am not sure what it would be like in the rain but recommended for a view and relaxing afternoon. A must when in this side of town", "date_of_review": "29 August 2017"}
{"review_id": 135, "restaurant_id": -8, "username": "Danslovesfood", "date_of_visit": " August 2017", "rating": "3", "title": "Okay on a sunny day", "comment": "We only popped in for a drink before getting the train home on one of the hottest Saturdays for a while.  Very busy, as you can imagine, but pleasant enough. Not overwhelmed by the drinks on offer and not enough ice for such a hot day. Seating is a little to be desired, my husband and I were very far apart on the table we were seated at which meant loudly talking & leaning over to one another. The strangers to my right and left were much closer which at more than one point felt a little uncomfortable. (Not that I was whispering sweet nothings, but you know, don't wish everything to be overheard!) Probably wouldn't hurry back if I'm honest.", "date_of_review": "5 September 2017"}
{"review_id": 136, "restaurant_id": -8, "username": "459darrenb", "date_of_visit": " August 2017", "rating": "2", "title": "Could be better", "comment": "I went for dinner on a Saturday evening. The rooftop is a nice spot on a sunny evening and the views are good. The food was very disappointing though. I had octopus and chorizo scewers which were over cooked and rubbery. My wife had chicken which was also tough. Considering the investment in the environment and the food is very expensive it really needs looking at. We had two gin Cocktails which were also a bit strong. Nice place and nice night but much room for improvement.", "date_of_review": "27 August 2017"}
{"review_id": 137, "restaurant_id": -8, "username": "Soniadcd", "date_of_visit": " September 2017", "rating": "5", "title": "Saturday evening", "comment": "I just want to say how fantastic we felt during our visit at Boundary Rooftop. Outside was quite cold but the staff at Boundary provide us with blankets and they even made the fire outside on the terrace. The atmosphere was EPIC with the heaters and the fire place on.Good music in the background and the food is great. We had as well cocktails which were pricey but very good value. We will return.", "date_of_review": "11 September 2017"}
{"review_id": 138, "restaurant_id": -8, "username": "dawnhski", "date_of_visit": " November 2017", "rating": "5", "title": "Apres ski without mountains", "comment": "What a lovely surprise when we exited the lift onto the rooftop restaurant. Very tasteful set up and the staff were extremely helpful. The menu reflects that of food found in the Savoyard area continuing the apres ski theme. Relaxed and enjoyable atmosphere. Food lovely. Don’t expect a London skyline but eating alfresco is what it’s about. Thoroughly recommended.", "date_of_review": "19 November 2017"}
{"review_id": 139, "restaurant_id": -8, "username": "197joannas", "date_of_visit": " November 2017", "rating": "4", "title": "Cozy roof terrace", "comment": "We visited for dinner with a friend. The outdoor space is very beautiful with plenty of cushions and fire pit. The food was good but not much to choose from the menu. We had a table in conservatory, quite romantic but it was cold inside. I will be coming back definitely ", "date_of_review": "14 November 2017"}
{"review_id": 140, "restaurant_id": -8, "username": "978Traveller", "date_of_visit": " December 2017", "rating": "3", "title": "OK, wouldn’t rush to tetuen", "comment": "I had heard good things about Boundary but I was quite underwhelmed. The rooftop was nice but their are better rooftops in London with better views. The menu was strange and the portions small. The skewers were tasty but definitely not value for money, they were more snack size than main meal - however they were priced as a main meal. Perhaps the menu for the restaurant is better but I wouldn’t rush to return for this menu. ", "date_of_review": "7 December 2017"}
{"review_id": 141, "restaurant_id": -8, "username": "iansP8137CU", "date_of_visit": " July 2017", "rating": "5", "title": "Good vibe and friendly staff", "comment": "This place is amazing. It has a really good vibe and in a good location with a good view from the rooftop. The staff were really friendly and helpful and the food was outstanding. Would highly recommend and will definitely return!", "date_of_review": "9 July 2017"}
{"review_id": 142, "restaurant_id": -8, "username": "M1lesaway", "date_of_visit": " July 2017", "rating": "1", "title": "How can you get it so wrong!", "comment": "What a great venue, amazing terrace and building but that's where it ends. It takes a real skill to make such a mess of such a fantastic place - food was inedible, and when questioned if it was possible to make a gluten/dairy free salad was told \" the chef is not there to be creative\" service was beyond terrible, an absolute waste of a great venue. My advice, when it's raining and there are no customers, use the time to train your staff, on customer service, and your chef, how to cater for different food types.", "date_of_review": "17 July 2017"}
{"review_id": 143, "restaurant_id": -8, "username": "spikeyx", "date_of_visit": " July 2017", "rating": "5", "title": "Food was superb service was great", "comment": "I am so glad I didn't see the reviews before eating here last night . I had originally booked weeks ago for the summer rooftop dinning which was a complete wash out , due to rain . The food and service came up trumps . There were 7 of us ,the portions were great and the atmosphere was really good. I would definitely return when the sun comes out. There is one small gripe ,that seems to be happening in more and more restaurants . Mixed toilets such a no no for all 4 ladies in our group.", "date_of_review": "30 July 2017"}
{"review_id": 144, "restaurant_id": -8, "username": "camilleVT", "date_of_visit": " March 2017", "rating": "3", "title": "Nice rooftop", "comment": "We went to this rooftop with my boyfriend to take a drink and share some dishes ! The rooftop is very nice, lovely and with a very nice localisation ! We couldn't book for the rooftop, only the closed area (or maybe we just didn't find on the website). Cocktails are good but quite small for the price and the food is quite expensive , even if it was nice ! We will come back to just take a drink on the rooftop if we can but to eat, i'm not sure !", "date_of_review": "23 July 2017"}
{"review_id": 145, "restaurant_id": -8, "username": "Rareş F", "date_of_visit": " July 2017", "rating": "5", "title": "Date", "comment": "Me and brand new girlfriend :) had a fantastic date on Boundary Rooftop. The cocktails were really tasty and they do all the classic ones just need to ask, staff were taken great care of us. Thank you Boundary Rooftop we will be back.", "date_of_review": "2 August 2017"}
{"review_id": 146, "restaurant_id": -8, "username": "Footprints590493", "date_of_visit": " August 2017", "rating": "5", "title": "Ana M", "comment": "We visited on a sunny Saturday afternoon when the terrace was pretty busy. Despite this the staff was very helpful, especially the manager Gabriel whose knowledge on coktails and food was excellent. The food was really tasty and the service impeccable. Five star treatement, will definitely visit again. ", "date_of_review": "12 August 2017"}
{"review_id": 147, "restaurant_id": -8, "username": "l-globetrotter", "date_of_visit": " August 2017", "rating": "4", "title": "Really fab on a sunny warm day", "comment": "This roof terrace has so so much more potential, and yes, one could make it more elegant or at least cosy, and yes, the service could be a little more relaxed and caring, but two things stood out for me that I really enjoyed. Firstly, it is a lovely place to be when the sun shines, one feels like one is hovering over all the funki buildings and apartment tops, and secondly, and more importantly the food was fairly simple, but very good. Yes, it is not cheap by any stretch of imagination, for the money a long afternoon, of few champagnes, wine, 1 starter and two mains and some nibbles later cost as much as you would pay in a Michelin starred place at lunch, but with a setting like that, in the sun, one doesn't mind. The oysters were super fresh, the main of chicken skewer my friend had was fab, my seared tuna fantastic, the nibbles of crudités and wood fired focaccia type bread later in the afternoon was also very good. I would definitely go back there for the sun and the food.", "date_of_review": "21 August 2017"}
{"review_id": 148, "restaurant_id": -8, "username": "Little_Carts", "date_of_visit": " August 2017", "rating": "4", "title": "Lovely evening", "comment": "Perfect date night, we had a lovely night here. Just came for drinks on the rooftop bar and they were worth the money", "date_of_review": "16 August 2017"}
{"review_id": 149, "restaurant_id": -8, "username": "Gino M", "date_of_visit": " August 2017", "rating": "5", "title": "Dinner date", "comment": "I was visiting Boundary Rooftop with my girlfriend Friday night. The Rooftop looks amazing specially during the night with all the heaters on. They had a wedding going on which we didn't felt disturb at all. I had a ribeye steak and my girlfriend scallops and bacon . Both of the dishes were very tasty . I will return because it is a good spot to go out.", "date_of_review": "19 August 2017"}
{"review_id": 150, "restaurant_id": -8, "username": "BarristerLondon", "date_of_visit": " June 2017", "rating": "3", "title": "Great rooftop in the sun", "comment": "The food is so so & restricted because of the limitations of the grill. Lobster fared better than a pretty average chicken brochette. Salad with courgettes, peas & feta very nice. Good service. Still a bit of a must-do in the summer.", "date_of_review": "17 June 2017"}
{"review_id": 151, "restaurant_id": -8, "username": "Lorenzo D", "date_of_visit": " June 2017", "rating": "5", "title": " seafood choice", "comment": "I must say that our group enjoyed Boundary rooftop im Sunday. The quality of food and drinks is ine of the best in the area and Sunday we enjoyed a promotion after 8 o'clock of 50% from seafood .", "date_of_review": "19 June 2017"}
{"review_id": 152, "restaurant_id": -8, "username": "John15001", "date_of_visit": " June 2017", "rating": "5", "title": "Best terrace în London", "comment": "We visited The terrace in Wednesday. Crazy hot outside and Was Packed upstairs at Rooftop. However we had great time. Food, drinks and service Was amazing. I will be back. Thank you", "date_of_review": "24 June 2017"}
{"review_id": 153, "restaurant_id": -8, "username": "PeterB11149", "date_of_visit": " May 2017", "rating": "1", "title": "Terrible Service", "comment": "I went with a group of friends to celebrate my friend's birthday at the Boundary Rooftop. We brought our own cake and Boundary Rooftop charged us a £20 handling fee, which we paid. Boundary Rooftop threw the cake box away and put the birthday cake in a plastic bag. I complained about this as this was very unhygienic. I waited 15 minutes before the waitress agreed to take the birthday cake out of the plastic bag and put it into a new box. Then the head chef turned to me and said \"you are complaining because you are black people, you black people need to know your place and take the cake as it is, I do not know why you black people always like to cause trouble.\"  The manager refused to give me the head chef's name. The head chef continued saying \"I have many sisters and females in my family so I will only take pity on you because there are many females in your group, the females need to know their place and carry themselves better.\" I told the head chef that I will be filing a police report for racist and sexist remarks. To which the head chef replied \"I do not care, do what you want!\" Least to say my friend's birthday celebration was ruined.", "date_of_review": "20 June 2017"}
{"review_id": 154, "restaurant_id": -8, "username": "ccriderYVR", "date_of_visit": " June 2017", "rating": "4", "title": "Cool terrace in Shoreditch with good food and wine", "comment": "We made a special trip out to Shoreditch to try out this rooftop. When you arrive, you check in with a desk downstairs and then a doorman lets you up the elevator. There was no room on the terrace so we started off in the restaurant and given that the temperature was in mid 30s we didn't like it. We asked the host to let us know if a seat came up outside.  We had most of our dinner inside and had a nice bottle of wine on the terrace. The host did offer us a seat outside but we didn't like the location near the exit. We passed on that one. Another 5 minutes and a table we liked did come up and we took it. The weather was splendid.  Our meal included a spring vegetable salad, grilled Asparagus and a Rabbit Terrine. However, the terrine was pre made in a jar and served as such. I had to pop open the jar as well. Not too impressed with that. Once on the terrace we ordered a nice bottle of chateau leoube from Provence and enjoyed the weather. The staff was friendly and we didn't have any issues with service.", "date_of_review": "27 June 2017"}
{"review_id": 155, "restaurant_id": -8, "username": "Karen O", "date_of_visit": " June 2017", "rating": "3", "title": "Birthday ", "comment": "This place was recommended it was amazing views but drinks choice poor and very expensive also breads tapas where dry they also take your card which now with tap and go is not very comfortable ", "date_of_review": "29 June 2017"}
{"review_id": 156, "restaurant_id": -8, "username": "maxn", "date_of_visit": " July 2017", "rating": "2", "title": "Such a disappointment!", "comment": "After trying to book a table for a weekend we decided to go on a Tuesday night, only to have a huge disappointment.  Service was appalling at best, waiting long time for ordering, getting wrong drinks, getting food for other tables. The waitress was new, but she didn't care. Management should not allow that. Food wise, we ordered \"steak\". A £28 shoe sole. Probably £4.50 at Sainsbury's. View was nice, but nothing special. Such a pity such a \"big\" name and a location with such potential, is so poorly managed.", "date_of_review": "5 July 2017"}
{"review_id": 157, "restaurant_id": -8, "username": "clairemichelle17", "date_of_visit": " June 2017", "rating": "3", "title": "Nice roof terrace for a drink", "comment": "We turned up here without booking, and managed to get a small table for 2 really quickly. I liked the decor, and the atmosphere was ok (once we'd got past the front deck, which seemed a bit pretentious considering the people upstairs were dressed in sports clothes). Service was good - friendly and fast. The view from this roof bar isn't anything spectacular and the cocktails are overpriced for what they are, but I guess you're paying for the 'cool Shoreditch thing'. Worth a visit if you're in the area, but there are definitely better roof terraces in the city - this one isn't really worth travelling out of your way for.", "date_of_review": "29 June 2017"}
{"review_id": 158, "restaurant_id": -8, "username": "Tibi C", "date_of_visit": " June 2017", "rating": "5", "title": "Super lunch", "comment": "Couple of us had visited Boundary Rooftop in a sunny day. The food was delicious not too many choices however right to the point.  Drinks - we didn't go for cocktails but we're many people on large cocktails glasses. We had champagne Veuve for a good price.  I will return.", "date_of_review": "28 June 2017"}
{"review_id": 159, "restaurant_id": -8, "username": "Anca T", "date_of_visit": " July 2017", "rating": "5", "title": "Great outdoor terrace", "comment": "The rooftop was amazing service and food of highest quality will definitely be visiting again. I do suggest to try it yourself.", "date_of_review": "6 July 2017"}
{"review_id": 160, "restaurant_id": -8, "username": "Antonio J", "date_of_visit": " June 2017", "rating": "1", "title": "bad service, average food...poor overall", "comment": "whilst the terrace is pretty and during the week days during working hours only and with the sun out is relaxing, all the rest is appalling; I went there for lunch yesterday with another person and they made us sit in a table literally attached to a noisy big table; nobody came to take order for 10 mins, we decided to change table when we saw one that was free and again they left us there with the dirty glasses that people before us used. One guy was going around with a tray not having a clue what to collect, the main waiter that gave us the table passed few times without asking and I had to stand up and cdall them to take the order. Beer brought were warm and no glasses offered, no cutlery given with food and I had to stand up to go and get them, food is very average....do not go there and eat what they give you for 25-28 pounds as a main dish it is totally not worth it; I refused to pay the service and I will definitely not going to eat there again; only good for drinks in weekdays and during office hours...if they have a reputation i am not sure where it comes from Antonio", "date_of_review": "16 June 2017"}
{"review_id": 161, "restaurant_id": -8, "username": "431darias", "date_of_visit": " August 2017", "rating": "3", "title": "A small disappointment... ", "comment": "I wanted to visit this rooftop restaurant during all summer and always circumstances were against me. So it was like an annoying idea to get to this place.  And I was sooo excited to get a table for 3 for saturday night! I thought Im lucky;)) How sad I was to leave this place hungry...  The hotel and a restaurant are very stylish, but I really didn't understand what is all that hype about? And theres no magnificent view....", "date_of_review": "23 August 2017"}
{"review_id": 162, "restaurant_id": -8, "username": "Andreea M", "date_of_visit": " May 2017", "rating": "5", "title": "Best dinner ever ", "comment": "I must say that our expectations weren't high when we did our booking but when we arrived we've been greeted by a nice hostess service the food as you can seen fantastic and the service was impecable. I don't the name of the gentleman who was looking after however he was a true profesional the way he was working. Anyway I think he was the restaurant manager because it seems everybody was listening to him and he was the only one wearing a tie. We will return.", "date_of_review": "6 May 2017"}
{"review_id": 163, "restaurant_id": -8, "username": "Allionna P", "date_of_visit": " May 2017", "rating": "5", "title": "Amazing atmosphere on a Saturday afternoon!", "comment": "Great terrace with a beautiful vue. Don't hesitate to come and bring your friends along. Excellent service! The weather was also great with amazing views of Shoreditch area.", "date_of_review": "15 May 2017"}
{"review_id": 164, "restaurant_id": -8, "username": "jrh143", "date_of_visit": " May 2017", "rating": "4", "title": "Nice for a Sunny Day", "comment": "Visited at noon for drinks and nibbles to experience a mediterranean style outdoor experience on a roof terrace on a rare London sunny day. The terrace is pleasantly laid out with a nice ambience induced by planted greenery and shrubs. Although the Italian breads and accompanying spreads dips were nice and fresh, the food for us vegetarians was not very exciting, and a bit too bland for our more adventurous taste buds. The table waiters were however very pleasant and attentive.  So just be aware you are probably paying for the atmosphere rather than the dining experience.", "date_of_review": "12 May 2017"}
{"review_id": 165, "restaurant_id": -8, "username": "Dwayne H", "date_of_visit": " April 2017", "rating": "3", "title": "You had me at half-price seafood Sunday!!", "comment": "Gorgeous rooftop bar with an awesome view. Reserve a table online for their half off oysters and lobsters. Surprised that it wasn't packed. Unfortunately was on my own...so, please don't waste the moment--invite someone. Asparagus was fresh (9). Ordered a dozen oysters (1/2 price at 12) which were delicious. 1/2 lobster at 11 was fine...nothing glamorous as it's literally just a grilled lobster tail and they can be kind of tough. The Viognier (7) was a good way to wash it down. Tarte du jour (7) was apple and just okay--kind of dry. Enjoyed a nice Talisker (11) to finish it off.", "date_of_review": "19 May 2017"}
{"review_id": 166, "restaurant_id": -8, "username": "Simona U", "date_of_visit": " May 2017", "rating": "5", "title": "rooftop experience", "comment": "Visited Boundary rooftop restaurant on a gorgeous sunny Sunday. This is a must visit place in London in the heart of Shoreditch. Not only the place in lively, the views are astonishing and the food is great. Perfect for the afternoon/evening with friends or a date. They have a lot of amazing cocktails, perfect and refreshing on those summer days. Highly recommended. Will definitely be back soon. Keep up the good work.", "date_of_review": "24 May 2017"}
{"review_id": 167, "restaurant_id": -8, "username": "Varifr", "date_of_visit": " June 2017", "rating": "1", "title": "Worst terrace and food ever!", "comment": "This place is a mess .... i will try to be brief but detailed to explain how terrible it was: we booked 3 weeks ago and when we arrived little earlier we asked to wait at the bar and they said to come back later that it was difficult etc etx we insisted and finally they said fine.... it was funny then when upstairs the terrace was almost empty and never got busy as the weather was not that sunny. Food was very low quality ... you can see the photos my tuna was a steak just thrown on a plate with some pieces of vegetables... i asked for medium rear and actually it was medium-well done.... my friends asked for medium and it was rear......we ordered a cocktail's jar and it was served in a horrible bottle with horrible glasses and it was practically full of ice only. The menu looks boring it was only skewers and steak.... we did not order dessert as we prefer move to another place. Service was low standard the waiter asked as to repeat things many times and when he took the payment we said how we wanted to split the bill and he did not trusted our counting and was writing on a piece of paper and counting in front of us .....never happen in any place before! The terrace is not bad as a location the view however is not that great! It is super overpriced for the quality and the service. I had the feeling that they do not have any idea in what hospitality means!!!! Never never again and i will definitely discourage my friends to go in that place.", "date_of_review": "4 June 2017"}
{"review_id": 168, "restaurant_id": -8, "username": "Evelyn883", "date_of_visit": " June 2017", "rating": "5", "title": "Superb Sunday chill out place ", "comment": "I visited Sunday the Rooftop with couples of friends from Australia and I need to say we had an epic time at Boundary. The weather was on the cold side but they provide us with blankets, gas heaters and even umbrellas in case was raining which is a cool touch. I need to say was unusual busy for Sunday which after one hour I understood why . They had good music any cocktail what you requested was made and the best was the seafood which was on offer on Sunday 50 % . ", "date_of_review": "5 June 2017"}
{"review_id": 169, "restaurant_id": -8, "username": "issyhodgkin", "date_of_visit": " June 2017", "rating": "2", "title": "Poor", "comment": "Came for a birthday meal and the birthday girl's meal came 10 minutes later than everyone else's because the waitress forgot to put the meal through (which she did not apologise for). I asked for my steak to be blue and it came more like medium well (but again she did not ask how my meal was even though i left 3/4 of the steak). The location is however nice on the rooftop and the chocolate almond birthday cake was very good. All in all, an expensive and below average meal. Would not recommend. ", "date_of_review": "5 June 2017"}
{"review_id": 170, "restaurant_id": -8, "username": "JoWaps", "date_of_visit": " June 2017", "rating": "1", "title": "Appalling service and overpriced food ", "comment": "We visited for a family birthday meal. The steak was very poor quality, oily and salty. We didn't see our waitress for 45 min, we were not offered deserts or second drinks or even asked if we were happy with our meals. When the waitress finally cleared the table I had to point out the issues with the steak. Two members of our group had steak and majority was left on both plates, a good waitress would have noticed this and asked if there was anything wrong. The response from the waitress was she was sorry it wasn't to our taste! It was a poor cut of meat and with a £30 price tag we felt ripped off. We had to ask for more water throughout the afternoon, we were sitting in front of the bar in view of all the staff, so you would have thought this would have been spotted. Were so disappointed with our visit, if your thinking of trying this place, maybe just go for drinks but be prepared to wait!", "date_of_review": "13 June 2017"}
{"review_id": 171, "restaurant_id": -8, "username": "Alin B", "date_of_visit": " April 2017", "rating": "5", "title": "Superb wiews over Shoreditch ", "comment": "I just visited this Saturday Boundary rooftop on recomandation and I need to say that I didnt regret it . Sunny day outside with amazing views over Shoreditch area and the food was soooo good. I do sugest to try it yourself.", "date_of_review": "22 April 2017"}
{"review_id": 172, "restaurant_id": -8, "username": "sergiugg", "date_of_visit": " April 2017", "rating": "5", "title": "One of the best roof terraces in London", "comment": "Couple of days ago I took the decision to visit Boundary Rooftop restaurant to chill for a while after work. Cocktails were tasty and the views amazing with great lounge music on the background overlooking Shoreditch area.", "date_of_review": "18 April 2017"}
{"review_id": 173, "restaurant_id": -8, "username": "Itsdivadarling", "date_of_visit": " April 2017", "rating": "4", "title": "Lovely for drinks ", "comment": "Just popped into this place for a couple of cocktails after a meal elsewhere. Went straight to the rooftop which was a little busy but we copped a squat very quickly ....we were served by very pleasant waiting staff which is always greatly received. The cocktails I find were quite pricey by glass so best to buy by the pitcher.  I could hear a faint bit of music in the back ground which I wish had been turned up a couple of notches or switched off completely.  Nevertheless it was a nice a chilled relax vibe ....beautiful when the sun was shining too. They've made 7se of the space well and have heaters on the roof to to keep you warm. Drinks and food available. Thank you for the hospitality Boundary look forward to coming back to eat here. ", "date_of_review": "24 April 2017"}
{"review_id": 174, "restaurant_id": -8, "username": "gabrielv664", "date_of_visit": " April 2017", "rating": "5", "title": "Great outdoor terrace", "comment": "We just visited the rooftop couple of days ago and I must say we did enjoy the weather and the signatures cocktails . We felt look after also by staff providing us with blankets. Thank you Rooftop", "date_of_review": "25 April 2017"}
{"review_id": 175, "restaurant_id": -8, "username": "Gino M", "date_of_visit": " April 2017", "rating": "5", "title": "One of the best", "comment": "I am saying in the context that I believe is one of the best rooftop terraces in London for good on the grill, chill out music, setting of the place and cocktail.", "date_of_review": "27 April 2017"}
{"review_id": 176, "restaurant_id": -8, "username": "114gabrieli", "date_of_visit": " April 2017", "rating": "5", "title": "Saturday Drinks", "comment": "Couple of us we visit rooftop restaurant for drinks on Saturday. We had a fantastic time even our waiter was busy. Good choice of cocktails and the squid and chorizo was tasty.", "date_of_review": "29 April 2017"}
{"review_id": 177, "restaurant_id": -8, "username": "princesasia89", "date_of_visit": " April 2017", "rating": "5", "title": "Girls day out", "comment": "We did visit the Boundary rooftop Sunday which was an amazing day the relax in the sun with my girls. They have a good selections of cocktails and service was fast and prompt considering was a queue outside and waited around half and hour the go up.", "date_of_review": "27 April 2017"}
{"review_id": 178, "restaurant_id": -8, "username": "Llueca", "date_of_visit": " May 2017", "rating": "2", "title": "Average food and views ", "comment": "Was there for a birthday and we were 7. The table was not big enough and some people were uncomfortable and at moments it was also cold. Also we did tell them it was a birthday but they didn't provide any detail or present. They serve mainly French food and it my opinion all the dishes I tried were just ok, nothing too exceptional. Prices are high, around 50-60£ and portions are decent. Even if it was a rooftop the building is pretty low so views were not amazing. Regardless of all the mediocre comments from above the dinner was great thanks to the nice people I was with! ", "date_of_review": "3 May 2017"}
{"review_id": 179, "restaurant_id": -8, "username": "Shervin2015", "date_of_visit": " April 2017", "rating": "1", "title": "Poor Value for Money Restaurant", "comment": "This place is just for cocktails.  The food at the restaurant is overpriced. It is as expensive as Mayfair but has a poor service and poor presentation. The bread that comes with the antipasti/mezze is old, the antipasti itself doesn't appear to be homemade. The lobster was overcooked. The service is also poor. One has to wait over 10 minutes just to get the menu, and if one needs anything else, one has to ask twice. For this type of service and food, it is a rip off. The reviews of those having cocktails are positive due to the terrace. Definitely not recommended. Shoreditch has far better places.", "date_of_review": "1 May 2017"}
{"review_id": 180, "restaurant_id": -8, "username": "Lily R", "date_of_visit": " April 2017", "rating": "5", "title": "Fantastic work dinner!", "comment": "Had a great evening here on the rooftop for dinner with my work team of 11. Sharif, the Event Manager was a dream to work with. He was quick, efficient and responded to all my questions in a timely manner. The dinner was fantastic, especially the chicken skewers. The service was also top notch and the staff were extremely friendly and were there if you needed anything. I would definitely recommend the Boundary and we will for sure be re-visiting again. Thanks Sharif and the team, we had a fantastic evening!", "date_of_review": "4 May 2017"}
{"review_id": 181, "restaurant_id": -8, "username": "227vincenth", "date_of_visit": " March 2017", "rating": "1", "title": "Huge Prices, Small Portions, Terrible Service", "comment": "Three friends and I ate at this restaurant last Friday and it was a terrible experience. The service was appalling, we had to go to the bar to ask if we could get a drink, then it took at least 10 minutes and it was not busy it was 15.30 in the afternoon.  We then sat down to eat where we were charges £32 each for a Rib Eye steak, they forgot to bring the chips which it should be served with, again we had to ask and it cost £10 for tow green leaf salads. With the steak you could have one sauce option only. It was my birthday and my wife had arranged a small chocolate desert with a candle as way of marking it, they forgot to bring this out, again she had to go up and ask. When the bill arrived it was £284.31 which included £32.31 for service, which we should have refused to pay. It was very over prices, very poor service and all in all a bad experience. Perhaps this is trendy East London but take my advice and don't bother.", "date_of_review": "27 March 2017"}
{"review_id": 182, "restaurant_id": -8, "username": "Andrei R", "date_of_visit": " February 2017", "rating": "3", "title": "Nothing special", "comment": "Straight to the point, the starter was too salty and the steak was too small for the price. All in all, I wouldn't come back. We didn't have the dessert, I just had a feeling it would be a further disappointment.", "date_of_review": "20 February 2017"}
{"review_id": 183, "restaurant_id": -8, "username": "prrosi", "date_of_visit": " April 2017", "rating": "1", "title": "Avoid", "comment": "It was my first and last visit... avoid avoid avoid. Very unpleasant service, rude staff,2 double espresso and desert £16.99 really? For this service?! No. There are much nicer places in London with better view and service! ", "date_of_review": "18 April 2017"}
{"review_id": 184, "restaurant_id": -8, "username": "Aveens", "date_of_visit": " March 2017", "rating": "2", "title": "So disappointing. Will never return.", "comment": "I live locally to the Boundary, and have had positive experiences dining both at the Albion and the main restaurant. This time, I wanted to celebrate a special event and decided the ambiance and view of the rooftop would be a great way to do that. I was not disappointed in that respect - the atmosphere is lovely. However, the service and food really let them down. We ordered a wide selection of food, including the deluxe platter with half lobster, chorizo and octopus, sea trout, lamb cutlets, and a whole lobster.  Firstly, the food was thrown at us SO quickly. It felt very much like they were trying to get rid of us ASAP. Maybe it was a result of this over-rapid service that the food was so awful. Firstly the deluxe platter - the cockels were not washed properly at all and were very sandy and unpleasant to eat. The oysters also had not been opened properly, and there bits of shell in it. Then, the sea trout was served to us completely raw, cold and uncooked in the middle. When we sent it back, there was really no apology, no acknowledgement that we had been served completely raw fish.  Lobster was a bit rubbery, and they didn't prepare it properly i.e. crack the shell slightly before serving.  The only enjoyable dish we had was the octopus and chorizo.  I will never return again. Such a disappointing experience, and I feel upset that I had trusted the Boundary brand to 'host' a special evening for myself and my family.", "date_of_review": "27 March 2017"}
{"review_id": 185, "restaurant_id": -8, "username": "rabbithat362", "date_of_visit": " April 2017", "rating": "1", "title": "Snail pace service and over prices", "comment": "Clearly short staffed but still the service was ridiculously slow. Had to wait for booked table and wait an age for them to take out first order. Order champagne only to be told it wasn't cold and we'd have to wait at least 10 minutes... When oysters arrived they didn't know how to serve them, as in they couldn't work out the stand the plates went on! Cocktails very average. We went to celebrate a friends 40th but left feeling very disappointed and let down", "date_of_review": "8 April 2017"}
{"review_id": 186, "restaurant_id": -8, "username": "816kayleighr", "date_of_visit": " April 2017", "rating": "4", "title": "Amazing views", "comment": "The views here were stunning. They also provided blankets for when it got colder which was a lovely touch. They had a range of cocktails and wine. It was a lovely place for a date.", "date_of_review": "12 April 2017"}
{"review_id": 187, "restaurant_id": -8, "username": "Soniadcd", "date_of_visit": " April 2017", "rating": "5", "title": "The food is amazing, the atmosphere impeccable and the staff very friendly!", "comment": "My husband and I had the best romantic dinner ever. The food was amazing we had for dinner Grilled lobster garlic and parsley butter with fries and aïoli I can honestly tell you that this was the best lobster that we ate in a while. Desserts to dye for!! Recommend Petit pot au chocolat absolutely amazing. The view is spectacular, the food and drinks are reasonably priced with friendly attentive service. Definitely, we are coming back!", "date_of_review": "14 April 2017"}
{"review_id": 188, "restaurant_id": -8, "username": "Ivan C", "date_of_visit": " April 2017", "rating": "5", "title": "Amazing Place", "comment": "The Boundary Rooftop was amazing!! Really impressive panoramic view and I loved the food, especially the chorizo and squid skewers.The staff is really friendly and fun. Just a super place for a sunny day . I can wait to come back ....Highly recommended !!", "date_of_review": "14 April 2017"}
{"review_id": 189, "restaurant_id": -8, "username": "Ema2050", "date_of_visit": " April 2017", "rating": "5", "title": "Fantastic place for dinner", "comment": "One of my favourite restaurants in London. Service impeccable and friendly. The food is excellent, always perfectly cooked and the waiters extremely knowledgeable. Love the roof garden and excellent outdoor. Recommend to everyone.", "date_of_review": "14 April 2017"}
{"review_id": 190, "restaurant_id": -8, "username": "A2049NCdanielb", "date_of_visit": " April 2017", "rating": "5", "title": "Rooftop Easter lunch ", "comment": "Amazing lunch with great service, delicious seafood platter. Beautiful views over Shoreditch area. Stunning views over the city in a lovely atmosphere. Lovely service variety of food and drinks options. ", "date_of_review": "16 April 2017"}
{"review_id": 191, "restaurant_id": -8, "username": "theculinaryexplorer", "date_of_visit": " February 2017", "rating": "3", "title": "Very average food but nice staff and cocktails", "comment": "I went with friends on Friday night and had a lovely evening, although this was more down to company than the food. VENUE The venue is definitely for the Summer, although there are some nice fire pits outside to keep you warm if seated. Spacing is good so you don't feel intrusive on other diners. We personally love cheese, but if you're not a fan it will get VERY pungent in the rooftop room so be warned. FOOD For starters, we had the Le grand aperitif Méditerranéen with mediterranean bread and octopus & chorizo skewers. All of these was overwhelmingly average, and nothing stood out. For mains, I had half lobster with chips and aioli, and my friends had the steak. The steak was ok and the half lobster was quite dry but ok (it's lobster so you can't go too wrong), but again, nothing to write home about. COCKTAILS We had the Earth & Smoke and Gindilla, which were all very nice and would recommend. SERVICE Service was attentive and polite so definitely no issues. OVERALL I would definitely recommend for drinks on the rooftop in the Summer, and maybe some snacks if you want some food but would not recommend for dinner.", "date_of_review": "7 February 2017"}
{"review_id": 192, "restaurant_id": -8, "username": "aadamopoulos67", "date_of_visit": " September 2016", "rating": "2", "title": "Expensive, average food quality and service doesn't match brand expectation", "comment": "We had been trying to get a reservation at Boundary for some time on the Rooftop where it is relatively hard to find a decent booking due to popularity. My immediate feedback would be \"go elsewhere\" - they charge £27 for a rib eye that was...maybe 6 ounces and flat? The rest of the meal was very average and the service was sub par - our server(s) didn't really know their wine list and we felt the gin and tonics were terrible. Maybe it was just a bad night for them but as I say on all my \"less than stellar\" reviews, there are too many places that are better to consider returning here.", "date_of_review": "12 September 2016"}
{"review_id": 193, "restaurant_id": -8, "username": "TiffanySto", "date_of_visit": " September 2016", "rating": "4", "title": "Location Top!", "comment": "Amazing and quite roof top! Wine 7/10  good wine list but nothing special Cocktail 6/10  To many ingredients in every cocktail  Location 8/10 What else?!?  Service 4/10 They came 4/5 times in 5 mins after our arrival to push us to order!  ££££ 6/10 Everything is good but you are mostly paying the location not the quality.", "date_of_review": "22 September 2016"}
{"review_id": 194, "restaurant_id": -8, "username": "NayomieJade", "date_of_visit": " September 2016", "rating": "3", "title": "Decidedly average and overpriced", "comment": "I was here for a friend's birthday dinner on the rooftop. The two greeters were very polite and the ambience was ideal but that's where a lot of the positivity ends. For the cost, the food was underwhelming. I had the burrata and fries with aioli. The burrata was fine but ultimately, cheese on a plate. The fries were soggy towards the bottom of the serving and we had to request more aioli as they brought out one serving for three portions. Two of the party had the quinoa salad which was sent back due to being bland. This was rectified but a £15 salad should come out right the first time. I also paid £12.50 for the smallest 'long' cocktail I have ever been served. The service was also very slow once we were seated. If you go here, I would recommend going just for drinks and possibly a dessert (the chocolate pot was good but there were unexpected chunks). Not worth the money I spent there.", "date_of_review": "25 September 2016"}
{"review_id": 195, "restaurant_id": -8, "username": "Sukidayo2", "date_of_visit": " October 2016", "rating": "2", "title": "BURNT", "comment": "Roof top has a decent view but it was completely ruined by the poor quality of food. For the price you pay the food is below average at best. We had 2 tuna and a steak and all of them taste burnt as it was definitely charred for too long. If you are looking for somewhere which you pay expensive prices for really low quality food this is what you are looking for.", "date_of_review": "1 October 2016"}
{"review_id": 196, "restaurant_id": -8, "username": "Helen W", "date_of_visit": " December 2016", "rating": "3", "title": "Great ambience though a little pricey", "comment": "Attended for a birthday gathering. Lovely decor and views, staff friendly and helpful. Perhaps a little pricey for what it is but we enjoyed it. Would recommend the raclette to share.", "date_of_review": "20 December 2016"}
{"review_id": 197, "restaurant_id": -8, "username": "Martin0NZ", "date_of_visit": " October 2016", "rating": "3", "title": "Business drinks", "comment": "Group of 30 - 35 for networking drinks and nibbles. Location good, sadly a wet evening so not able to fully enjoy. Service good, quite expensive.", "date_of_review": "18 October 2016"}
{"review_id": 198, "restaurant_id": -8, "username": "Alex R", "date_of_visit": " February 2017", "rating": "5", "title": "Memorable evening", "comment": "Love London rooftops and Boundary is one of them. Lovely friendly service. Food fresh and appealing. Steak was nice and tender and the meats starter was amazing. Sat outside for a couple of drinks under a blanket and by the heater, good chat looking at Shoreditch rooftops. Nice place to take friends from outside London. Impresive. (Not cheap at £17 for a single rum and coke) £180 for 3 mains, one sharing starter, bread, no dessert 4 beers and two rums. ", "date_of_review": "5 February 2017"}
{"review_id": 199, "restaurant_id": -8, "username": "HannahCG491", "date_of_visit": " June 2016", "rating": "5", "title": "Best Nicoise Salad I've Ever Had", "comment": "I found that the service at the Boundary Rooftop Restaurant was amazing. Our waiter was really friendly and the atmosphere was very relaxed. The views from the rooftop were stunning and I must admit, the Nicoise salad was the best I've ever had.", "date_of_review": "26 August 2016"}
{"review_id": 200, "restaurant_id": -8, "username": "garysuefranalex55", "date_of_visit": " October 2016", "rating": "4", "title": "Excellent food and great views", "comment": "This is an out of the ordinary type experience and somewhere for a special occasion. Very unusual surroundings with views over Shoreditch from the roof of the Boundary Hotel and some unusual dishes of high quality.", "date_of_review": "11 October 2016"}
{"review_id": 201, "restaurant_id": -8, "username": "Gine G", "date_of_visit": " January 2017", "rating": "2", "title": "Good food, poor atmosphere, too expensive", "comment": "We had dinner at the rooftop restaurant on a Sunday evening from 7 PM, and for the first hour we were the only guests in the restaurant. That effected the mood somewhat, and the staff weren't as attentive as I would have expected. We had difficulty catching their attention when we wanted to order, and different waiters came to our table asking the same questions. Also, the music was too loud.  The food was very nice indeed, and seen in isolation, the food is definitely recommendable. The pricing is though a bit of a miss especially the atmosphere taking into consideration. We had salmon crostini as starters, boeuf bearnaise for main course, and creme brûlée for dessert. We only had a very small bowl of bearnaise. When asked for more bearnaise, there was no problem getting additional sauce, but the extra sauce was unfortunately cold. Also we did not quite understand why the water was not cooled?!", "date_of_review": "12 January 2017"}
{"review_id": 202, "restaurant_id": -8, "username": "Kevin K", "date_of_visit": " July 2016", "rating": "1", "title": "Rushed, bad food but good service...", "comment": "We decided to book here for a friends birthday dinner. As the weather was going to be good, Boundary rooftop was a preferred choice. The booking was for 9.45pm as that was the earliest available. We are ok about eating late so we went ahead with the booking. We arrived 10mins late at 9.55pm.  We were greeted by the manager and she was very lovely and friendly. We were shown to our table which was at a brilliant position with a huge big sofa. Our waitress came up and gave us our menus, she was extremely friendly, helpful and efficient. Unfortunately within a couple of minutes of receiving our menus another member of staff came up to notify us that the kitchen will be closing in five minutes and that we had to quickly order if we wanted dinner. Feeling quite rushed we ordered a couple of platter to share and then our mains, only to be told everything will arrive at the same time!!! Feeling slightly annoyed, I guess there was nothing else we could have said. We ordered wine too. Dinner and platters arrived at the same time. The seafood platter was good, large and lovely with a variety of mussels, oyster, prawns and crab. The hot food was average at best. Bland and tasteless. Unfortunately before long (11.30pm), we had another staff member come along to say, sorry we are closing soon. You'll have to finish your food and drinks so we can pack up. So were once again, hurried along to pay and asked to leave. We felt that it was such a joke, it was beyond funny. Why take a dinner booking for 9.45 if your kitchen closes at 10-10.15pm? It was birthday dinner that was rushed, and very average. Definitely do not recommend this place for a nice relaxing dinner. Despite the friendly and lovely staff, food as mentioned average and whole process rushed and ruined the night.", "date_of_review": "26 July 2016"}
{"review_id": 203, "restaurant_id": -8, "username": "xlent1", "date_of_visit": " August 2016", "rating": "1", "title": "Awesome roof terrace mediocre food.", "comment": "Great spot for drinks . I had the worst Nicoise salad. Mainly peppers. Other food was forgettable and pricey.", "date_of_review": "16 August 2016"}
{"review_id": 204, "restaurant_id": -8, "username": "F1160XAkatec", "date_of_visit": " August 2016", "rating": "1", "title": "Extremely disappointed", "comment": "Booked Boundary rooftop for a Saturday brunch in August. Luckily the weather was lovely so we could enjoy the sunshine outside.  We took our seats, ordered a drink and waited for a menus to arrive. The brunch menus were somewhat lacking with not much variety.  We went ahead and ordered an almond croissant, fruit bowl and a bacon sandwich.  A few of the items were not available so we could not have our first choice.  The drinks had still not arrived but at least we were enjoying the sunshine.  Drinks finally arrived, a coffee and some grapefruit juice.  Brunch arrived after 30 minutes but not the correct brunch. Eggs and salmon arrived instead of the bacon sandwich. The waiter apologised and reordered the sandwich.  The croissant was huge and rather cake like in texture. Not the sweet flakey pastry that I was after.  The fruit bowl with yogurt which we ordered to share was not as I expected. Instead it was small chunks of fruit in orange juice with a small dish of yoghurt on the side.  The waiter came over to check on our food and was surprised when I mentioned that we were still waiting for the bacon sandwich.  After I'd finished my croissant and fruit the bacon sandwich arrived. We then knew why it took so long. Anticipating a juicy thick bacon sandwich, we were presented with dry over cooked charred bacon on dry bread with no sauce. We requested some sauce and all they had was tomato. My partner couldn't even finish his sandwich as it was bitter and crisp.  We soon asked for the bill so we could make our quick escape. The bill arrived and we asked not to pay service, the waiter then went off for ten minutes to check this was okay with the manager.  We sharply departed and made better use of the Starbucks stand outside that was handing out free coffees.", "date_of_review": "16 August 2016"}
{"review_id": 205, "restaurant_id": -8, "username": "yvon-8", "date_of_visit": " July 2016", "rating": "2", "title": "What is the hype ?", "comment": "After a long wait,we finally got a table at the Boundary for an early dinner.The hostess on the door greeted us with sorry you have a table downstairs not on the roof , which I know I had booked ages ago, finally after phoning the Roof Terrace to find there were no tables she then realized she had read the paper work wrong ! In all fairness she was very polite and apologetic :) We were seated under cover which was not stated when I booked as I thought we would be outside,there was no atmosphere in-fact it was a bit chaotic staff running about moving tables while we ate !!!  We ordered a cocktail while we looked the menu, with a very nice friendly waitress. We had the octopus and chorizo to start £12 for 2 tiny skewers , that was very,very chewy.We then had the seafood platter to share.I have had many seafood platters from high end restaurant to pubs by the sea, and this was the most tasteless fish I have ever tasted , this was accompanied by a very warm bottle of white wine .We had . Finished the food and just wanted to get out so we just paid for 2 tiny glasses not even a full 175 glass !!! and we were still charged £12 ! I dont mind paying anything for good food , but this is very poor and mid to high prices very disappointed and wont be going back !! Nice helpful waitress she would be better working somewhere else to good for the Boundary", "date_of_review": "2 August 2016"}
{"review_id": 206, "restaurant_id": -8, "username": "PritiLondon_UK", "date_of_visit": " August 2016", "rating": "5", "title": "Absolutely amazing!", "comment": "An absolute amazing rooftop bar! Food was spot on, the place is flawless and the manageress as well as all the staff were superb/absolutely outstanding! I was out celebrating my birthday with a large group and we were all super impressed! Thanks for making my day special!", "date_of_review": "22 August 2016"}
{"review_id": 207, "restaurant_id": -8, "username": "PeterL5465", "date_of_visit": " August 2016", "rating": "3", "title": "Great location and rooftop - food ok", "comment": "Rooftop restaurant has a great buzz. Good outdoor seating space for a drink, can be cramped for dinner if you sit outside and a large conservatory with more formal dining - gets hot, if the sun shines, ok that's rare in London.  This place is Shoreditch cool and attracts all the hipsters. French menu with limited choice - not a criticism 6 or 7 choices per course. The food is ok and a little hit and miss, the same could be said for the staff some are v helpful some can't speak too much English.  Def place to visit for the vibe and setting but you wouldn't visit just for the food, if you want great French food use the restaurant downstairs in the basement its amazing, top draw.", "date_of_review": "21 August 2016"}
{"review_id": 208, "restaurant_id": -8, "username": "PoshNosh2011", "date_of_visit": " August 2016", "rating": "3", "title": "Rooftop Bar Visit - great location, poor service", "comment": "Luckily we booked ahead for lunch - wouldn't fancy queuing! Food was very good, drinks are quirky. Service was dreadful. When we didn't pay the optional 12.5% service charge, we were told we had underpaid. When we told them why we weren't paying it, there was a discussion amongst the staff for about 15 mins before we were given back our change. Has put me off of returning.", "date_of_review": "18 August 2016"}
{"review_id": 209, "restaurant_id": -8, "username": "Phoebe S", "date_of_visit": " August 2016", "rating": "5", "title": "Best Rooftop in London!", "comment": "Amazing.I celebrated my birthday here and had such a great night. From the super helpful door staff at the entry to the delightful, good looking manager chap (Sean I think his name is?), the service is friendly and informative. Food is amazing, the chips were perfectly cooked (and I know my chips, trust me). Espresso Martini's were fabulous. Cannot fault it. Big 10/10 to the Boundary.", "date_of_review": "23 August 2016"}
{"review_id": 210, "restaurant_id": -8, "username": "Amira A", "date_of_visit": " August 2016", "rating": "3", "title": "Good food but mediocre service", "comment": "We chose to have the chorizo and octopus skewers as they had run out of burrata. These were gender and flavoursome. The service was lacking though and we felt more neglected than other guests sat nearby. It wasn't particularly busy either for that to have been an excuse. Nice rooftop though as it is not as busy as places such as Radio and Madison.", "date_of_review": "24 August 2016"}
{"review_id": 211, "restaurant_id": -8, "username": "Sandra C", "date_of_visit": " July 2016", "rating": "4", "title": "Up on the roof", "comment": "Great service, wonderful steaks and oysters, green salad a bit droopy, it was a hot evening! Lovely, lovely chocolate pots and Banyals . Great views and delicious expression martinis- what a great way to spend a Sunday evening, and half price seafood too", "date_of_review": "25 July 2016"}
{"review_id": 212, "restaurant_id": -8, "username": "dnover56", "date_of_visit": " June 2016", "rating": "5", "title": "Wonderful lunch ! Great service", "comment": "My daughter booked the Boundary rooftop restaurant as we were visiting in London , she had been there before and enjoyed it very much. 5 of us in our party , arrived , no problems straight to table , cold water served immediately, all of our food was of a very high quality , starters of assorted breads with balsamic vinegar , burrata and vine tomatoes, really tasty , the chicken skewers were also some of the best I have tasted and the other mains of lamb cutlets and a vegetarian quinoa also received very well , the desserts , creme brulee , seasonal tart and pot au chocolat were amazing. A very good lunch in a very hospitable restaurant , what made it even better was our waitress Mary , always smiling always helpful , a credit to the restaurant. Thank you.", "date_of_review": "25 June 2016"}
{"review_id": 213, "restaurant_id": -8, "username": "MKRach", "date_of_visit": " June 2016", "rating": "3", "title": "Nice location very disappointing food", "comment": "Booked a table at rooftop, table wasn't ready for lunch and glad to wait for it to be set. Ordered cocktails - very good! The food was disappointing, with a small menu expectations were high for quality.  Quinoa salad for starter was very average. Three of the group ordered chicken kebabs. One was sent back other two barely touched. The kebab was a mixture of breast and dark meat. Served at a tepid temperature and the texture was very unappealing.  Service ok, but again expected a bit more considering the prices. Would go back for the roof terrace and cocktails but many places better to eat.", "date_of_review": "27 June 2016"}
{"review_id": 214, "restaurant_id": -8, "username": "I2142WFstevew", "date_of_visit": " June 2016", "rating": "3", "title": "Good but not quite good enough", "comment": "Had lunch, nice roof top setting, decor a little tired, comfortable outside area, bit squashed up inside. Food was good, well cooked and tasty, pricing was reasonable for London, slightly disappointed with the service, slow with the drinks and did not feel they paid enough attention around.  We enjoyed our meal and on another day they might get it all right.", "date_of_review": "28 June 2016"}
{"review_id": 215, "restaurant_id": -8, "username": "robinjk2015", "date_of_visit": " May 2016", "rating": "2", "title": "Lousy Service with great views", "comment": "We had booked a table for 2 on the terrace on sunday evening and were looking forward to our visit. Unfortunately what should have been an enjoyable dining experience was let down by poor service due to a lack of waiting staff. It seemed there was only one waitress covering the entire area. We had to ask for menus, nobody came for 10 minutes to take our first drinks order and we had to play 'let's try and flag down the staff'. After we had finished starters nobody came to take away our plates until again we flagged down staff. The food was average and not worth the premium price. After dinner we realised that we had enough and decided it would be quicker to go home for dessert. The waitress apologised at the end of the evening and said she was 'run off her feet'. I don't blame her it was management that needed to properly staff the restaurant. Trying to cut corners simply backfires, you create a poor customer experience and potential repeat customers like ourselves will not go back.  I asked the waitress about the service charge at the end and if she gets it - it was shared by all staff. I asked her to take it off the bill and instead I gave it to her in cash for herself. She was very happy, she did try her best so I felt she deserved it, it was management's failure to staff the restaurant which was the issue combined with average food which was not worth the premium.", "date_of_review": "16 July 2016"}
{"review_id": 216, "restaurant_id": -8, "username": "Colette G", "date_of_visit": " May 2016", "rating": "2", "title": "A disappointment", "comment": "I was so looking forward to going to Boundary. We had lunch at the rooftop. The food is overpriced for what you get, it's nothing special. we paid almost £80 for a shared starter, two mains and non alcoholic drinks. The salmon crostini was good, my main chicken skewers, I later learned weren't cooked properly as I had a bout of food poisoning later that night. They bought out a fruit tart for dessert which had mouldy raspberries on. I would say avoid. If you want to go for the view then drinks at the bar are advised, or the actual restaurant might be better.", "date_of_review": "10 July 2016"}
{"review_id": 217, "restaurant_id": -8, "username": "Brk1790", "date_of_visit": " July 2016", "rating": "2", "title": "You can do SO much better - terrible food/drink for value", "comment": "Visited Boundary rooftop for a friends birthday on Saturday and was really disappointed with our experience there. Don't usually write reviews for London restaurants unless I feel especially passionate about my experience... And for the value, this really was up there axone of my worst restaurant experiences in the city! Chosen primarily for it's rooftop, we got lucky with the weather and booked a table for 8pm for a group of six. We were given a table under the canopy which meant our view was largely obstructed and I have to say, it's not really THAT nice of a cityscape in London. Think you could do better at another rooftop bar or restaurant. The service was super slow - we didn't get asked for a drink order for half an hour, although I do have to say the waitress we did have WAS very charming and seemed rushed off her feet.  Looking at the prices, we expected big things. The cocktails (cheapest at 10.50) were honestly nothing above average, like REALLY average (didn't help we'd just come from Sky Garden where the cocktails were the same price and pretty spectacular - highly recommended.) The menu is shalier on the rooftop and we ordered bread and olives. Olives were probably the highlight of the whole meal! Majority of us ordered the rib eye steak and wow, were we disappointed. All ordered medium rare, they arrived all rare - mainly because they were flame grilled so they were burnt on the outside and raw in the middle. We muddled through, coating it in the bernaise sauce and alioli and chips (alioli was good!) Mine steak was 50% though, and when you are paying £27 for a steak (not including a side) you expect it to be a good, tasty cut. Considering the likes of Hawksmoore, Gaucho and Goodmans you can get a basic cut at £20... I was really disappointed at how awful this was.  I NEVER complain (too British) but my friend took the liberty for me and I have to say, they did more than some restaurants might. Admittedly what I wanted was some money knocked off the steak, but they instead offered free desserts for the table. And to their word, they gave us one of every dessert, which made for a nice treat at the end (though did spoil the birthday cake we had but thats sods law.) I cannot stress more that you can do SO much better for your money in London. At a stretch it's nice for a drink on one of the sofas on the main rooftop, but I'd steer clear of the food.", "date_of_review": "25 July 2016"}
{"review_id": 218, "restaurant_id": -8, "username": "elilsiva", "date_of_visit": " July 2016", "rating": "1", "title": "Slow...and just service was awful", "comment": "Like another reviewer wrote below its the little things that add up. Took my fiance here for his birthday as he wanted to go to a rooftop bar. Atmosphere was only plus point.  We got drinks - second round had to ask for a drink they forgot even though it was repeated as they took the order Asked for condiments for starters - waiter acknowledged and never bought it to us Asked for tissues for hands as we ate the starters that didnt arrive either. Asked for the bill -waiter said yes took more than 15 minutes watching him walk around, till I realised I had to ask someone else. As soon as a waitress came with the bill I asked to straight away rather than wait any longer. Whats worse is there were plenty of staff. Either chit chatting away or just dont know what they are doing.  4 hendrick cocktails, chips, 2 desserts £80 including service which wasnt even deserved but I paid regardless. DESSERTS TOTAL WASTE OF MONEY - overly priced for sure.", "date_of_review": "20 July 2016"}
{"review_id": 219, "restaurant_id": -8, "username": "Alison A", "date_of_visit": " May 2016", "rating": "1", "title": "Nice views but not worth the visit :(", "comment": "My husband and I visited the Boundary rooftop restaurant for our anniversary. I ordered an expensive white wine which turned up warm, I was given ice and an ice bucket, not perfect but there was no other option. We were brought a glass of champagne each as a sorry. We ordered our food and our starters arrived and were delicious, especially the oysters. Then our mains arrived and my husband was given the incorrect order and my chicken skewers tasted burnt, so we promptly sent them back.  I was offered an alternative and my husband brought his correct order. I ordered the tuna as an alternative. This arrived 10 mins later and was completely raw, so I sent this back, it was again the wrong order and was meant for a different customer. I was then brought my correctly cooked tuna, which unfortunately tasted burnt again... I promptly sent this back as it was inedible! We were brought more champagne and a pudding between us as an apology, we got the bill and left. I was very disappointed with everything about our visit, the service, the quality of food and the lack of interest in our complaints. I have to point out that I am not a fussy eater at all and in fact, if food is edible I will eat it! As we left the manager did offer us a free meal to make up for the problems encountered. But to be honest if you have the choice of thousands of good restaurants in London go for one of those and just visit the Boundary for drinks on the rooftop bar..", "date_of_review": "23 June 2016"}
{"review_id": 220, "restaurant_id": -8, "username": "Oin", "date_of_visit": " May 2016", "rating": "3", "title": "Triumph of form over substance!", "comment": "We had dinner on the rooftop to celebrate a birthday. Despite having completed the special information section on the booking form, this went unnoticed. The service was slow and disorganised with too many \" managers\" wafting around and too few doing the grunt work. We had to ask to be served and the table wasn't cleared between courses. The food was okay, but very plain with little in the way of presentation. Our white wine, when it eventually arrived, was warm. Clearly a very popular spot, but needs to get the basics right.", "date_of_review": "26 May 2016"}
{"review_id": 221, "restaurant_id": -8, "username": "lukeh455", "date_of_visit": " May 2016", "rating": "2", "title": "Disappointing", "comment": "Came here for the rooftop bar. Queue was short but took ages, a man in a suit came out with a clipboard asking how many of us there were and advised us it was one in one out as they were busy. It all looked very professional and organised and after a 20 minute wait and a few phone calls (presumably to the top floor) he said he had only large tables available so two pairs of us could sit at a large table which was fine with us and the couple behind us in the queue. So we went up the lift and when we got to the top literally nobody knew what was going on. The staff member that greeted us looked like she wasn't expecting us, and she said she only had small tables... So she squeezed us in where she could and gave us menus. We then ordered a couple of beers to be told they had run out of peroni at 5pm on a Saturday... So I had to have a small bottle of Meteor, which is French, and tasted awful. And it cost £5. They could do so much more with it, but they insist on putting potted plants everywhere, half of which are dead, that take up space that I think would be better used with stand-up tables or something. Views are quite good. Not somewhere I'll be going back to.", "date_of_review": "29 May 2016"}
{"review_id": 222, "restaurant_id": -8, "username": "GeorgeS2969", "date_of_visit": " May 2016", "rating": "5", "title": "Good choice", "comment": "Nice food and nice atmosphere. We were able to enjoy the terrace without disconfort due to the weather. Good service as well .", "date_of_review": "29 May 2016"}
{"review_id": 223, "restaurant_id": -8, "username": "LondonSupperClub", "date_of_visit": " June 2016", "rating": "1", "title": "Should be so much better....", "comment": "Ate here with a group of ladies on a sunny Sunday recently and was looking forward to a long lunch: who knew how long. Every round of drinks we had to get up and go looking for a waiter/waitress and the food - when our order was eventually taken and it arrived - was very disappointing. A £12 sharing platter of smoked salmon crostini was essentially out of a packet, with crème fraiche that looked like it had been thrown at the plate from a great height across just six 'crostini' the size of a ten pence piece. Mains were bland and took an hour to arrive after repeatedly asking to order. This is a great space that should be so much better. Won't be returning.", "date_of_review": "6 July 2016"}
{"review_id": 224, "restaurant_id": -8, "username": "Dimitris V", "date_of_visit": " May 2016", "rating": "5", "title": "We had a great time!", "comment": "Great food, great views and amazing service- very attentive and kind waiters! Will definitely go again soon. Make sure you sit outside if the weather is good!", "date_of_review": "28 May 2016"}
{"review_id": 225, "restaurant_id": -8, "username": "Beth S", "date_of_visit": " June 2016", "rating": "4", "title": "A little slice of France in London", "comment": "Visited this weekend with a group of friends. We’d originally booked a table inside but decided to swap this for the terrace because the weather was lovely (for once!). The service was good - attentive without being overbearing - and the Provence rose was delicious. The menu offers a good selection of sharing plates too. The roof terrace gets very busy in the late afternoon so would suggest going early to avoid disappointment.", "date_of_review": "6 June 2016"}
{"review_id": 226, "restaurant_id": -8, "username": "clairef672", "date_of_visit": " May 2016", "rating": "2", "title": "Terrible Disorganisation Spoiling a Beautiful Venue", "comment": "My boyfriend and I visited Boundary Rooftop on Saturday night for my birthday. We had booked a table at 9.15pm but when we arrived, we were treated as though we didn't have a booking. We were left to stand around for around 15 minutes while they tried to get us a table, and we felt very much in the way (other people were being asked to wait too). The head waitress/manager (not sure which) then asked if we would mind sitting outside for a while and having a drink until another table finished up. This was actually fine by us - it was still warm outside and the terrace is beautiful. However once again we were left waiting around and by 10pm we still didn't even have a drink despite bringing it to the attention of the waiter. The head waitress then came back and apologised, and asked if we would like to order our food. She said that by the time the food arrived our table would be ready. We ordered the food which then arrived to our outside table, because the table indoors was STILL not ready. I complained and we were finally moved indoors - bearing in mind this was over an hour after we had booked a table. Our food order was also wrong but we couldn't be bothered to get someone's attention to fix it. The whole team were completely disorganised and we heard them being quite rude to each other - they were obviously stressed. On a positive note the restaurant itself is beautiful - with lovely lights and views over the city. Overall I will not be returning -. I would encourage the staff to visit the Ivy Garden or Balthazar to see how they should be treating their customers.", "date_of_review": "31 May 2016"}
{"review_id": 227, "restaurant_id": -8, "username": "andibabey", "date_of_visit": " June 2016", "rating": "5", "title": "A must do on a sunny day!", "comment": "Just popped in here for a quick glass of rose and some nibbles in the sun, and thought I had to go on trip advisor and comment on how great the place was. Purely all down to the fact that on a sunny day they were offering out sun cream to all there customers - how thoughtful is that?! It's little things like that you remember. As usual the Italian breads were scrumptious, the waiters ever polite and attentive and the morrocan rose a delight! If you're in shoreditch and its a sunny day - make your way here ", "date_of_review": "6 June 2016"}
{"review_id": 228, "restaurant_id": -8, "username": "londontravellerE2", "date_of_visit": " July 2016", "rating": "2", "title": "Not what it used to be", "comment": "I must say I was quite disappointed by the Boundary Rooftop. I have been since last summer- for food that is, not just cocktails, and it really has gone downhill. The service was awful and the food was quite bland. I guess it's always the same in London, you either have great food or great views when it comes to the few roof terraces that around. One of the two always lacks and in this case, it is definitely the latter. I do enjoy going there for cocktails, its a haven away from Shoreditch and especially compared to Shoreditch house next door.", "date_of_review": "22 July 2016"}
{"review_id": 229, "restaurant_id": -8, "username": "snowkeil", "date_of_visit": " June 2016", "rating": "1", "title": "this restaurant is a pricey joke!", "comment": "We visited this restaurant because my friend visiting from other country wanted to experience the rooftop restaurant in london. We arrived here, ordered starters, oyster, ratatouille, seabream and lamb. Apparently here they served the soup with waiter's thumb as well; the ratatouille never been able to show up; and it took AGES to grill the lamb and it wasn't medium as the waitress suggested at all, it was totally well-done. We sent the lamb back and it came again in well-done. guess they only serve well-done food but not quality and service. Without saying they never bothered to lit up the fire to warm up the customers even if we told them we were cold. I feel so sorry for taking my friends to this pricey joke! The only thing I can say is 'Think twice before you wanna step in this fancy(at least the price part) rooftop restaurant'.", "date_of_review": "15 June 2016"}
{"review_id": 230, "restaurant_id": -8, "username": "ROUNDSPRING", "date_of_visit": " June 2016", "rating": "3", "title": "Good views, very average food", "comment": "Managed a drink on the roof terrace in a break between showers. Nice ambience, herbs growing in pots and beds around. Roof terrace restaurant is glazed and has sliding windows to give an open airy feel. Waiting staff ( with the exception of the Maitre d' who looked miserable and bored) very attentive. Food however very bland. We shared a mixed shell fish starter. Mussels, prawns, oysters,clams and crab which was good value but, with the exception of the oysters, totally tasteless. Main course Yellowfin tuna was totally overwhelmed by trying to make it look seared - it was also lacking in flavour. Chicken skewers were overcooked, dry and tasteless. The sides were ok but the chips were very hard. In summary disappointing meal which did not live up to the surrounding. 3 courses with wine approx. £100 per head", "date_of_review": "23 June 2016"}
{"review_id": 231, "restaurant_id": -8, "username": "Genty83", "date_of_visit": " May 2016", "rating": "2", "title": "Excellent place, ill-mannered staff", "comment": "It's shame that such a beautiful rooftop is ruined by a very ill-mannered staff. My friends and I couldn't stand the blond lady at the reception: cold, stuck-up, unhelpful. She did her best to complicate our bday party. Utterly unpleasant.", "date_of_review": "22 May 2016"}
{"review_id": 232, "restaurant_id": -8, "username": "laurella76w", "date_of_visit": " March 2016", "rating": "4", "title": "Great roof top bar", "comment": "We visited the bar on Sunday afternoon. We were greeted by friendly staff and said we were popping in for drinks only. We were seated without fuss and given a menu. We enjoyed a lovely bottle of rose wine. Very good. We would definitely return especially in the summer when we can sit outside.", "date_of_review": "29 March 2016"}
{"review_id": 233, "restaurant_id": -8, "username": "Maridrizzle", "date_of_visit": " April 2016", "rating": "5", "title": "Roof Top Terrace- Say no more", "comment": "Boundary is located in the heart of Shoreditch with all its colourful and quirky street art. Boundary is a great place to get away from the noise and the bonus? There is a roof top terrace. The atmosphere is great and the staff are very friendly. I would recommend booking a table in advance especially in summer. The drinks are amazing and so is the food. However, it is a bit pricey and there is not much to choose from the menu. I will defiantly return in the future", "date_of_review": "11 April 2016"}
{"review_id": 234, "restaurant_id": -8, "username": "P_W68", "date_of_visit": " May 2016", "rating": "3", "title": "Good venue, disappointing service", "comment": "Had lunch in the rooftop restaurant, a great location though on this occasion very noisy thanks to a large, rowdy birthday party. Little the restaurant can do about that. Food and wine menu aren't extensive but a good selection. We ordered starters and main and waited and waited - service was very slow. For main we ordered a deluxe fruits de mer but only got the basic version (minus lobster) although we were charged for it until I complained. It's a shame because all the ingredients are there for a great experience. Unfortunately the execution is pretty ordinary. I hope they get the service right, then they might be onto something good", "date_of_review": "1 May 2016"}
{"review_id": 235, "restaurant_id": -8, "username": "Sophie S", "date_of_visit": " May 2016", "rating": "5", "title": "Great time on the roof top", "comment": "We went with 4 friends yesterday for dinner in this rooftop in Shoreditch and we all had a fantastic time.  Very efficient and friendly service, great atmosphere and music.  I had a very nice grilled rib eye and a very good strawberry tart.  I loved as well the super refreshing cocktails.  Highly recomended!!!", "date_of_review": "8 May 2016"}
{"review_id": 236, "restaurant_id": -8, "username": "Victoria D", "date_of_visit": " May 2016", "rating": "5", "title": "Amazing lunch on the terrace", "comment": "I had a great lunch on the Boundary rooftop with friends. The service was perfect thanks to Serena, a very nice and thoughtful waitress. The food is very good, we had the beautiful Mediterranean board to start, then seafood. Everything was excellent. Very nice ambiance with shiny happy people and a lot of rosé wine!", "date_of_review": "7 May 2016"}
{"review_id": 237, "restaurant_id": -8, "username": "Wilfried B", "date_of_visit": " May 2016", "rating": "5", "title": "Good Time on the rooftop", "comment": "I had a Wonderful time in shoreditch with my girlfriend. The Place is warm and the view is just fantastic. The service was really nice thanks to Aurélie a lovely french waitress. Seafood and cocktails all good.", "date_of_review": "10 May 2016"}
{"review_id": 238, "restaurant_id": -8, "username": "BelleReviews", "date_of_visit": " June 2015", "rating": "4", "title": "Gorgeous views from the rooftop bar", "comment": "This review is just for drinks at the rooftop bar. We didn't book, had to wait about 5/10 minutes and then we were up in the lift to the rooftop bar. They wait until seats / tables are available to let you up, I think this is a great idea as it's not absolutely rammed, it means everyone has a seat and can enjoy the view. Drinks are a little on the pricey side but table service was prompt and the whole experience was lovely so we didn't mind.", "date_of_review": "15 May 2016"}
{"review_id": 239, "restaurant_id": -8, "username": "Rikin P", "date_of_visit": " February 2016", "rating": "2", "title": "Flavourless and over priced.", "comment": "I don't mind paying ~£30 for a fondue or raclette, however they were both extremely plain. The fondue didn't have any flavour - no garlic, kirsh etc. The pickled onions were bland too! The venue and the service was good - good views across London.", "date_of_review": "4 February 2016"}
{"review_id": 240, "restaurant_id": -8, "username": "H-Bette", "date_of_visit": " February 2016", "rating": "3", "title": "Average food, great ambience!", "comment": "My friend and I came here for lunch, we really enjoyed the surroundings and even though we came on a rainy day the rooftop restaurant was still very airy and light. I will definitely be returning in the summer to make use of the outdoor seating area for drinks! Disappointed with the food...I ordered the chicken skewers and for the price we paid would expect good cuts of breast meat but instead we got chunks of brown meat with lots of gritty bits running through it... Such a shame as would expect a place like the boundary to use the best cuts of meat, very bland. I have heard the seafood platter is incredible so maybe stick to the fish if you do visit for food.  Service was good, we were served by two women both very friendly and welcoming! Will return in the futures for drinks on the rooftop but will definitely skip the food menu, plenty of better eateries in the area...", "date_of_review": "21 February 2016"}
{"review_id": 241, "restaurant_id": -8, "username": "Stubsy7", "date_of_visit": " January 2016", "rating": "3", "title": "Nice but lacking in any atmosphere or soul", "comment": "Food was v nice but the venue lacks any real substance. Had a lunch with some associates and only us and 2 other tables In the restaurant. Waitress/hostess was dressed for the office rather than as a server of food. Had the chicken skewers and fries all v tasty but presentation was slightly bland - v beige. Would like to dine on a busy summers lunchtime and see if the ambience improves massively.", "date_of_review": "17 February 2016"}
{"review_id": 242, "restaurant_id": -8, "username": "AmonaV", "date_of_visit": " February 2016", "rating": "5", "title": "Pre Birthday dinner with friends", "comment": "What a great place, not to big, on the rooftop, quite intimate, excellent food. Red wine is a bit expensive but delicious.  I had the seafood sharing platter and the lobster, so yummy. Would definitely return for a special occasion!", "date_of_review": "9 February 2016"}
{"review_id": 243, "restaurant_id": -8, "username": "Susan D", "date_of_visit": " February 2016", "rating": "3", "title": "Left underwhelmed", "comment": "I booked to have dinner to celebrate my birthday here and I have to say it was a disappointing experience. The set up on the rooftop is really lovely and atmospheric and I can imagine it looks great at night with all the lights - the view from the rooftop is not much at all - just other rooftops! Service was patchy - we were seated and then were waiting ages to be given menus - I had to request them in the end. The staff were friendly but appeared to be overstretched. The food itself was very average. I had the rib-eye steak - nothing to write home about - and there was only one sauce option given (bernaise) whereas I'm a fan of peppercorn. However my Dad ordered chicken skewers with tzatziki and spring onions which was very tasty. Once again the staff didn't notice when we had all finished our plates to clear them away, so I had literally had to call their attention again. When I made the booking I made them aware that I was celebrating my birthday but I have to say none of the staff made me feel special like other restaurants do. I would go back to this place purely for a more casual affair of drinks with friends or maybe brunch.", "date_of_review": "28 February 2016"}
{"review_id": 244, "restaurant_id": -8, "username": "Gemma V", "date_of_visit": " February 2016", "rating": "2", "title": "You're paying top price of the views", "comment": "There is no denying that the location and views from the rooftop are stunning. From different sides of the terrace you can see over london which is difficult to find in the centre. However having booked a table for dinner to celebrate my birthday I found the food overpriced and disappointing.  I ordered the Tuna steak, which was \"ok\" but only ok and for £18 for only the steak I was left underwhelmed. The biggest disappointment was for my poor vegetarian friends who were presented with 1 main meal option of just vegetables for £17!! all main dishes were only the main story with a small garnish. Potatoes/vegetables were an additional charge. The staff were polite, helpful and attentive. It's just such a shame the food is so overpriced and underwhelming.", "date_of_review": "23 February 2016"}
{"review_id": 245, "restaurant_id": -8, "username": "MaksymS313", "date_of_visit": " February 2016", "rating": "2", "title": "Place worth the terrace drinks only", "comment": "Very poor service and low quality food. Food is overpriced.  Staff is extremely slow and inattentive.  There is an open kitchen and we were sitting next to it observing awful sanitary measures and chef touching with his fingers everything from his mouth and nose to laying out seafood on a plate. I would recommend this place for outside evening drinks on a terrace only.", "date_of_review": "28 February 2016"}
{"review_id": 246, "restaurant_id": -8, "username": "BradRevell", "date_of_visit": " March 2016", "rating": "4", "title": "Rooftop experience was good, service could have been a little better", "comment": "First time at the the boundary rooftop restaurant with some friends of ours in from Germany. Found it via an article of the best rooftop bars; think it rated about 5 or 6. We arrived at 12:30pm on a Sunday and it was very quiet until about 2pm when most tables were full. The service was okay and in reading some of the other reviews, this kind of aligns. We and appetisers, mains along with cocktails, beer and wine. All the food was very good. Nothing ultimately blew us away though. The location itself is nice at the top of the hotel. There is both an inside and an outside location. Given it is winter we were glad we went inside. Also helped it was a beautiful winter day with lots of sun. The only other thing to keep in mind is that the entrance is not on boundary street but around the corner.", "date_of_review": "14 March 2016"}
{"review_id": 247, "restaurant_id": -8, "username": "Chrysteria64", "date_of_visit": " February 2016", "rating": "2", "title": "Roof top", "comment": "Being in the area and craving for pudding, my friend and I decided to go up to the roof top for a little treat. It was a nice day and the setting was perfect. We ordered the ice cream and the tarte aux myrtilles to share. The ice cream (£6.50) consisted of 3 tiny little balls of below average quality. The tarte aux myrtilles (£7.5) was industrial and tasted of absolutely nothing. The texture was off. We complained to the waitress and sent them back. She offered us ONE chocolate mousse as a replacement saying that it was homemade. It came after a good 20min wait... it was ok, but I really didn't fancy a chocolate mousse and that had spoiled the whole magic.. To be fair, the manager came to speak to us and was apologetic. He took the desserts off the bill which was appreciated, but the service charge was still there.. I cannot understand how they can serve such disappointing desserts when they have the Albion downstairs!! I would go again on a nice day as the views are good, but just for cocktails.", "date_of_review": "29 February 2016"}
{"review_id": 248, "restaurant_id": -8, "username": "175simone", "date_of_visit": " March 2016", "rating": "4", "title": "What a lovely surprise", "comment": "On the edge of the City off shortdich high st. Boundary can be found. Via an unassuming door your greeted by a very welcoming hostess who helpfully told me to press \"T\" for top in the elevator. How lucky to have a joyful London Springtime sunny afternoon. The environment is just perfect. Unpretentious, simple yet comfortable furniture all with a relaxed style. The waiting personal friendly and very willing to offer suggestions and advise if sought. I ordered a glass of Savignon, my guest stayed with complimentary water. We both enjoyed early in season asparagus with a delicate hollandaise. I had the Mediterranean chicken kebabs on taziki with a garden salad. My guest selected the Fresh Tuna. Which was cooked perfectly \"just as I wanted\" exclaimed my guest.  We had some Mediterranean breads with oil etc on the table. In the sunshine we felt we could be abroad. Wonderful service by a waiter who ensured we never had a need to wait or ask He was just so effective and efficient.  I will definitely be returning to Boundary for another relaxed non-fussy meal.", "date_of_review": "22 March 2016"}
{"review_id": 249, "restaurant_id": -8, "username": "Masud A", "date_of_visit": " May 2016", "rating": "4", "title": "Great ambience and staff but overpriced", "comment": "Excellent rooftop place, well maintained and decorated. Staffs are very helpful and jolly. Foods are overpriced for average quality.", "date_of_review": "20 May 2016"}
{"review_id": 250, "restaurant_id": -8, "username": "pwadadar", "date_of_visit": " May 2016", "rating": "4", "title": "Birthday meal at the terrace in Boundary restaurant", "comment": "Lovely restaurant with great food. Recomended highly for a evening family meal. Delicious food huge portion which is not common in London. Great ambience. I would give it a 5 star rating it's just they could not serve us any dessert. So was not very happy and hence 4 star. Certainly a great place to be. ", "date_of_review": "21 May 2016"}
{"review_id": 251, "restaurant_id": -8, "username": "Victor P", "date_of_visit": " December 2015", "rating": "5", "title": "Really nice moment", "comment": "We went there with some friends to have a drink on the rooftop. We were having such a nice time that we asked the waiters if it was possible to stay for dinner. Fortunately a table was available inside. The dinner was even better than the drinks. The veranda is cosy, the service was perfect. My fiancée and I are getting married in London this summer and planning to to celebrate the wedding there. Definitely one of the best rooftops in London.", "date_of_review": "5 January 2016"}
{"review_id": 252, "restaurant_id": -8, "username": "LouiseS8", "date_of_visit": " October 2015", "rating": "5", "title": "Lunch on a roof top", "comment": "Fantastic view and great seafood platter for birthday lunch. Really cool building and friendly service too", "date_of_review": "16 October 2015"}
{"review_id": 253, "restaurant_id": -8, "username": "jasonbR9585XT", "date_of_visit": " October 2015", "rating": "3", "title": "Not bad....", "comment": "We visited the restaurant up top. Was a nice place with great surroundings. Food was good quality but wasn't sure it was worth the extortionate prices. There was nothing wrong with it but wasn't quite exquisite food. I would definitely visit again but probably mainly for drinks.", "date_of_review": "30 October 2015"}
{"review_id": 254, "restaurant_id": -8, "username": "Michaela S", "date_of_visit": " September 2015", "rating": "5", "title": "Lovely place with friendly staff", "comment": "Great atmosphere with lovely view. Staff is frienldy form hostess to managers and waiters. You can feel that peole working there enjoy their job. Lovely food for good value. Great place for dinner or lunch on sunny terrace. very well managed.", "date_of_review": "7 October 2015"}
{"review_id": 255, "restaurant_id": -8, "username": "NMB212", "date_of_visit": " November 2015", "rating": "4", "title": "Rooftop is lovely, a shame about the terrible hotel reception staff", "comment": "We wanted to come for a late Sunday lunch - I checked on opentable and there were tables available so I didn't bother to book as we were only 10 minutes away. On arrival, the hotel reception staff told us there were no free tables on the roof. When I mentioned about the opentable availability they said I would have to talk to the restaurant downstairs about it. As I got out my phone to check that I hadn't made a mistake, another member of the hotel staff asked us to move out of the reception as it was for hotel guests. Long story short, there was a table free, we had a delicious lunch on the roof and the rooftop staff were charming. The grilled tuna was especially good. What a pity about the very rude hotel reception staff.", "date_of_review": "2 November 2015"}
{"review_id": 256, "restaurant_id": -8, "username": "BaumanTS", "date_of_visit": " November 2015", "rating": "2", "title": "Less than average food, bad service, good wine", "comment": "Been there yesterday night at dinner on the rooftop - the view is great but I was expecting way more re food quality and service, considering pricing, location and status of the restaurant. The Mediterranean starter would better fit a whatever bar or veg cafe than a Restaurant. The fish platter was nothing but fair - you can find way better quality around. Out of the whole selection of seafood and fish I would only save the Tuna. Waiters and chefs were chatting and laughing all the time, definitely not the quality standard I was expecting. We also had a bottle of french wine which we appreciated a lot. I wouldn't suggest it as a place for dinner, wouldn't go again - if not for a quick cocktail on the terrace at sunset.", "date_of_review": "26 November 2015"}
{"review_id": 257, "restaurant_id": -8, "username": "florian610", "date_of_visit": " December 2015", "rating": "5", "title": "Classy restaurant with spectular roofterrace", "comment": "What I love most about the roof terrace is that it is quite small, which gives it a more familiar atmosphere than other roof terraces around.  There are inside tables on the top as well, so when it starts raining you can move inside. For food we had seafood, lamp chops and Languedoc white wine. Well recommended! Service was fantastic as well what I love about the roof terrace", "date_of_review": "12 December 2015"}
{"review_id": 258, "restaurant_id": -8, "username": "thefranz", "date_of_visit": " October 2015", "rating": "5", "title": "Great Food / Vibrant Place", "comment": "Rooftop is absolutely Amazing ! My wife and I were delighted by the food, service and the place :) I would definitely recommend this restaurant", "date_of_review": "5 January 2016"}
{"review_id": 259, "restaurant_id": -8, "username": "Ambre S", "date_of_visit": " January 2016", "rating": "5", "title": "amazing rooftop in the middle of London", "comment": "I went there to celebrate NYE with my a couple of friends and we had a wonderful time there, we had dinner in the veranda on the rooftop, the food was delicious (we shared some oysters, I had the sea bream which was perfectly cooked and my friends had the lobster) and the staff very nice and cheerful, there was also a DJ for the night and the music was great, it's really unreal to have such a place in the middle of London! I haven't been yet but there is a deli shop downstairs and they apparently sell fresh and seasonal produces, my friend told me they make incredible scones. Definitely saved on my list.", "date_of_review": "5 January 2016"}
{"review_id": 260, "restaurant_id": -8, "username": "Victoria D", "date_of_visit": " December 2015", "rating": "5", "title": "Outstanding Dining Experience!", "comment": "A friend advised me this restaurant on the rooftop so I took friends to celebrate New Year's Eve. We spend one of our best New Year's Eve party ever. Great Dj, fabulous food, brilliant service and an unique experience for ourselves. We had an excellent lobster and we enjoyed the music and the very nice view. All in all, great food and super nice atmosphere, very Shoredicth!", "date_of_review": "5 January 2016"}
{"review_id": 261, "restaurant_id": -8, "username": "antaninak", "date_of_visit": " August 2015", "rating": "5", "title": "Romantic rooftop bar", "comment": "it's really nice to be there, as if you are getting away from the crowds and busy streets of London and can enjoy the perfect view of the city, sip your drink and just chill out. Very romantic!And highly recommended", "date_of_review": "19 August 2015"}
{"review_id": 262, "restaurant_id": -8, "username": "Lutijen", "date_of_visit": " August 2015", "rating": "4", "title": "Relaxing roof top restaurant", "comment": "Sea food platter was fresh and absolutely delicious. They have friendly staff and some views of Shoreditch.", "date_of_review": "20 August 2015"}
{"review_id": 263, "restaurant_id": -8, "username": "Adiba M", "date_of_visit": " August 2015", "rating": "5", "title": "Great rooftop in Shoreditch!", "comment": "A great spot for lunch, drinks or hanging out with friends. All located in the heart of Shoreditch and privately tucked away.", "date_of_review": "22 August 2015"}
{"review_id": 264, "restaurant_id": -8, "username": "Liz M", "date_of_visit": " August 2015", "rating": "4", "title": "Go to watch the sunset!", "comment": "Found the website after searching for rooftop bars in London. As you couldn't book a table in advance, I naively thought that we could just rock up and be seated, casually, so we arrived at 8pm to find a queue outside the door! We queued for about 45 minutes, but you know what? It was really worth it. We were just in time to see the sun set over Shoreditch, the views were excellent. The food was delicious. Half price off seafood on Sundays, so my OH got oysters and half a lobster for a very reasonable price!", "date_of_review": "28 August 2015"}
{"review_id": 265, "restaurant_id": -8, "username": "Clalala1988", "date_of_visit": " September 2015", "rating": "5", "title": "Amazing rooftop un shoreditch", "comment": "We were at boundary's rooftop with couple of friends for the lunch ! It was amazing : the view, the service, and the food of course ! A very great experience in London in a wonderfull place ! I wish i will be lucky to test the hotel one day ", "date_of_review": "20 September 2015"}
{"review_id": 266, "restaurant_id": -8, "username": "Ilaudj", "date_of_visit": " September 2015", "rating": "4", "title": "Great view, perfect for a sunny day", "comment": "I had a really nice time serving lunch at the Boundary Rooftop Restaurant. The view is great and also having the sun on our side made the experience great. The food was good, and i can recommend the selection of cheeses. Also they have a variety of wines that you can choose from. I definitely recommend going there on a sunny day, i willbe a boost of energy and good vibe.", "date_of_review": "7 October 2015"}
{"review_id": 267, "restaurant_id": -8, "username": "heatherk953", "date_of_visit": " August 2015", "rating": "1", "title": "Poor service", "comment": "I came here for drinks on the rooftop and was left disappointed by the service to say the least. We had to ask twice to order drinks by a waiter who had a very carefree, blasé attitude towards us and seemed to be more interested in a group of loud, drunken ladies then serving others. Staff seemed to just be hanging around, laughing instead of serving. We then had to wait nearly 15 minutes for our drinks. Shame really as the actual rooftop area is lovely. And they seemed very eager for people to pay the bill!", "date_of_review": "30 August 2015"}
{"review_id": 268, "restaurant_id": -8, "username": "carlosalbertotc", "date_of_visit": " September 2015", "rating": "4", "title": "Great place for drinks", "comment": "We went to the terrace of this place on a Sunday afternoon without any reservations and it was no fuzz at all to enter. There was a great cocktail list ambiance", "date_of_review": "21 September 2015"}
{"review_id": 269, "restaurant_id": -8, "username": "113michellep", "date_of_visit": " September 2015", "rating": "4", "title": "very nice place!", "comment": "Very good and friendly service. Wonderfull view over London. The atmosphere is very class. Excellent to have a drink and enjoy London.", "date_of_review": "21 September 2015"}
{"review_id": 270, "restaurant_id": -8, "username": "Churr0s", "date_of_visit": " September 2015", "rating": "5", "title": "Service above and beyond and a lovely place", "comment": "We’d gone to London on a Sunday morning to the Columbia Road flower market. We were wandering back to meet some friends and had a couple of hours to spare. For no apparent reason we felt like oysters so I did a quick google and the nearest place that did them was the Boundary Terrace. Only snag was they didn’t open until 1230 for lunch and it was only just 11. We went anyway to see if there was any chance of getting served earlier and the absolutely lovely receptionist called up to the restaurant and asked if they’d be able to help.They agreed and we had a fantastic and very good value half dozen oysters and an excellent coffee, sitting on the gorgeous terrace with its big comfy sofas, plants, views across the city and really luxe cutlery and napkins. The service was brilliant and I’d heartily recommend Boundary to anyone. They certainly made our morning.", "date_of_review": "22 September 2015"}
{"review_id": 271, "restaurant_id": -8, "username": "DoorOneLeft", "date_of_visit": " June 2015", "rating": "1", "title": "Very bad service", "comment": "Duty manger rudely made excuses roof was full after some rain, eventually allowed up to roof and it was empty! Table staff were very rude and arrogant and felt as though were doing us a favour, wiping the chairs off after rain. Spoilt whole experience as it was first visit as made to feel as if we were an inconvenience.", "date_of_review": "13 June 2015"}
{"review_id": 272, "restaurant_id": -8, "username": "cyclistoflondon", "date_of_visit": " June 2015", "rating": "5", "title": "Great rooftop", "comment": "Yes it's slap bang in the middle of whoreditch and everyone has a trendy beard. But ignore that for a second and you'll find being on a rooftop in the sunshine in the centre of things is quite a nice place to be.", "date_of_review": "17 August 2015"}
{"review_id": 273, "restaurant_id": -8, "username": "evagoinground", "date_of_visit": " June 2015", "rating": "3", "title": "nothing special", "comment": "it is a nice rooftop in shore ditch , but if you not find a couch or a place near the balcony it's nothing really nice even the view is ok but nothing special as well , i had a few sharing drinks expensive and not even that nice. In general i think there are planty other choices in london than boundary", "date_of_review": "1 July 2015"}
{"review_id": 274, "restaurant_id": -8, "username": "Buckstermonkey", "date_of_visit": " June 2015", "rating": "3", "title": "Buzzy with a nice atmosphere...but....", "comment": "Great place to meet up with friends and family in the heart of Shoreditch. Staff friendly and a great selection of food and drink to choose from...but.....Service was painfully slow. Not a place where you would go on a Saturday morning for a quick bite to eat then move on. Thank God the company was good! However, if a leisurely brunch is your type thing with time to kill - recommended", "date_of_review": "28 June 2015"}
{"review_id": 275, "restaurant_id": -8, "username": "186dm", "date_of_visit": " June 2015", "rating": "5", "title": "Superb!", "comment": "Great food, service & atmosphere. Expensive but the rooftop restaurant is fab. We spent an enjoyable afternoon in the sunshine celebrating 2 birthdays. Anything bad? Not really, the rose wine could have been a bit colder...", "date_of_review": "27 June 2015"}
{"review_id": 276, "restaurant_id": -8, "username": "AmyA26_12", "date_of_visit": " July 2015", "rating": "1", "title": "Pretentious and Unwelcoming", "comment": "I was meeting a friend for a drink and she suggested this bar as it was a glorious hot day and drinks in the sun sounded idyllic. I arrived first to secure a table and was told all tables were taken and if I wanted I could wait. I asked how long it was likely to be and was given a very sarcastic answer by the receptionist along the lines of I don't know how long it'll take people to drink their drinks. Not the best first impression but I thought ok I'm prepared to wait so went to sit down on the chairs next to the desk. I was immediately barked at that I couldn't sit there, they were only for guests of the hotel and I'd have to queue outside. The hotel reception was empty and it was boiling outside and I thought I might faint if I had to stand for any prolonged period of time. I therefore asked why I couldn't sit there when I may not be a guest of the hotel but I would be a guest of the establishment and if the hotel reception was busy I could see it might be an issue but it wasn't. I was given a response of 'you're not entitled to sit there' and made be feel like I wasn't good enough to be in the hotel reception. I've never been so unwelcome in an establishment. It's pretentious and just because it's the in place doesn't mean it gives people the right to be rude. I'd avoid at all costs. There are so many bars to choose from that are friendly and welcoming. Needless to say I won't be back.", "date_of_review": "2 July 2015"}
{"review_id": 277, "restaurant_id": -8, "username": "Casperbigom", "date_of_visit": " July 2015", "rating": "1", "title": "Worst place to spend money", "comment": "Me and my friends found this place in here, and thought: Wow that is good ratings, lets try that.  We waited in line for a table in 2,5 hours. When we got up on the roof terrace they didn't ask whether or not we wanted food. We had to push them to give us a dinner table.  Dinner was horrible. The bruschetta starter was a joke (six dry pieces of bread with just a cut-in-half tomato on top - £10). The beef that come after was good, but NOT because of them. When ordering these £24 babies, they didn't even care to ask how we wanted them done. We asked for medium-rare. They came done. Fries and sauces was not good. The beef was tender (but this is out off there control). The view wasn't even good. Overall: Don't go here. There are so many great places in London don't waste your pounds and time.", "date_of_review": "8 July 2015"}
{"review_id": 278, "restaurant_id": -8, "username": "al1148", "date_of_visit": " August 2015", "rating": "5", "title": "A lovely afternoon!", "comment": "Came here on Saturday with my friend for some drinks and ended up staying 5 hours! It was such a lovely relaxing chilled atmosphere, not pretentious but still had a little more upmarket vibe (in a good way!). The staff were so friendly and polite and never once hassled us to order more drinks or food or made us feel like it was time to leave even though we had been there so long. We hadn't even booked a table and when we arrived there were only indoor ones available where we were sat but as soon as an outdoor one became available we were offered it and all our drinks etc were moved for us, considering we hadn't even booked a table i thought this was really great service! Its also nice that they don't just let people in when there are no tables available so you don't have people standing around your table and it doesn't feel crowded. This is a real gem in the heart of the city you would never know you are in London! Will definitely be returning.", "date_of_review": "10 August 2015"}
{"review_id": 279, "restaurant_id": -8, "username": "PeterWarren", "date_of_visit": " July 2015", "rating": "3", "title": "Enjoyed ourselves in rooftop restaurant but quite average service. Must do better!", "comment": "I'll try to be brief. Came here with friends on 22 July for a belated birthday celebration. First of all we had to wait 50 minutes outside in a queue to get up to the terrace! Don't think I've queued this long for any building in New York (think about it)! And it was fairly early evening around 6.15. So when we did get to the roof-terrace we were shown to some seats which were fine but waited a good 10 minutes for anyone to even offer us a drink or drink list. Probably a reason why the wait to get in is so long! There are enough staff so they need to fix this. Having said that, we really did have a good time and decided while there to ask about a table on the actual same floor. Eventually I went to check for myself and spoke to a really nice lady (the manageress perhaps?) who actually asked a couple if they could move so that we (4) could sit together at a table. Great service from her. We moved and sat at the table for a further 10 minutes waiting for at least an offer of a menu or a wine list but nothing. Service is far too lax, I'm afraid. One of my friends had to ask for menus in the end, to which 1 of the waiters quickly presented them to us with a very sarcastic \"Here are your menus\" as if he was doing us a big favour. The waiter we then ended up with (a short guy with short black hair) was fine-but the kitchen was NOT! I ordered the chicken skewers which were fine but a little dry followed by tuna or swordfish (can't remember which now). The kitchen is open to the floor and we were sat 1 foot away from the main part of it, alongside it. They could see if we had finished or not. I had just eaten the last mouthful of chicken and lo and behold, here was the main course being served. A big mistake. Why on earth couldn't they check if we were all ready-we weren't and needed a breather between courses. The kitchen staff could see us very clearly. The fish was fine by the way, just the kitchen and service slap dash. As we left I said Goodnight to our waiter but he could hardly be bothered to reciprocate. I saw the lady who I think was the manager in the lift going down and I mentioned the service to her. I doubt if there'll be any improvement. A lovely evening because of my friends and the views but let down by the service and lack of attention.", "date_of_review": "3 August 2015"}
{"review_id": 280, "restaurant_id": -8, "username": "Loyd G", "date_of_visit": " June 2015", "rating": "1", "title": "Long wait, Awful service, waste of time!!!", "comment": "Waited an hour and a half to get up to the rooftop just for a drink, to be met with slow, inattentive waiters that got our order wrong. Then to wait 25mins just to pay the bill.  Good venue, but in no way worth the terrible service and extremely average cocktails. Don't waste your time!", "date_of_review": "11 June 2015"}
{"review_id": 281, "restaurant_id": -8, "username": "Lizzie D", "date_of_visit": " August 2015", "rating": "5", "title": "So lovely - great rooftop bar that isn't pretentious", "comment": "Came with a friend for drinks and food in the sun on the rooftop. Had a lovely day - the staff couldn't do enough but weren't overbearing or hassling us to order or buy anything until we wanted to. Reasonably priced and nice food, the cocktail pitchers were lovely. Would highly recommend to anyone fancying a relaxed afternoon in Shoreditch.", "date_of_review": "8 August 2015"}
{"review_id": 282, "restaurant_id": -8, "username": "Alex R", "date_of_visit": " April 2015", "rating": "4", "title": "Roof top lunch", "comment": "Nice setting on a sunny day. Lunch was nice, but I would pay the prices for the location and setting not for the food. Good service.", "date_of_review": "18 April 2015"}
{"review_id": 283, "restaurant_id": -8, "username": "Nigel G", "date_of_visit": " May 2015", "rating": "5", "title": "Steak and a view in the Sun", "comment": "I had the pleasure of a business lunch on the Boundary Rooftop Garden restaurant in Shoreditch, London on Monday with a good friend (his recommend). What a perfect little sanctuary for a perfect lunch. Roof top is accessed by a lift from ground floor. Seating is rustic and set amongst planters of grasses, ferns and exotic plans (I assume they are as I am not a plant specialist) which gave effect of little secluded areas. Included seating that was more lounger with cushions. I imagine very pretty at night with the lighting and open fires. Menu had great variety as did the wine list. Had the asparagus starter. the Chorizo and squid looked good to. Main was a rib eye steak, flame grilled to perfection and had a very peasant and distinctive taste. To much food for pud so cannot comment on suites. Breads offered were interesting and waiter explained their making, nice touch. Staff were attentive but not intrusive. In summary, a sunny place to have a pleasant lunch or dinner, have a view over the city and only be a short distance away from the office. Somewhere very different to bring your guests for corporate hospitality. Definitely book, don't turn up on spec - was busy. See you there next week ...........", "date_of_review": "13 May 2015"}
{"review_id": 284, "restaurant_id": -8, "username": "Dezza942", "date_of_visit": " April 2015", "rating": "5", "title": "Great roof top and great service!", "comment": "Really impressed with this place. Stayed from 1PM until 8PM with friends lolling on the roof it was just lovely. The service was great especially from Leo. Food also brill. I had the monkfish and my friend had the lamb.  The only and very small downside was not having my expresso martini in a proper martini glass but I am now sounding like a complete moron so all is forgiven.", "date_of_review": "19 April 2015"}
{"review_id": 285, "restaurant_id": -8, "username": "ChantellePeat", "date_of_visit": " April 2015", "rating": "4", "title": "Lovely View", "comment": "Service is a bit hit and miss (staff forgot our nibbles order), they had run out of 2 of the white wines (there are only 7 on the menu) and you have to queue to get in, but overall a nice place to have a drink on a sunny evening while looking out over London.", "date_of_review": "21 April 2015"}
{"review_id": 286, "restaurant_id": -8, "username": "Rozkan", "date_of_visit": " May 2015", "rating": "4", "title": "On a Sunny Day in London", "comment": "This is the place to have a drink at the end of the day. Up on the roof of this old building is a great bar with a good wine list. We drank champagne and ate yummy nibbles. Ny 6:30 this place was hopping and packed tight. It had a great vibe and if we had not had reservations elsewhere we would have spent the night. the staff were lovely and it was really fun. Best way to get to the roof is to go through the little hotel.", "date_of_review": "13 May 2015"}
{"review_id": 287, "restaurant_id": -8, "username": "Richard S", "date_of_visit": " May 2015", "rating": "5", "title": "Great terrace setting and service", "comment": "I came here after work for a drink and food on a warm early evening. We had the house white and seafood platter with a couple of sides and all were excellent and reasonable (for London). The view is interesting and not overlooked, though you're not going to see any London landmarks from here. There is a hipster feel and it is full of Londoners as it always would be considering the location which adds to the great atmosphere. Overall, it felt very relaxed and how a terrace bar should be. Highly recommended.", "date_of_review": "21 May 2015"}
{"review_id": 288, "restaurant_id": -8, "username": "Eduburg", "date_of_visit": " June 2011", "rating": "4", "title": "Amazing place, average food", "comment": "Went to Boundary for the first time yesterday for lunch time, arrived at 11.45 am to queue for a good table as it was an amazingly sunny day.  The rooftop area is just amazing, it feels like you're somewhere in Barcelona not in London. The atmosphere is really chilled, with some good music going on in the background. Service was also quite nice and friendly. What disappointed us though was food and drinks. The jug of we ordered Pimms was more about style than substance...nothing really special about it. I ordered a spatchcok poussin which was probably 70% bones, a friend of mine ordered an artichoke which was full of ants, so we were overall not happy about the food.", "date_of_review": "27 June 2011"}
{"review_id": 289, "restaurant_id": -8, "username": "Enjoy1962", "date_of_visit": " June 2015", "rating": "4", "title": "Amazing experience at the rooftop terrace of the Boundary restaurant", "comment": "Beautiful Sunday and we looked forward to this promising rooftop terrace for a late lunch. We didn't make a reservation so we ended up in a queue and had to wait for over 30 minutes. But it was worth to wait. We enjoyed the cozy terrace with olive trees and nice seatings. We started with a fruit de mer platter for two, followed by a nice chicken skewers and a goat cheese salad. On the side we ordered a salade nicoise (without the tuna) and french fries. It was a great Sunday afternoon and we come definitely back next time.", "date_of_review": "7 June 2015"}
{"review_id": 290, "restaurant_id": -8, "username": "JordonW", "date_of_visit": " April 2015", "rating": "3", "title": "Rooftop drinks with friends", "comment": "I would never have known about this place if it were not for my friends recommendation.  It was a hot sunny day and we wanted a roof terrace setting so chose here.  The first impression we got from the staff in the reception area was not good. We were spoken down to and told to wait outside. She eventually came out to us and said we can go up. We chose a sofa and table and ordered our first drinks.  The waiter didn't smile once and seemed like he didn't want to be there. We couldn't work out if it was supposed to be a pretentious atmosphere or they were just rude staff. Either way i will never go back here. We spent a tidy sum on drinks, but would have stayed longer and had dinner if we were made to feel more welcome.  I think Mary Portas needs to pay a Visit here.  The only reason I gave this place the rating I did was because of the setting and the view.  The service and the staff would get a very poor vote for sure.", "date_of_review": "17 April 2015"}
{"review_id": 291, "restaurant_id": -8, "username": "fartyk", "date_of_visit": " June 2011", "rating": "2", "title": "Rooftop service dreadful", "comment": "We didn't stay in this hotel but went to the bar. The bar is not a good advert for the hotel. The man at the bar snapped at the young waitress when we arrived. She looked terrified. We then sat down and waited and waited. Drinks were brought with a very take it or leave it attitude. When we wanted more, we waited and waited. Same happened when we wanted the bill. The toilet was dirty and we were very glad to get out of the place. It was just a Monday afternoon too! Grim", "date_of_review": "14 April 2014"}
{"review_id": 292, "restaurant_id": -8, "username": "Alberto C", "date_of_visit": " June 2015", "rating": "1", "title": "10° but no heaters because is Summer!", "comment": "I went there with friends for a drink in the outside area on a Saturday evening.  Once managed to get upstairs the place looked fantastic bit the weather was cold and windy, so we asked for one of the several heaters around the terrace to be tuned on, but the floor manager simply refused to do it. Than in the desperate effort to get some source of heat we tried asking the same to a waiter, who told us literally \"we are not turning them because is Summer\", at first I though it was a joke, but he could not be more serious. Finally we decide to order some hot tea to warm ourself up and the the waiter pushed us towards ordering some of the most expensive Hot Toddies ever seen. Finally after waiting for good half an hour for 2 blankets (to be shared between 5 people). We left after 15 minutes and will not go back ever again and won't recumbent to anyone.", "date_of_review": "7 June 2015"}
{"review_id": 293, "restaurant_id": -8, "username": "Superloofah", "date_of_visit": " April 2015", "rating": "2", "title": "Lovely place, really poor service", "comment": "Hopes were raised by the MI5 style hoops I had to jump through to book a table on the warmest day of the year so far. Hopes remained high on arrival downstairs where we were greeted by a maitre de, a smiling lady who was expecting us, and a Chef who seemed intent on overseing our entry into the lift. However, on arrival at the rooftop things went progressively downhill. It turns out that the bookable area is all undercover - so we walked past hundreds of people sunning themselves in the open air I had gone through hoops to secure before some bloke reluctantly waved us in the direction of a table which was hemmed in by glass walls (the all-weather area, just don;t use it in summer!). I turned round to appeal for a table \"outside\" but he was long gone. After 5 mins standing around i went in search of the allusive bloke - found a similarly attired one - but was told we couldn't move out to the prime seats. My cohort and I resignedly sat down and rested our arms upon the worlds stickiest table to select drinks. 10 minutes later, menu's and extremeties firmly glued to the table, we again had to wave down a suit to order drinks - he looked astounded at our impudence. Another suit came to take the order (one bottle of wine, one cocktail) and he demanded a credit card upfront - I pointed out that they had my card details as part of the MI5 induction process and then braced myself for a hessian sack over the head to complete my initiation. Ignoring the hiatus before the wine eventually arrived; a further 15 mins passed and the cocktail appeared to have been given to someone much more fortunate than my friend. We waved over the youngest suit and reminded him what it was. He eventually returned with two cocktails and presented blatantly the wrong one to my parched friend. Seriously - it's only one drink - and the clue was in the word \"blueberry\". A green cocktail is probably not the ticket? We didn't leave a tip - and this went against my groups drinking ettitquette almost as much as leaving after just one drink did. All in all, a potentially lovely venue let down miserably by some rude, some incompetent and, a few sweet but slightly dumb staff.", "date_of_review": "16 April 2015"}
{"review_id": 294, "restaurant_id": -8, "username": "alanaspinall33", "date_of_visit": " May 2015", "rating": "5", "title": "Excellent terrace setting", "comment": "Went here for my daughters wedding meal in the evening with 17 others . The setting was lovely...a roof terrace....well presented table etc. Food was very good.....and the service was excellent. A big thank you to the waiting staff for their attentive servics", "date_of_review": "17 May 2015"}
