{"review_id": 1, "restaurant_id": -9, "username": "LauraJayneRawlibgs", "date_of_visit": " October 2020", "rating": "5", "title": "Catch up lunch", "comment": "A 4 hour catch-up lunch with friends was improved not only by the wonderful food (we ordered the entire tapas menu to share - amazing), but by our attentive and personable waiter Gary, thank you. We’ll definitely be revisiting.", "date_of_review": "27 October 2020"}
{"review_id": 2, "restaurant_id": -9, "username": "ljiole", "date_of_visit": " November 2020", "rating": "3", "title": "Mixed food & service", "comment": "My friends had recommended Seabird & after looking over the menu, decor & location, thought it would be a fabulous anniversary treat. Booking & rescheduling due to Covid was easy, however the manner of the staff member over the phone who was ringing to confirm our booking was very rude, to the point that we only attended the meal and did not cancel there and then to avoid a penalty. We arrived and were seated swiftly with a gorgeous view of the Shard. I did not get the name of our waiter, but he was really friendly, knowledgeable and made our evening great. Another staff member, within moments of us sitting down, again reminded us that they needed the table back by 7.30 (we knew this before booking). Completely understandable, but she was very rude and abrupt, and we immediately felt rushed and unwelcome, therefore only bothered ordering a few dishes and one drink before leaving after less than an hour. In particular, the pork was really delicious, as was the pan con tomate. The attentive waiter did present us with an anniversary ice cream, which was again a lovely token. I couldn't fault him at all, but to be honest the damage had already been done. Really disappointing considering the high price point and how excited we were to initially visit.", "date_of_review": "4 November 2020"}
{"review_id": 3, "restaurant_id": -9, "username": "joeboxall", "date_of_visit": " November 2020", "rating": "5", "title": "Impressive after work drinks.", "comment": "Dropped by for some after work drinks, shortly before lockdown number 2. Didn’t have a reservation but were able to sit on the terrace, which with blankets wasn’t as cold as I thought it’d be. The views are fantastic and the drinks were great - I had an initial Negroni which I stuck on all evening as it was frankly delicious. Our waitress Caitlin was an absolute delight and looked after us greatly. I would definitely recommend and will be back to try the seafood as the display looked amazing.", "date_of_review": "6 November 2020"}
{"review_id": 4, "restaurant_id": -9, "username": "BrittsPottery", "date_of_visit": " November 2020", "rating": "4", "title": "Last outing before lockdown", "comment": "My friends and I went out to eat here for a birthday celebration and we had a good time, the octopus roll was really delicious. The view was really beautiful. It has a good view of the city and within the restaurant, it had good places to take photos.  But what made our evening was our waiter Garry, he was super fun (he told us jks and hyped us up) and made us laugh through the night. He explained everything to us and made sure we were all good.", "date_of_review": "14 November 2020"}
{"review_id": 5, "restaurant_id": -9, "username": "lindseyT08", "date_of_visit": " December 2020", "rating": "5", "title": "Five star review for service-", "comment": "Five star review for service- Gary absolutely made our night. So attentive and knowledgeable- added humor and genuinely made our entire table feel special.  Food was good, service was great. ", "date_of_review": "11 December 2020"}
{"review_id": 6, "restaurant_id": -9, "username": "11tanakaa", "date_of_visit": " December 2020", "rating": "5", "title": "Thank you Gary!", "comment": "My partner and I had a wonderful dinner at Seabird. The food itself was reasonably priced considering they were decent portion sizes and of course it was delicious. The atmosphere was also fun and enjoyable. But the highlight of our evening had to be our waiter Gary. To be perfectly honest my partner and I weren't in the best mood originally, but after being served by this incredibly friendly, professional and warm server, our moods were lifted. He paid incredible attention to detail and went above and beyond to ensure we were having a great time. Every restaurant could do with a Gary. Please pass on our thanks.", "date_of_review": "11 December 2020"}
{"review_id": 7, "restaurant_id": -9, "username": "eddywilliams1", "date_of_visit": " December 2020", "rating": "5", "title": "Wonderful lunch", "comment": "It’s been a while since I left a review of any kind, but we had such a wonderful lunch there on Sunday I feel compelled to make my gratitude public.  Food was excellent, the whole sea bass being the star. Drinks great. Service exceptional. They not only took great care of my little niece, but were very helpful in catering for our multitude of dietary requirements. We were sat outside as we were from mixed households, but the combination of hefty heaters, warm blankets, and superb food and drink meant we barely felt the cold (the hats, ski jackets, and multiple layers also helped!).  Thank you to all who cooked and looked after us. We’ll be back for sure!", "date_of_review": "8 December 2020"}
{"review_id": 8, "restaurant_id": -9, "username": "AHlondoner87", "date_of_visit": " December 2020", "rating": "5", "title": "Great food, incredible cocktails", "comment": "We came for a last minute bite to eat before tier 4 was thrust upon London. The place was fully booked! Luckily, they had space for us to eat on the bar, and it couldn’t have ended up being a more perfect spot. The bartenders were the most friendly and enthusiastic servers. Luca spent his time talking us through the cocktails, hand tailoring drinks to our taste, and being an overall delight. Best mescal old fashioned I’ve ever had! Thanks to Luca and the rest of the staff for being so accommodating", "date_of_review": "23 December 2020"}
{"review_id": 9, "restaurant_id": -9, "username": "london9501", "date_of_visit": " December 2020", "rating": "1", "title": "Unwelcoming service. Continuously", "comment": "Unwelcoming service. Continuously reminded throughout the meal (starting before we had even ordered) that they needed the table back despite having a reservation. Other things happened too which I won’t go into but overall a disappointing experience & I won’t be going back. Something for tourists! ", "date_of_review": "11 December 2020"}
{"review_id": 10, "restaurant_id": -9, "username": "charliedK7872NO", "date_of_visit": " December 2020", "rating": "5", "title": "Thank you Caitlin", "comment": "This place is BEAUTIFUL! Thank you so much Caitlin for making it such an amazing first experience, we will undoubtably be coming back when you guys reopen and more often too! You were more than attentive and gave the night a real personal feel to it too. Food was perfect, the view amazing, couldn’t find a fault. Thanks again Caitlin see you soon.", "date_of_review": "15 December 2020"}
{"review_id": 11, "restaurant_id": -9, "username": "Samantha B", "date_of_visit": " September 2020", "rating": "1", "title": "VERY Disappointing Customer Service", "comment": "On Tuesday 15 September, I made a reservation for 9.15pm on Wednesday 16 September for my boss and 2 colleagues. I made the reservation online as I couldn't get through on the phone, each time I called, I got an automated message repeating please phone back tomorrow from 9am. I also noted, when making the reservation, if there were any cancellations for 730pm, to let me know. I received an email confirming there had been a cancellation and I could now have a table at 730pm, to which I replied to the email confirming I want the 730pm table and to cancel the 915pm reservation. No response. I sent 8 emails asking them to confirm the table at 730pm. No response. As suspected, when my boss arrived at 730pm, their reservation had not been changed. I appreciate that they hadn't confirmed (my boss and colleagues blagged it anyway), but my negative review is because no one bothered to respond to my many emails, either way.", "date_of_review": "17 September 2020"}
{"review_id": 12, "restaurant_id": -9, "username": "lishawshaw", "date_of_visit": " October 2020", "rating": "5", "title": "Amazing food and service", "comment": "Visit Seabird on my sister's birthday and the food is nice. We were served by Garry and were impressed by his hospitality. He is so diligent and has taken care of every details even when the restaurant is busy. Would definitely pay another visit to Seabird, hope we would meet Garry again.", "date_of_review": "24 October 2020"}
{"review_id": 13, "restaurant_id": -9, "username": "LewisHunter94", "date_of_visit": " October 2020", "rating": "5", "title": "One of the best! ", "comment": "One of the best places I’ve experienced in London! The food and drink offering is fantastic! The highlight though is Gary, the service he provides is first class and the way he makes you feel is even better! You feel like you’re a guest in his home! I would recommend asking for him to take care of you when ever you visit! ", "date_of_review": "6 October 2020"}
{"review_id": 14, "restaurant_id": -9, "username": "Epicecrulet", "date_of_visit": " October 2020", "rating": "1", "title": "Terrible!", "comment": "Rude pretentious staff, overpriced below average food. Does not live up to standard it thinks it sets.", "date_of_review": "4 October 2020"}
{"review_id": 15, "restaurant_id": -9, "username": "MissMangoCake", "date_of_visit": " October 2020", "rating": "4", "title": "Tapas style was the way to go! ", "comment": "I see a few negative comments about the service. I thought it was fine, my friend wasn’t as impressed but to me personally, average overall service is fine when you take into account the great food, location, views - the general ambience was just great.  (Honestly the waitresses/waiters we had were friendly, but I think the location may leave some to expect a higher level of service which is fair enough)  We got a few smaller dishes and a bunch of oysters so it was all tapas style. Looking at the small portion size and high prices of some of the main dishes, I think tapas style is the way to go.  My friend and I love ceviche but we weren’t too keen on the scallop ceviche, the corriander based sauce was quite strong for the dish in my opinion.  The octopus roll however, wow!!  The pan con tomate is a very simple dish but done so well and just £4.  The brioche/torrija dessert is one of the reasons why I’d go back.", "date_of_review": "13 October 2020"}
{"review_id": 16, "restaurant_id": -9, "username": "95khadijak", "date_of_visit": " August 2020", "rating": "5", "title": "Great Food Great Service ", "comment": "The staff were friendly and lovely. The food was absolutely amazing. Enjoyed my time there. I wanted to try everything on the menu! ", "date_of_review": "24 September 2020"}
{"review_id": 17, "restaurant_id": -9, "username": "Rajvinder P", "date_of_visit": " October 2020", "rating": "5", "title": "The most amazing experience", "comment": "My partner and I booked this for our anniversary and we were not disappointed!! This beautiful restaurant is located amongst the beautiful breathtaking London skyline with amazing views wherever you are seated! Service is immaculate. Gary was our server and from the very start he was amazing. He was so bubbly and friendly and we got on with him so well. He was just super relaxed and talkative. He recommended the monkfish after my partner was debating the lobster and let’s just say my partner had the best dinner! The monkfish was brilliant! Everything from start to finish was great but it was that extra special with Gary as he spoke to us and made us laugh. He even gave my dessert with a Happy Anniversary chocolate! That was special. Thank you Seabird and thank you Gary ☺️", "date_of_review": "9 October 2020"}
{"review_id": 18, "restaurant_id": -9, "username": "Mjf1988", "date_of_visit": " October 2020", "rating": "5", "title": "Perfect Birthday Celebration ", "comment": "Visited Seabird for my partner's birthday and we were not disappointed! The restaurant was busy, all staff following correct covid protocol of course, which meant for a great atmosphere. We were looked after by 'Rob' who was friendly, helpful and diligent throughout. He provided recommendations and favourites without being pushy and did everything he could to make my partner's night special which he did excellently. The food was incredible - oysters followed by a combination of tapas style dishes, the croquettas are to die for. The seabass was simply breathtaking with not a bone in site. Desert was a refreshing, charred pineapple delight and a charming birthday treat. We definitely recommend the riesling for the refreshments and the expresso martinis were a great final flourish. Thank you to all at Seabird, especially to Rob for a great evening!", "date_of_review": "17 October 2020"}
{"review_id": 19, "restaurant_id": -9, "username": "SurajBhaskaran", "date_of_visit": " October 2020", "rating": "4", "title": "Gary was the highlight of the evening ", "comment": "We visited Seabird with relatively high expectations, given the setting, the view, and the look of the (almost) purely seafood menu. The food however, ended up being quite sub-par, with the drinks being very tasty on the other hand (their negroni is a must-have!). The service was very rushed and felt quite hectic until we had Gary serving us. He made the evening what we expected in terms of a very memorable one, and one that fit the setting of the restaurant. He was funny, witty, and knowledgeable, everything you would expect in a great waiter. If you ever get the chance to visit Seabird, try and request for him to serve you.", "date_of_review": "19 October 2020"}
{"review_id": 20, "restaurant_id": -9, "username": "tmac13m", "date_of_visit": " October 2020", "rating": "5", "title": "Best in town", "comment": "There I was on a Thursday night, Slurping down an oyster with such delight When I looked up to see the most beautiful eyes I realised it was our waitress, what a surprise ‘would you like a drink’, I think I will Those words were said plenty, just put it on the bill Majestically she served us, Caitlin was her name The best waitress in London, that was her game I could go on for days of this heavenly place Not one item on the menu would I replace All I can say, in case you had not heard, get yourself down to the Seabird", "date_of_review": "20 October 2020"}
{"review_id": 21, "restaurant_id": -9, "username": "Lozwas", "date_of_visit": " September 2020", "rating": "4", "title": "4", "comment": "Lovely fresh food. Beautiful decor and great service. On the pricey side though, would definitely save this for a special occasion. View is also great shame it was grey and windy when I was there so couldn’t make the most.", "date_of_review": "7 September 2020"}
{"review_id": 22, "restaurant_id": -9, "username": "HertsBoss8", "date_of_visit": " August 2020", "rating": "4", "title": "Great on most things with a few frustrations!", "comment": "Arrived in a CoVid world to a rooftop restaurant and bar which is really very lovely. We were disappointed with an early booking not to secure a terrace view. But the friendly team assured us on arrival they would do their best to get us out there. Our waiter was attentive and very knowledgable. Food very delicious but order of food to table from the kitchen was a bit chaotic. As was drinks service....bit slow! No matter we enjoyed it all. We then started to observe groups arriving being prioritised to the terrace and complained to the Maitre D’ who was a little mortified. Finally we were given an area to have drinks with a view and it finished off our night beautifully. We were disappointed that we had been forced to complain in order to get our preferred spot outside especially as we had spent over £500 - not cheap! It was a shame small details impacted what could have been a really delightful visit. It’s a cool place. Special mention to Dominic who went over and above to rectify our problems once he was aware of how cross we were. Worth a visit!", "date_of_review": "13 August 2020"}
{"review_id": 23, "restaurant_id": -9, "username": "Olive360", "date_of_visit": " August 2020", "rating": "5", "title": "5* meal with a 5* view", "comment": "I took my friend to the seabird restaurant for a birthday meal. The staff were so accommodating and friendly and made the experience the 5* I have given it. I had originally booked a table outside on the rooftop terrace but was advised that it was going to rain so the staff let us sit outside while we had our first drink, ordered our food and took some photos and held our table inside till we were ready. We had the lobster and chips which was phenomenal and such good value for what it was. When the waiter came to take our plates away he advised us that we had missed out a load of meat left in the lobster and brought us all the tools (teaching us how to use them) and a freshening up bowl. We really appreciated the service going that extra mile and you can tell the staff all enjoy working here.  The vibe and ambience in the restaurant also makes you feel like you are in another world and on a beach somewhere with the wicker chairs and shells everywhere.  I 100% will be coming back to Seabird and felt that this review deserved to be shared :) Olivia", "date_of_review": "18 August 2020"}
{"review_id": 24, "restaurant_id": -9, "username": "cawte21", "date_of_visit": " August 2020", "rating": "5", "title": "Gorgeous food, amazing views and fantastic staff", "comment": "We had a fantastic meal at Seabird last night; it’s already on our list to come back to. The venue is beautiful, the views amazing even on a cloudy, miserable night and the staff were a delight; friendly and professional without ever being overbearing.  The food was just gorgeous. We shared 12 mixed oysters, followed by the prawn croquettes, carabinero (absolutely amazing; I wish we’d ordered two!) and a whole charcoal grilled sea bass,which was probably the best cooked fish I’ve eaten in the U.K. We topped this off with a beautiful bottle of organic muscadet; for £200 I think that our meal was very reasonable. I liked that the menu was fairly succinct too. We look forward to returning next time we’re in the city. ", "date_of_review": "16 August 2020"}
{"review_id": 25, "restaurant_id": -9, "username": "Foodie12512", "date_of_visit": " August 2020", "rating": "3", "title": "Good food but poor service", "comment": "Dont go here if you are expecting a table on the terrace with views! We requested a table on the terrace several weeks in advance but unfortunately, on arrival we were provided with a seat inside. We politely requested to see if any seating was available on the terrace (and were happy to wait) but were turned down again, quiet rudley by the waiter. Shortly before being served we went to the terrace for a photo, and found about 5 spare tables which remained empty throughout the evening. The food was good but unfortunately the above experience tained in the evening slightly.", "date_of_review": "23 August 2020"}
{"review_id": 26, "restaurant_id": -9, "username": "michelbK1069XS", "date_of_visit": " August 2020", "rating": "5", "title": "Best views in town!", "comment": "What an amazing night we had at this place. This spot probably offers the best views in London. With an amazing sunset and great cocktails we really enjoyed everything. The oyster list is soo long that its quite hard to choose from but the staff can guide you in the right direction. ", "date_of_review": "24 August 2020"}
{"review_id": 27, "restaurant_id": -9, "username": "123poppy12303", "date_of_visit": " August 2020", "rating": "3", "title": "Smaller portions and higher prices during EOTHO", "comment": "We travelled 200 miles for our second visit to the Seabird, but the menu had changed, there was no seafood platter, and portions were minuscule. We had the monkfish and triple cooked chips. So for fish and chips twice, it cost £52.00. This is yet another restaurant that has changed the menu during the EOTHO offer, and reduced portions, and increased prices. We’re all n this together you know.", "date_of_review": "28 August 2020"}
{"review_id": 28, "restaurant_id": -9, "username": "Anablondon", "date_of_visit": " September 2020", "rating": "3", "title": "Overpriced food ", "comment": "Overpriced below average food. Cocktails weren’t good. For a pricey place like this (one seabass £45) I expect a superb dining experience. The only good thing is the terrace view but they will do everything to move you inside for dining with silly excuses. ", "date_of_review": "1 September 2020"}
{"review_id": 29, "restaurant_id": -9, "username": "travellingbluebell", "date_of_visit": " August 2020", "rating": "5", "title": "Great food, great service, lovely view", "comment": "I sat outside with friends, very comfortable seating and great service. The food was lovely, i ate Vegan and it was all delicious. The view is great, over the river to the City and West End.", "date_of_review": "4 September 2020"}
{"review_id": 30, "restaurant_id": -9, "username": "Chantelle P", "date_of_visit": " August 2020", "rating": "1", "title": "If you’re for an impersonal service come here", "comment": "If you’re looking for an impersonal and overpriced service then come here. The food is good however the service is lacking. No wine connoisseurs despite bottles costing £50+ and the whole experience rushed.", "date_of_review": "21 August 2020"}
{"review_id": 31, "restaurant_id": -9, "username": "AurelijaS92", "date_of_visit": " August 2020", "rating": "5", "title": "Amazing views amazing place", "comment": "Went for a birthday lunch group of 5 and enjoyed the experience very much, sitting outside with the views of london in such a beautiful setting. Every member of staff was attentive and extremely friendly throughout, food was just as great!! This has become one of my favourites and can’t wait to visit again. Highly recommend for anyone thinking to visit.", "date_of_review": "9 August 2020"}
{"review_id": 32, "restaurant_id": -9, "username": "HeBu123", "date_of_visit": " March 2020", "rating": "1", "title": "Style over substance ", "comment": "Very poor experience at Seabird. They have multiple dishes on their menu marked as gluten free which are not by any means gluten free. We also expressly asked for gluten free dishes which arrived smothered in gluten. In this day and age this is unacceptable.  Furthermore, when you buy a bottle of wine, you expect it to be divided equally amongst the table, not served in the first few glasses that come along, so you are forced to buy another.  We were extremely disappointed in the cost for value experience at Seabird. ", "date_of_review": "7 March 2020"}
{"review_id": 33, "restaurant_id": -9, "username": "912rose", "date_of_visit": " March 2020", "rating": "5", "title": "5* Food with 5* Service at a beautiful location", "comment": "I had a brunch with friends for a birthday celebration and it was a treat!! This is one of the best food I had in a long time. Everything we had was delicious. Absolutely everything. Starters, mains, desserts...And the service!! what a smart looking,friendly and attentive atmosphere they all create!!. The waiters and everyone around are specially warm without being over the top. They comment,they recommend,they help,they please,they do anything they can to give you a speacil experience. The best dishes, crab bunuelos, beans with chorizo stew and the best, the \"Octopus roll\" recommended by the waiter and spot on!!. Amazing!  It's also a great place to relax, chat, enjoy the views....It's quite high up so the light is beautiful and warming. I hope this place can survive the madness of this lock down times and stays open as I will definetely treat myself again as soon as I can and highly recommend it to all. P.S I also had a free cake an a candle for my birthday.Lovely", "date_of_review": "31 March 2020"}
{"review_id": 34, "restaurant_id": -9, "username": "jonathancattermole", "date_of_visit": " July 2020", "rating": "4", "title": "Style and Substance", "comment": "We really enjoyed our meal here last night! Starters were both incredible, having the baby squid and prawn croquettes. Naturally we tried the oysters too, and they didn't disappoint. My friend really enjoyed her lobster, although I didn't particularly enjoy my squid ink rice but perhaps that's just me..  The real highlight was the lovely, charming and attentive service from Muay, who really brightened up our night.  The location was absolutely stunning, would certainly recommend sitting outside to soak up the full atmosphere.  Hope to return soon!", "date_of_review": "23 July 2020"}
{"review_id": 35, "restaurant_id": -9, "username": "Annie234bogg", "date_of_visit": " July 2020", "rating": "5", "title": "Miss", "comment": "Moy is the best waiter, so friendly, went out of his way to give us the best experience ever! What an asset to your team!", "date_of_review": "19 July 2020"}
{"review_id": 36, "restaurant_id": -9, "username": "259glennh", "date_of_visit": " July 2020", "rating": "5", "title": "We had dinner here while staying", "comment": "We had dinner here while staying at The Hoxton hotel which is in the same building. Its a beautiful looking restaurant with some of the best views over London that I’ve seen. The service was also 10/10 with attentive waiters who helped us with our order. We started by sharing 2 types of oysters, prawn croquettes and fried squid all of which were excellent (especially the menai oysters!). I then had the whole mackerel which was nice but could have been a bit warmer and wasn’t outstanding. I then finished with the manchego cheesecake which opposite to the mackerel could have been a bit cooler and needed some ice cream or coulis with it. Overall I’d give the food 7-8/10 but really you’re coming here for the view and the service so I would still happily recommend it! Our only gripe was that we didn’t get a table on the terrace and they said they would try to move us but nothing came of it in the end, so I would try call up in advance when you book and try to grab yourself one!", "date_of_review": "25 July 2020"}
{"review_id": 37, "restaurant_id": -9, "username": "brendadunnett", "date_of_visit": " July 2020", "rating": "5", "title": "Great views, food & service", "comment": "We booked this place hoping to enjoy a sunny afternoon overlooking London from the beautiful roof terrace. Unfortunately for us, it rained all day last Sat so we were so disappointed. However, we were still able to go out to take a few photos and the views are indeed wonderful.  The food was superb - prawn croquettes and octopus roll to start, we shared a lobster for main and finished with a fab cheesecake. The price for food was very reasonable - it's the drinks that are expensive (as in most London bars/restaurants) The service was what made this visit memorable though. All the staff were so attentive and accommodating - even taking photos in the rain for us!  I would definitely recommend Seabird and will return one day to hopefully be able to enjoy the roof terrace property.  Thank you all for a wonderful lunch!", "date_of_review": "1 August 2020"}
{"review_id": 38, "restaurant_id": -9, "username": "John1877", "date_of_visit": " August 2020", "rating": "5", "title": "Great food and staff", "comment": "Bustling rooftop seafood restaurant. The food and cocktails were delicious. The staff were friendly and accommodating. Spectacular views and the restaurant was beautiful inside even if you don't get to the outside terrace.", "date_of_review": "8 August 2020"}
{"review_id": 39, "restaurant_id": -9, "username": "alice v", "date_of_visit": " January 2020", "rating": "5", "title": "Fantastic view and excellent food", "comment": "This place has an amazing interior design, full of plants which brings a relaxing atmosphere to the room. The fish they serve is excellent and their wine list too! The view is just stunning and I love the vibe and concept. For dinner or just for a drink, this place is definitely a must-try!", "date_of_review": "7 March 2020"}
{"review_id": 40, "restaurant_id": -9, "username": "toyintomato", "date_of_visit": " August 2020", "rating": "2", "title": "Poor covid measures in place", "comment": "I visited this place on 02 August 2020 and I did not enjoy my experience due to poor covid measures in place. There’s a hand sanitizer at the entrance and that’s pretty much it. The host had no mask, the waiters wore no masks, no one was wearing any masks!!! Waiters wore no gloves as well. Also when the waiter brought my food, he’d talk over it saying “enjoy”! How could I enjoy my food when you’ve possibly infected me by speaking into my meal? Also the table next to me wasn’t 2 meters apart and because we were seated outside on a windy day, the guest on the table next to me kept sneezing! (It was windy, so germs were defs flying around) It was not a comfortable experience and didn’t enjoy my visit unfortunately. The food tasted good but couldn’t enjoy it because of this!", "date_of_review": "7 August 2020"}
{"review_id": 41, "restaurant_id": -9, "username": "DrAjayd", "date_of_visit": " August 2020", "rating": "4", "title": "It’s really a 3.5 but can’t", "comment": "It’s really a 3.5 but can’t give it that can we. Haha.  I really liked this place. The vibe was great, our server (Chris) was brilliant and the food and drinks were good. Nothing amazing though. The venue is stunning, very Californian/French riviera style.  The area where this place fails is the attention to detail. It’s the small things like wiping tables down after each course when they’re clearly messy, changing peoples napkins that a visibly dirty after a course etc... These things would make it memorable. Food was good, but nothing to rave about. Overall a simply ‘nice’ experience. ", "date_of_review": "8 August 2020"}
{"review_id": 42, "restaurant_id": -9, "username": "AFerb_84", "date_of_visit": " February 2020", "rating": "5", "title": "Fantastic fish", "comment": "Great cooking at this basque fish restaurant. Every dish we tried was delicious: Crab croquettes Steamed clams  Whole John Dory Potatoes  Beignets Really impressive flavours throughout. Service was attentive and we had a very nice dessert wine and cocktail.  An inadvertent error with the bill was promptly resolved. Terrace looks lovely for the summer so will certainly be back.", "date_of_review": "16 February 2020"}
{"review_id": 43, "restaurant_id": -9, "username": "Spawny_Get", "date_of_visit": " February 2020", "rating": "4", "title": "Nice but pricey", "comment": "Overall, expensive but a pleasant experience with family.  Positives; - Waiters were friendly but polite as they should be. - As we sat down we were asked if we wanted still or sparkling water, which was nice, as long as it was complementary (wasn't sure). - Wine arrived in good temperature (I am fussy about my wine temperatures). - Food was different but tasty. - Good lighting. - Comfortable seats. Negatives; - Very expensive with small portions. - Wines also overpriced. - Long wine list but confusing and lacked variety with only Spanish/Portuguese/French wines. Should be divide by the region or grape variety/style but seemed not to have any patterns and hence very difficult to choose from an unfamiliar list. - Noisy. Had to shout to have a conversation. I should mention \"great views\" but it was a dark and stormy night, so couldn't see much of the outside. Should be much nicer in the summer out on the terrace. I will visit again for sure.", "date_of_review": "16 February 2020"}
{"review_id": 44, "restaurant_id": -9, "username": "alisonwA7633AK", "date_of_visit": " February 2020", "rating": "2", "title": "Beautiful setting and good food let down by awful service.", "comment": "Yesterday was the first time I have complained in a restaurant for as long as I can remember but I felt so compelled to do so. The service was just awful. It felt like we were a complete inconvenience to the waiting staff. Drinks took forever to arrive even after reminders, not something you expect in a sparsely populated restaurant. I ordered from the 3 course set menu, of which the starter and main arrived within 2 minutes of each other. When I questioned why my main had arrived, the waitress rudely took it away. The whole food service was completely disjointed and delayed. I ordered some fries and the iberico pork for my daughter which arrived 15 minutes apart, again even after reminders. No one was monitoring the table, plates were piling up but no urgency for anyone to take them away. The food was good, but totally overshadowed but amateurish service, and rudeness from certain individuals. Shame as the restaurant and setting are beautiful.", "date_of_review": "19 February 2020"}
{"review_id": 45, "restaurant_id": -9, "username": "605samrah", "date_of_visit": " February 2020", "rating": "1", "title": "Extremely Rude Receptionist", "comment": "Went to Hoxton to have brunch and were then recommended to visit the rood terrace upstairs. A member of staff helped us to the roof terrace - thought we’d have dessert upstairs but it was too windy so decided against it. However the receptionist came after us while we enjoyed the view for 15 seconds saying the view was inly for Paying guests. We explained we had just had brunch in the hotel but he refused to listen and went on to say horrible things. Be careful, its a nice place but they really need to come up the curve on customer service! Very disappointed.", "date_of_review": "22 February 2020"}
{"review_id": 46, "restaurant_id": -9, "username": "O974HQmarkn", "date_of_visit": " February 2020", "rating": "1", "title": "Awful service", "comment": "Great view, but you starve to death before you get served!  So long to get any attention. Hour and 15 in a few shell fish", "date_of_review": "22 February 2020"}
{"review_id": 47, "restaurant_id": -9, "username": "Clogsandsari", "date_of_visit": " January 2020", "rating": "5", "title": "A pleasant surprise", "comment": "I had no idea what kind of cuisine Seabird (on the 14th floor with great views of the Shard) offered so it was a pleasant surprise to find a knowledgeable and just the right side of chatty waiter who took the time to talk through the menu,suggest ways of ordering between just 2 of us. I ordered the devon crab balls...as soft and light as anything and a delicious dipping sauce followed by Cornish plaice with a Spanish sauce with just , for me, the right level of kick to it. For dessert we shared a slice of the cheesecake with shavings of Spanish cheese over it which messed with my head when the waiter did it but as a cheesecake lover it worked for me. Sadly neither of us were drinking but a punchy virgin mojito as an aperitif hit the spot.  I'd happily return when I had more time, could indulge in a glass or two and try more on this menu. Hope to be back.", "date_of_review": "23 February 2020"}
{"review_id": 48, "restaurant_id": -9, "username": "Gemstone4ever", "date_of_visit": " February 2020", "rating": "4", "title": "Oyster happy hour delight", "comment": "I happened to be in the area on a lovely, sunny afternoon so thought so I thought I’d pop up for oyster happy hour. The restaurant is very fancy with a New York vibe and glorious views across London. The outside terrace is stunning and I can imagine it will be wildly popular in the summer. As well as a plate of excellent oysters, I nibbled on some dainty and delicious quisquillas which were marinated in a piquant caper dressing. At £7, I thought this dish was very good value. Service was friendly and attentive. A full meal would be an expensive affair, but I can wholly recommend the raw bar. ", "date_of_review": "29 February 2020"}
{"review_id": 49, "restaurant_id": -9, "username": "clairetun", "date_of_visit": " February 2020", "rating": "5", "title": "A*****", "comment": "I took my Mum to Seabird for a surprise meal on the weekend. Upon arriving the host (I think said his name was Mark?) organised us a table with a BEAUTIFUL view! He was very accommodating throughout and had a great sense of humour. We had a range of shellfish and a crab roll (which both were excellent) - recommended by our waiter Victor. The atmosphere was nice - didn't feel overcrowded and was very comfy. All around the cocktails, views and food were SUPERB! Will definatley be back soon!", "date_of_review": "25 February 2020"}
{"review_id": 50, "restaurant_id": -9, "username": "4FrequentTraveller44", "date_of_visit": " January 2020", "rating": "3", "title": "Wildly overpriced", "comment": "I heartily echo Jay Rayner's recent review of this restaurant. The food is perfectly nice and in some cases very good, but the service is uneven and often condescending. Above all the prices are frankly insulting. Have been twice, and dinner was better than lunch. The oyster menu is a nice touch and the room is very cool but I would not return for a full meal. ", "date_of_review": "25 February 2020"}
{"review_id": 51, "restaurant_id": -9, "username": "davewatmore", "date_of_visit": " February 2020", "rating": "4", "title": "Nice food and good view", "comment": "Been to this restaurant with few of my mates, the food was good. I felt it was pricy but you shouldn’t complaint for the view and London proves. The service was good and polite. I thoroughly enjoyed my visit.", "date_of_review": "13 February 2020"}
{"review_id": 52, "restaurant_id": -9, "username": "Teresa M", "date_of_visit": " January 2020", "rating": "5", "title": "Fantastic", "comment": "Fantastic restaurant with great views and amazing staff - had the best time celebrating a birthday - the staff could not have been more helpful - can’t wait to return.", "date_of_review": "25 January 2020"}
{"review_id": 53, "restaurant_id": -9, "username": "dahokolomok", "date_of_visit": " December 2019", "rating": "4", "title": "Great oysters and seafood, but pricey", "comment": "Pricey, but the views are good, there's an outdoor roof terrace, the seafood is excellent. They have a very extensive oyster menu - more than 10 different types - so this is a great place to bring oyster connoisseurs.  They also do an oyster happy hour - daily from like 3pm till 6pm I believe. It used to be £1 oysters, but now I think its £1.50+, but still cheaper than the usual £3+ a pop on their regular menu. Good for a business meal, or date night to impress. Located inside the Hoxton Hotel.", "date_of_review": "25 January 2020"}
{"review_id": 54, "restaurant_id": -9, "username": "ChrisWickham", "date_of_visit": " January 2020", "rating": "5", "title": "Fish even better than the views!", "comment": "Busy Tuesday evening and no surprise. We had a lovely dinner for six of us accompanied by some excellent wine. If you like Iberian food, notably fish, this place is exceptional. Very knowledgable waiting staff who steer you in good directions. Our reservation was for 8pm so a few items - e.g. the scallops - had finished. But the simple message is book early! I had the sardines - just amazing - and the mackerel - also out of this world. The stews and bream both looked exceptional. Very good restaurant all round. And beautifully located for transport and views. Good value at <£90 per person, which included Champagne before/wine with dinner.", "date_of_review": "29 January 2020"}
{"review_id": 55, "restaurant_id": -9, "username": "Lenlovestodine", "date_of_visit": " January 2020", "rating": "5", "title": "Simply Divine", "comment": "Great views, incredible food, attentive service. When we arrived we were offered a table without a view, we opted to wait 15 minutes to sit by the window with a beautiful view of the shard. There is an outdoor roof terrace but it can get quite cold in the evening.  Worth going to Seabird just for the views and beautiful atmosphere, but the oysters are an absolute must. Our server (sorry missed the name) was very considerate and knowledgeable recommending various wine options to pair with our oyster selection.", "date_of_review": "31 January 2020"}
{"review_id": 56, "restaurant_id": -9, "username": "mounalaart", "date_of_visit": " February 2020", "rating": "5", "title": "Absolutely fantastic time!", "comment": "Absolutely fantastic time! Amazing seafood and lovely decor, the atmosphere is really nice for friends drinks/dinner or a date. We had a great time and I found my new local!", "date_of_review": "1 February 2020"}
{"review_id": 57, "restaurant_id": -9, "username": "Hsu1223", "date_of_visit": " February 2020", "rating": "4", "title": "Dinner", "comment": "The only table we can get on this Saturday was 6pm, you have to go into the Horton to get a lift to go up but they are not marked clearly which one goes to the top, luckily we had someone else in our lift who scan his card so we can reach to the top floor. The food was ok but pricey, for an special occasion then it’s ok. I think It will be nice to come in the summer and sit outside. ", "date_of_review": "9 February 2020"}
{"review_id": 58, "restaurant_id": -9, "username": "B5325FKandrewm", "date_of_visit": " January 2020", "rating": "1", "title": "PTSD", "comment": "Having spent the last month trying to forget my dinner at SEABIRD, Jay Rayner's Guardian review of the place brought it all flooding back this morning. So now here I am, writing about it. Let's call this an attempt at personal therapy. Unlike my meal there, I'll be brief.  We had booked a table for 6 people as it was my friend's birthday. The table wasn't ready so we waited for 30 minutes only to then be shown to a table with 4 chairs and a sofa. The sofa was so low that the two friends who got the short straw had to lean forward awkwardly throughout the whole experience. Who was this sofa built for? Shaquille O'Neal? The waiter then spilled an entire pint of beer in the birthday girl's lap. Hey, accidents happen. We've all been there. Let's forget about it. However, the compensatory shots (!?) were about as tasteful a response as the decor.  That decor. Man. Spending time in that room was like hanging out in the Miami penthouse of a 19-year-old tech millionaire with a paraffin lamp obsession and an Ex On The Beach contestant as his interior designer.  We decided to start by sharing the £90+ seafood platter. This amounted to 2 small prawns, 1 oyster, 1 razor clam and 2 TINY muscles each. These weren't quite as tasteless as the decor but it was a photo-finish.  Surely the main course would reverse things...surely. I decided to choose the cheapest thing on the menu. This was in part frugality but also because Mackerel is my favourite fish...even if I do have to fork out £18 to eat one. Yes. £18. One fish, no sides or accompaniment. £18. The cheapest thing on the menu. It was so small when it arrived 50 MINUTES LATER I hardly noticed it had. This £18 whole mackerel was in fact a butterflied fillet of mackerel the size of my mobile phone. I measured it. And it was swimming in so much oil I suspected the chef had had a stroke. I've fished many times for mackerel and know how big one has to be to legally keep it. There is no way I would have done - it was barely out of nappies. £18.  I decided to ask the waitress where it was from. She said she didn't know and would find out but that I shouldn't worry because...wait for it...\"it was definitely local\". LOCAL?! We're in SE1! Where did they land the thing Bermondsey council swimming baths??! The Thames?!? The sink in The Old Vic theatre toilets??! 10 minutes later she came back. Cornwall. Poor bloody fish - it had been alive for barely as long as the courier took to get it here. £18. With fries on the side (you know, to make it even vaguely something one could class as a full meal) we are talking £22. The thing wouldn't have fed my 4 year old niece - nor the mackerel's. By this point we had been in SEABIRD for almost three hours. It was as if we had eaten essentially nothing. We did all have headaches from paraffin poisoning however. When the bill came it was almost £400. £400. We didn't even drink much. Of that £40+ was service. There was none. Our waiter explained the menu to us in the way the rules of Eye Spy are explained to 6 year olds, chucked a pint over my mate, and then we never saw him again.  But to be fair the mackerel is local.", "date_of_review": "9 February 2020"}
{"review_id": 59, "restaurant_id": -9, "username": "Johnokr26", "date_of_visit": " February 2020", "rating": "3", "title": "Some plusounts but expensive", "comment": "I meet friends for lunch. Service was good from reception and bar staff. Veryrelaxed atmosphere. Food very overpriced for portion size as were drinks. Waiter explained starters but didn't suggest we should order sides. We were too busy chatting and catching up that we didn't think. Literally had a bit of fish for lunch. Fab outside terrace with good views", "date_of_review": "10 February 2020"}
{"review_id": 60, "restaurant_id": -9, "username": "bexmoore7", "date_of_visit": " January 2020", "rating": "2", "title": "A very average and over-priced meal", "comment": "The most over priced meal I’ve had in a very long time. Minuscule portions of average tasting food for an extortionate price.", "date_of_review": "9 February 2020"}
{"review_id": 61, "restaurant_id": -9, "username": "T1756JIrobp", "date_of_visit": " January 2020", "rating": "2", "title": "Are you local?", "comment": "We came to #Seabird to celebrate #BirthdayGirl’s birthday. We’d seen it on the #instagrams.  To start with the positives: the lighting, WOW: everyone in the restaurant had a quaint little #underglow courtesy of dinky little paraffin lamps on each table, and the suspended orbs provided misty tones and ocre hues; gold for the gram. Anyway, we all looked BEAUTIFUL. And that view: DOUBLE WOW. ‘Grammed it so hard our phones died. Though thinking about it, it’s probably a stretch to credit the restaurant for the view since the view is, really, the sum total of the efforts of precisely everyone NOT in the restaurant. Anyway, benefit of the doubt and all that.  Onto the, um, 'areas for improvement'. The table wasn't ready when we arrived. Alright, we thought, not a problem, we can stand around and have a fifteen quid cocktail instead. We were eventually shown to our table to discover a sofa down one side, yep: a SOFA. I took the hit but it did mean that I was a good 1.5 feet lower in altitude than everyone else, like being in the baby chair. No one would take me seriously and I struggled to access the conversation.  Drinks arrived... 1 x pint poured straight on the lap of the birthday girl. They did bring a round of tequila sorbet shots, or something weird, to make up for it. Accidents happen I suppose, but then again that's easy for me to say: I've got a dry bottom.  I’ve always wanted to see what a £95 seafood platter looks like. In truth I was a little underwhelmed but I guess it would have been impressive in a gallery context. Dali made it work and he only had one lobster at his disposal, not even a Megaclam™. For the uninitiated, a Megaclam™ is a gritty chunk of mollusc sandwiched between two Disney™-sized plates of shell: nature's answer to the Seaburger. Both I and #BirthdayGirl gave it a whirl (you know: #newyearnewyou). It was hard work, but watching the rainbow of expressions on #BirthdayGirl's face as she chewed her way through this briny monster was at least a #beautifulbirthdaymoment, for which the restaurant deserves a significant amount of credit.  The rest of the platter was tastier, though at circa £2 a prawn it left both soul and stomach a little on the empty side. We had an #oystervirgin in the group and the experience wasn’t horrendous enough to put her off for life. It’s all about the small wins.  The main course took so long to arrive there were another couple of birthdays at the table. Me and my friend Harold thought we’d played it safe by ordering the mackerel, though when it eventually turned up it was so small I had to look twice to make sure it was actually there. We worked out it was exactly the same width as my friend's phone, and he doesn't even have the iPhone X. Flirting with the idea of making a complaint Harold asked one of the waitresses where the fish was from, to which she replied, ‘rest assured sir, everything is local.’ Which given that we were in SE1 was a little baffling. Maybe she meant Waitrose, or the Thames. Anyway, the mackerel didn’t improve with age and #BirthdayGirl’s lobster should have come with a free roll of crime scene tape (not in a good way). The poor thing looked like it had died in a motorway pile up, though at least we know it would have been a local one. I couldn’t even bring myself to look at the sea bass.  At this point two of our party had to leave to go and rescue a babysitter, though in reality we all knew it was the other way round. Desert came: three balls of air with chocolate on top. The air was the best bit. Incidentally, the whole place also smelt like a runway. Perhaps it's jet fuel they're using in those paraffin lamps.  Bill paid and off we went, to begin our fourteen-floored decent back to sanity (whoops there goes gravity). The journey down was quick, on account of the group being the sum total of FOUR HUNDRED POUNDS lighter than we were on the way up. It had worked out at the best part of seventy quid per head, which given that I was still so hungry I had to have a slice of toast is a bit on the steep side I’d say.", "date_of_review": "20 January 2020"}
{"review_id": 62, "restaurant_id": -9, "username": "hiiimsr", "date_of_visit": " January 2020", "rating": "1", "title": "Very disappointing", "comment": "Came for my birthday as it was recommended to us. Visited on a Sunday at 6pm as a group of 4 and we were 1 out of 2 tables in the restaurant. We was originally a table of 5 but we had a last minute drop out and notified them to request to sit at a sofa table of 4. They said they would get back to us but never did. This was only the beginning of the many problems to come. Upon ordering, we were notified that a large portion of the menu was sold out - all of the seafood section including the platters which is basically what we came for, as well as a few other dishes that we were looking forward to try. This was a moment where we were thinking why are we still here. We then ordered our food which came out quite fast to be fair, at this point there were more tables so quick service. Except we ordered some fries which never came and we had to chase up on them. Portions are minuscule, the scallop is literally one scallop and the clams are practically non-existent. However, the oysters were fresh and the octopus roll and sea bream was great. Next up is the biggest issue. We had asked for the bill and upon inspection, we noticed errors on our bill. The sparkling wine we ordered was shown as £45 on the menu but showed up as £50 on the bill and there were 2 orders of the fries on the bill when there was meant to be 1. We notified them of the issue and the waiter went to go investigate. He came back to us to say that the sparkling wine we ordered was out of stock and we were just given a different one. Without notifying us prior. If they had let us know that it was sold out, we could’ve made a different choice but we was just given whatever without being notified. I have never experienced this elsewhere before and as I have worked in hospitality previously, I would never have done this procedure myself as the protocol would typically get back to the customer, apologise that it’s sold out and to ask whether they would like to choose something else. Hence why this was absolutely bizarre. Upon fixing the bill, no apology was made by said waiter and he just dumped the bill onto the table. It was that behaviour where our table was not paying for the service charge as it was simply ridiculous.  Unfortunately, we had a poor experience and we missed out on a lot of the food that was sold out so I do wish to try again but maybe when it’s more established. P.S they do not allow any balloons in the restaurant so please be aware.", "date_of_review": "19 January 2020"}
{"review_id": 63, "restaurant_id": -9, "username": "Hastings-by-the-sea", "date_of_visit": " January 2020", "rating": "3", "title": "good food but", "comment": "well set up restaurant with decent menu and an overpriced wine list. went at 4.30 on a wet tuesday and the dining room was almost empty of customers; nonetheless, we were placed at a table right next to 2 blokes sitting at what looked like a coffee table in the corner, so close it was like being a foursome. why on earth they would put customers so close together as that in an almost deserted restaurant? weird! but the happy hour oysters went down a treat as did the carafe of vinho verde ( a snip at £30). and the views are stunning. ", "date_of_review": "15 January 2020"}
{"review_id": 64, "restaurant_id": -9, "username": "87almudena", "date_of_visit": " December 2019", "rating": "5", "title": "Best seafood plates in London, feels like being in Spain", "comment": "We had dinner at Seabird for our anniversary and it was such a great discovery. The place is beautiful and the view is truly stunning. Service was great and very friendly and the food was seriously good. I am Spanish and love seafood and this is to date the best seafood I have had in London. The octopus dish, the crab buñuelos and the Basque stew were simply amazing. Totally recommended.", "date_of_review": "5 December 2019"}
{"review_id": 65, "restaurant_id": -9, "username": "paulyb3000", "date_of_visit": " December 2019", "rating": "5", "title": "Finding it was a little tricky but fab when we did!", "comment": "So you have to walk through the Hoxton, find the lift and make your way to the 14th floor, there's no indication that the Seabird is there but it is! When you arrive, you're in a light and airy, stylish colonial-style restaurant which looks sharp and delivers some excellent Spanish food. Our dishes included croquetas, Iberico ham sandwich, cabbage stew (which is actually delicious braised cabbage on a bed of beans), scallops and then a shared Manchego cheesecake for dessert. Plus 3 glasses of cava and a double espresso for £110 - not amazing value but not bad at all. Views amazing on a good day and pretty good on a cloudy one. Service quick and relaxed, all in all an excellent venue.", "date_of_review": "10 December 2019"}
{"review_id": 66, "restaurant_id": -9, "username": "Dixie3333", "date_of_visit": " December 2019", "rating": "5", "title": "Quality", "comment": "First time visit and can only say it was a very good choice Excellent venue great views super staff ( Cossi our Romanian host was awesome ) Food super good and yes it’s expensive but you expect to pay for quality and location Try the octopus and crab balls !!  Good wine list again you pay for quality Having just spent the weekend in NY I would highly recommend Seabird super vibe M&P", "date_of_review": "19 December 2019"}
{"review_id": 67, "restaurant_id": -9, "username": "Andrew G", "date_of_visit": " November 2019", "rating": "5", "title": "A great roof-top oasis", "comment": "Stylish 'conservatory ambience, high celings and lots of greenery, with fantastic views all round. Specialises in oysters, fish and shelfish but non-fish folk also catered for. Dont miss the Manchego cheesecake.", "date_of_review": "5 December 2019"}
{"review_id": 68, "restaurant_id": -9, "username": "Phpx", "date_of_visit": " October 2019", "rating": "3", "title": "If you like loud music", "comment": "We went for dinner in the new restaurant, on the 14th floor of Hoxton hotel in Vauxhall. the view is great and eating at the terrace must be amazing but not at that time of the year. It was on Friday night and what we didn't know is that on Friday and Saturday, they play disco music, extremely loud! The food was good but the steamed clams had empty shells mostly, other plates were better, like the Devonshire crab bunuelos, quite subtle. the jamon was OK, nothing more. As is it quite expensive, we won't go again, unless it is to enjoy the outside terrace.", "date_of_review": "3 January 2020"}
{"review_id": 69, "restaurant_id": -9, "username": "ChrisC979", "date_of_visit": " December 2019", "rating": "5", "title": "Great dinner in a lovely ambient with amazing view", "comment": "Been there last month to celebrate a special location with my wife. We asked for a good tabke and the manager pleased us with a lovely table with the most amazing views of the City. The service was great and oysters were top quality with a great choice from best parts of the world. Other dishes as langustines and fish were fresh and delicate too plus they have a great selection of wines. At the end they were also so nice to to offer and let us try couple of glasses of moscato. I was really surprised also by the bill that wasn't expensive at all in consideration of what we ordered, drinks, wine, etc. Strongly reccommend to anyone and looking forward to be back to try their lobster. Bravi!", "date_of_review": "14 January 2020"}
{"review_id": 70, "restaurant_id": -9, "username": "clerkenwelltraveller", "date_of_visit": " January 2020", "rating": "4", "title": "Great space and very good food", "comment": "Probably one of the best sky bar restaurants in London. Great views. Service was unpretentious and very friendly. Food was very good. Would go back again and recommend it.", "date_of_review": "18 January 2020"}
{"review_id": 71, "restaurant_id": -9, "username": "khayyam50", "date_of_visit": " December 2019", "rating": "4", "title": "Dinner", "comment": "Went here for dinner with my son and it was great. The location and view of london was nice, the place is very nice and clean the staff and service was good. We had the calypso which was an assortment of seafood everything tasted great particularly the oysters. They had raw shrimp in the platter which I did not like.great place nice atmosphere I would be back.", "date_of_review": "3 December 2019"}
{"review_id": 72, "restaurant_id": -9, "username": "jpinchard", "date_of_visit": " November 2019", "rating": "5", "title": "Incredible!", "comment": "I dined at Seabird recently and what an incredible experience! While it was a bit cold to dine outside in November, the outdoor space is lovely with stunning views. If the wow-factor of the views wasn't enough, the raw bar in the center of the restaurant is gorgeous and beautifully presented.  Our waiter was helpful in describing the selection of oysters and the few we chose were delicious. We also ordered the Octopus Roll which is not to be missed. We shared the Basque Stew and it was so flavorful, we didn't want it to end! For dessert we opted for the trio of mini cream filled donuts, each one a tasty indulgence. The service was excellent and everyone was very helpful with recommendations. I will definitely be back and cannot wait to visit in the summer as well to take in the London views from the terrace with a cocktail!", "date_of_review": "15 November 2019"}
{"review_id": 73, "restaurant_id": -9, "username": "Arielis M", "date_of_visit": " November 2019", "rating": "4", "title": "Outstanding", "comment": "Excellent restaurant  My friend and I went for lunch las Sunday and felt in love with this restaurant. Service was magnific, Costas make us feel like we have been there many time even when it was our first time in Seabird (by the way my friend thinks he looks like an actor that I can't remember the name right now). And the girl from Belice is very friendly and pretty.  The food was delicous and what about the koctels \"fantastic\".  I am not sure if the have access to the toilets for dicebled people. The view is amaizing. I'm thinking to go again next month. ", "date_of_review": "12 November 2019"}
{"review_id": 74, "restaurant_id": -9, "username": "hospitalityf", "date_of_visit": " October 2019", "rating": "5", "title": "Beautiful location and great food", "comment": "Great reception, wonderful staff. We just went for Oysters and a cocktail. So many different types of Oysters to choose from. Definitely going back for Dinner.", "date_of_review": "15 November 2019"}
{"review_id": 75, "restaurant_id": -9, "username": "critique6", "date_of_visit": " November 2019", "rating": "2", "title": "Decent food but service poor and seating uncomfortable", "comment": "Decent seafood; expensive wine (lack of bottles for < £40 - the restaurant is in Southwark, not Mayfair). Some of the seats are low down arm chairs and low down sofas (we were sat at one of these tables) - would be fine for a drink but very strange and uncomfortable to eat a full 2 hour dinner at. Left with a sore back. The service was almost comically bad (but ended up being dealt with very well by a manager who took over our table near the end, explained and apologised a lot, removed the wine and service from our table and gave us a complementary digestif - he was very friendly and helpful - thank you). Arrived at the restaurant and wasn’t greeted by anyone - there were about 2 or 3 people standing around, but because I don’t think they were the greeters and the greeters were busy, it looked like they didn’t think it was their job to greet so they just left us standing there - not a great start. We were placed at the low down uncomfortable table - we asked to move and were reluctantly told yes I suppose we could find you anther seat (as if we were being a total burden). We carried on with the meal and then 50 (fifty) minutes later a lady came up and started to take the things off our table and said “you want to move, yes?”. Yeh that was 50 minutes ago, it’s probably a bit late now. The communication was obviously not working between all the staff (there are loads of them and it’s quite confusing for the customer what each of them do). We ordered a bottle of wine, it took ages to come then it looked slightly different so I asked the waiter if it was the right one and he said yes. After a few drinks of it, I asked to see the wine list again (had to ask twice for it) and then turned out it was the wrong one - not great. Manager said we could swap, but we were already mid way through it, so was a bit late, especially having been told it was the right one. We didn’t receive the bread that we ordered with our shellfish platter - didn’t end up asking to get it as were starting to feel awkward asking for things - but it ended up being on the bill at the end - also not great. It feels like the restaurant has tried a bit hard to be a cool and trendy set up, but the basics of good service and comfortable seating were just not there at all. As I said, manager dealt with it really well in the end, but the damage was done already - it would have been comically bad for it to happen at a Wetherspoons, never mind an expensive restaurant.", "date_of_review": "17 November 2019"}
{"review_id": 76, "restaurant_id": -9, "username": "LSmith989", "date_of_visit": " November 2019", "rating": "3", "title": "Nice place but overpriced and overbearing service", "comment": "No doubt this is a beautiful restaurant however it is hugely overpriced. The small plate of scallop for £13 is literally one scallop.... The service was slightly overbearing and the food whilst nice was just so expensive for what it was. Our plate of one tiny prawn was taken away by an over zealous waitress before we had eaten all of it.  Halfway through the meal we were brought bread which I imagine we should have been brought at the beginning although we didn't order it. We were then charged £2.50 for this. We were also brought 3 gin and tonics instead of 2 (there were 2 of us at the table) and the third one was on the bill at the end which I had to ask to be removed. The service was muddled and we were served by various different people throughout. All were pleasant but it felt they were all confused. The cocktail list is great and we enjoyed these.", "date_of_review": "21 November 2019"}
{"review_id": 77, "restaurant_id": -9, "username": "chris2pherwong", "date_of_visit": " November 2019", "rating": "4", "title": "Lovely Lunch with A View", "comment": "Came here for lunch on a Saturday and was wowed by the view. The restaurant is on the 14th floor of the recently opended Hoxton Hotel and the decor reminds of of Florida (or even St Kilda in Melbourne) with gold accents, basket ceiling lamps, black and white tiled floors and palm trees. There is a very nice terrace area although the view of the Shard is only from inside the restaurant. Service was good with a friendly blonde server taking good care of us. I had the Basque seafood stew which was excellent and they gave us complimentary crab open topped sandwiches (like a bruschetta). The oysters were very good, I am not normally an oyster fan but the creamy oyster was delicious. We also had the octopus roll which was quite nice. My companions had the mackerel (so so, too much oil), crab cakes (could not really taste the crab) and sardines (not bad). We had a side order of the interesting potatoes shaped like small balls. The cheesecake as per the other reviews was very very good, and the donuts were also a crowd pleaser. Yes it is on the pricey side (expect to pay £50 per head) but the atmosphere, views and friendly staff made it a lovely experience on a Saturday afternoon. Will definitely be back.", "date_of_review": "25 November 2019"}
{"review_id": 78, "restaurant_id": -9, "username": "Patricialyndixon", "date_of_visit": " October 2019", "rating": "5", "title": "Fantastic selection of fresh seafood", "comment": "Fantastic new seafood restaurant with a chic interior and great views!! The food was so good and their selections of oysters is very vast!!", "date_of_review": "28 November 2019"}
{"review_id": 79, "restaurant_id": -9, "username": "aroundtheworld247365", "date_of_visit": " November 2019", "rating": "5", "title": "Fantastic views, cocktails & lovely staff! 🍸", "comment": "Stopped by here to take a look, as was staying in the hotel and was pleasantly surprised so we stayed! The views are incredible and the decor is beautiful. The staff were all very welcoming and attentive. We chose two cocktails recommended by the friendly and knowledgeable Italian barman and we enjoyed the description, taste and presentation of these. Despite their large-looking size, the portions were small and only provided a few sips before we were left with ice only... I guess that’s to keep you ordering more! Especially on a sunny day whilst enjoying the outdoor terrace we will be back to sample some oysters with our cocktails! ", "date_of_review": "21 November 2019"}
{"review_id": 80, "restaurant_id": -9, "username": "100discerningman", "date_of_visit": " November 2019", "rating": "5", "title": "Secret restaurant with a view", "comment": "I was recommended this restaurant by a colleague for a business lunch. When you arrive at the Hoxton Hotel you would not know this place existed but a lift whisks you up to the top of the building and this secret location. The dinning room is quite large and has great views, there is also an outdoor seating area which I imagine would be great when the weather is warmer. They offer \"small plates\" for tapas style eating/starters and we shared the Basque Stew for the main course which I highly recommend. All food was lovely, ambience nice and service was great. I will be back! One last comment...this is a seafood restaurant, there are only one or two non seafood items on the menu. Great for me but might not work for all your party.", "date_of_review": "11 November 2019"}
{"review_id": 81, "restaurant_id": -9, "username": "BoatmanWindsor", "date_of_visit": " November 2019", "rating": "5", "title": "Brilliant", "comment": "Called in today for a couple of drinks at the downstairs bar. Super, helpful staff, great friendly service. Then decided to see if the Seabird (14th floor) could fit us in for lunch? We were in luck, no problem said the lovely lady at the restaurant reception (whose name I omitted to register) - so I went back down to the bar to collect the other half. We were given a choice of seating and opted to sit opposite the kitchen (always interesting to watch). Two 'starters' - scallop and charred gem, followed by John Dory for two, and accompanied by a Portuguese wine (which slipped down a treat). We shared the starters, and my salad-averse partner adored the charred gem lettuce, then the wonderful John Dory arrived - and my fish-averse partner (unless its scallop or monk-fish) snaffled more it the mains than me!! The service was excellent, attentive - but not too much so, and very friendly. We left after coffee, but not before booking our next visit - if they keep this standard of food and service up, we won't be able to get a table so decided to get in quick!! Thank you all at the Seabird for a brilliant Sunday lunch/afternoon.", "date_of_review": "3 November 2019"}
{"review_id": 82, "restaurant_id": -9, "username": "chompcheese", "date_of_visit": " November 2019", "rating": "5", "title": "Really Amazing Seafood", "comment": "Not something I expected given the location and that it's in a hotel but the experience was incredible! Every dish we got was amazing, the oysters were so fresh and there was a really great variety to choose from, the octopus was cooked perfectly, the sea bream was buttery with just the right amount of seasoning so it didn't overwhelm the fish. Just everything we ordered was delicious - lobster was a bit on the small side, but it's London.  I love seafood and eat a lot of it so this really was a pleasant surprise to find in London, I highly recommend Seabird.  Also, the atmosphere was beautiful and the entire layout and decor added to the entire dining experience.", "date_of_review": "19 November 2019"}
{"review_id": 83, "restaurant_id": -9, "username": "A900409", "date_of_visit": " October 2019", "rating": "5", "title": "What a place", "comment": "Imaginative menu, beautiful decor, spectacular views and most importantly personalised service. This place is a must go! Start off with some oysters from their extensive oyster selection, followed by a John Dory (cooked beautifully) to share, for the grand finale have the cheesecake (it's out of this world). The wine list is fun with some funky selections. A good Pet Nat to start of the evening is always fun. Thank you for a lovely evening!", "date_of_review": "20 October 2019"}
{"review_id": 84, "restaurant_id": -9, "username": "Gary S", "date_of_visit": " October 2019", "rating": "4", "title": "Seafood fun in the sky", "comment": "we were welcomed by friendly bubbley staff/hosts who looked to be enjoying the new enviroment which was infectious and we were made to feel very welcome. this is a beautiful place with stunning views even on a wet day (will be better in the summer months when you can sit outside) The menu is not as intense as alot of places and is lacking in some dishes, ie would be good to see say their versions of fish fingers, seafood pie the odd burger something traditional but with a twist and more reasonable cost, but in saying this the food we had was amazing (chips are fab) Also the desert menu was lacking...need more chocolate Everyone should go and enjoy ...we def did and will be back", "date_of_review": "28 October 2019"}
{"review_id": 85, "restaurant_id": -9, "username": "alistairhigson", "date_of_visit": " October 2019", "rating": "5", "title": "Amazing foods with amazing views", "comment": "Visited the restaurant twice now and the service and food keeps getting better. The decor is beautiful and the general vibe is fantastic. Would definitely recommend a visit; the octopus roll was that good we had to order another! The view around sunset time is not to be missed either!", "date_of_review": "20 October 2019"}
{"review_id": 86, "restaurant_id": -9, "username": "lifelover0311", "date_of_visit": " November 2019", "rating": "5", "title": "Celebration with the family ", "comment": "Perfect Sunday afternoon in Southwark. As soon as we got out of the lift we were greeted by a friendly and smiley hostess that showed us to our table. Our lunch experience couldn’t be more perfect thanks to Simone our waiter. He was very friendly and helpful and looked after us very well!  The food was amazing too, super tasty.  A modern twist on seafood restaurant. All this while enjoy a magnificent view over the Shard and the London Skyline. We will definitely come back! Well done Hoxton! ", "date_of_review": "3 November 2019"}
{"review_id": 87, "restaurant_id": -9, "username": "fabulousmissk", "date_of_visit": " November 2019", "rating": "5", "title": "Wow!!", "comment": "One of the most fabulous places in London. The view was amazing, overlooking the city skyline, delicious perfectly cooked food. Such attentive and friendly staff. Couldn't fault a single thing. Will definitely be back soon.", "date_of_review": "5 November 2019"}
{"review_id": 88, "restaurant_id": -9, "username": "Thetaff", "date_of_visit": " November 2019", "rating": "2", "title": "Great views, hopeless service, average food", "comment": "The space is lovely and views are great. The room is too noisy (music), service is very poor and the maitre’d only seems interested in pruning his white and black panda inspired hairdo. The food shows little culinary flair and is expensive for what it is. Oysters were decent. For £100 a head I didn’t feel full, looked after, or satisfied.", "date_of_review": "8 November 2019"}
{"review_id": 89, "restaurant_id": -9, "username": "svanang", "date_of_visit": " November 2019", "rating": "1", "title": "Just a quick one", "comment": "I have never been treated so bad with a host in my life. We are all working in hospitality at Londons most visited hotels and we wanted to have a visit at the seabird. We didn't get a table which is totally fine. My girlfriend has a friend in the staff and we ant up just to look at the place but the hostess turned us down in the worst manner I have ever experienced. This hostess belongs in a job where service and personal contact is not required. It was a horrible experience. This hostess name is Katja and we have never felt so humiliated in our whole life.  We would never mention a name if the experience wasn't this bad. And really humiliating. We won't come back.", "date_of_review": "8 November 2019"}
{"review_id": 90, "restaurant_id": -9, "username": "Edwina M", "date_of_visit": " November 2019", "rating": "5", "title": "This will be my new local in London", "comment": "I attended for a quick drink after work on 06.11.19 but decided to stay and eat. The oysters were incredible and the Oyster chef \"Simon's\" passion was infectious as i sat at the end of the bar chatting enjoying the most delicious Oysters.  \"Magda\" on the bar was extremely attentive, friendly, fun and knowledgeable recommending the Charred Gem which was simply fab and another waiter whose name escapes me also chatted to me and recommended what the Devonshire Crab and i am glad he did!! Superb! Finally, \"Mark\" the Maitra D` could not do enough to make sure i looked after. I was really sorry and surprised to see the previous review who had such a bad experience with a host, i think it is important to name \"names\" and employ the right people as it seems the experiences have been \"night and day\". As for the criticism on music volume? That is just personal taste and i thought the music created a great vibe and atmosphere. The views were fantastic but that is not why i would go back, for me that was the icing on the cake. What I loved the passion for the food, the brilliant service and the incredibly fun, friendly staff. I will be back but i also hope Management take note of the criticisms because i would hate to have a lesser experiences. Get your team and \"consistency\" in their service and attitude right and this will be a \"go to\" place.", "date_of_review": "11 November 2019"}
{"review_id": 91, "restaurant_id": -9, "username": "Jay L", "date_of_visit": " September 2019", "rating": "5", "title": "You must eat here!!!!!!", "comment": "Staying at the Hoxton. This is their second night. Really can’t fault the service or food. Reassuringly expensive but basically sublime. I think we’ve found our new go to place south of the river. Excellent fish selection and lovely service from a young service. Great job.", "date_of_review": "24 September 2019"}
{"review_id": 92, "restaurant_id": -9, "username": "Keri S", "date_of_visit": " September 2019", "rating": "5", "title": "What a find!", "comment": "Took my mum and mum-in-law-to-be here and I am so glad I did. There are no words for the seafood aside from yummy (and I have been brought up on sea-to-table fish), the service is spot on (attentive, friendly, certainly not stuffy) and the views spectacular. I was debating whether to write a review as, once this place is more well known, it'll be so tricky to get a table!", "date_of_review": "29 September 2019"}
{"review_id": 93, "restaurant_id": -9, "username": "Sightseer270026", "date_of_visit": " October 2019", "rating": "5", "title": "New contender for best rooftop view in London", "comment": "There are several good rooftop bars and restaurants with views of London but the newest and one of the best is Seabird on top of The Hoxton in Blackfriars Road. The outdoor patio has plenty of comfortable seating, is very attractive, and the views are amazing. This is a fish restaurant with a European fusion that is quite unique. The oyster menu is incredible, the langoustines and the hot small plates are a delight and the main courses (plancha) are really special. We had a “fruits de mer” style platter on ice followed by half lobster starter and John Dory main course. The wine list is extensive and reasonably priced. There are some very good but inexpensive sparkling white wines some available by the glass. The cocktail are also very good especially the “Toucan” (served in a Toucan!) and the gin/grapefruit concoction. Expert mixology without a doubt. Service is very attentive and friendly but almost invisible just as it should be. The whole thing is very professionally run and all in all a great new find. Thoroughly recommended.", "date_of_review": "4 October 2019"}
{"review_id": 94, "restaurant_id": -9, "username": "Fizzypeaches", "date_of_visit": " October 2019", "rating": "4", "title": "Beautiful setting and food", "comment": "gorgeous new hotel with usual Hoxton styling - the restaurant was stunning, nice airy, leafy vibe. felt like our table was a bit small and we were crammed close to others given there was SO much space and where music was a little loud we struggled to hear eachother/waiters but the staff were incredible, soooo knowledgeable about the food and cocktails, food was all delicious, can't fault (a bit pricey - one single prawn was £18!) but couldn't fault the flavours or presentation, scallops were divine, the john dory was perfect and you MUST try the Manchego cheesecake - dreamy!", "date_of_review": "10 October 2019"}
{"review_id": 95, "restaurant_id": -9, "username": "835charlesr", "date_of_visit": " October 2019", "rating": "5", "title": "great food, exceptionably enjoyable evening. ", "comment": "Seabird restaurant was only open 3 weeks when we ate there in October. It was already bustling with buzz and people, eating and enjoying the view over the city. But the real attraction was the exceptional Iberian style cooking, plus a selection of 20 different oysters. The menu has seafood, vegetarian and pork selections. A thoughtful and reasonable wine list. We had a fabulous Basque style seafood stew, after the oysters. We ended with a cheesecake, which with it’s counterintuitive sprinkling of Manchego cheese, was delightfully delicious. The captain, who was hired two weeks prior, told us he tasted the stew and the cheesecake during his interview and accepted an offer on the spot. Good move by the management to have staff taste the food. The restaurant is on the top of the Hoxton hotel, a bit out of the way ( unless you are staying at the hotel, but well worth the taxi ride.", "date_of_review": "13 October 2019"}
{"review_id": 96, "restaurant_id": -9, "username": "gallivantinggirl00", "date_of_visit": " October 2019", "rating": "5", "title": "Love love love!!!", "comment": "Cannot fault anything at this beautiful new restaurant. Fantastic selection of food and wines along with impeccable service. Our lovely waiter really helped us to understand the menu and order a sensational selection of oysters. Octopus roll and lobster were both phenomenal. Stunning views and laid back charming ambience. Loved it so much I went 2 days in a row! Highly recommend. ", "date_of_review": "13 October 2019"}
{"review_id": 97, "restaurant_id": -9, "username": "Sambo70", "date_of_visit": " October 2019", "rating": "5", "title": "Outstanding in every way!", "comment": "We were lucky enough to be some of the first patrons at this beautiful London rooftop restaurant and were absolutely blown away by the quality of food, wonderful professional (but not pretentious) service and ambiance of The Seabird.  If you want to experience something very special, then this is the place. This restaurant also has one of the BEST and most extensive oyster selections in the UK  The views are spectacular! ", "date_of_review": "7 October 2019"}
{"review_id": 98, "restaurant_id": -9, "username": "LDN2012", "date_of_visit": " October 2019", "rating": "4", "title": "Beautiful, light restaurant", "comment": "This rooftop restaurant is flooded with light.  It has a sheltered outdoor terrace and the decor is soft and pretty.  The menu is mostly seafood with a Spanish bias.  We ate Grilled Octopus on a brioche bun, little crab cakes, plaice, and crisp salads with avocado. All delicious  The desserts including cheesecake & mini doughnuts were excellent.  The staff were all absolutely charming, led by the smiling manager Matilda.", "date_of_review": "16 October 2019"}
