{"review_id": 1, "restaurant_id": -17, "username": "marcinosh-li", "date_of_visit": " September 2020", "rating": "5", "title": "Best place to celebrate", "comment": "This gorgeous space is my latest new discovery in London. We celebrate our anniversary there and what a surprise it was!!! Location stunning! Brunch delicious! Cocktails fabulous! Staff so friendly and attentive! Victor you are superstar! Thank you for looking after us! Can’t wait to go back there!!", "date_of_review": "16 September 2020"}
{"review_id": 2, "restaurant_id": -17, "username": "nugenthorne_79", "date_of_visit": " October 2020", "rating": "5", "title": "Great little find ", "comment": "Went here for a quick drink out of the rain and was not disappointed - the atmosphere was relaxing but trendy... the service was great, drinks well presented! Great views even though it was raining and I can imagine in the summer this place is great! Will 100% visit again! ", "date_of_review": "28 October 2020"}
{"review_id": 3, "restaurant_id": -17, "username": "Emily D", "date_of_visit": " October 2020", "rating": "5", "title": "Amazing views and great atmosphere!", "comment": "We had the best Saturday evening here drinking champagne and the service was amazing! All the staff were very friendly and looked after us well, there was no stuffy, clinical atmosphere around COVID and the music was lively so people could relax and have fun! Would definitely come back to try some of the delicious bar snacks and take in the amazing panoramic views ❤️", "date_of_review": "19 October 2020"}
{"review_id": 4, "restaurant_id": -17, "username": "F4166MZsebastiank", "date_of_visit": " September 2020", "rating": "5", "title": "Great views, nice service, good food", "comment": "One of the best rooftops in town. We spent hours with our friends enjoying the beautiful weather, gorgeous views and amazing cocktails", "date_of_review": "15 September 2020"}
{"review_id": 5, "restaurant_id": -17, "username": "Charlotte_Lou_Perry", "date_of_visit": " August 2020", "rating": "1", "title": "Poor service", "comment": "Ordered a bottle of champagne, had to drink out of small glasses as apparently (after asking twice) they were using them all at a function. Something they should probably mention before you spend over £100 on a bottle of champagne. Club sandwich was not a club sandwich and was overpriced and dry. Staff whilst nice when they did speak to you were not at all attentive. Visually it’s a nice place but wouldn’t return", "date_of_review": "18 August 2020"}
{"review_id": 6, "restaurant_id": -17, "username": "SympatycznyG", "date_of_visit": " September 2020", "rating": "5", "title": "Amazing place with amazing cocktails! And what a view!!!!!", "comment": "I recently visited The Nest during my weekend trip to London and I must to say I was blown away!!!! We had table outside with amazing view. Staff was super friendly and attentive. Had definitely way too many Margaritas with my partner ha ha ha! Crispy Calamari and flat breads to die for!!! I will be definitely back and recommend The Nest to my friends around the world who will be visiting London. x", "date_of_review": "21 September 2020"}
{"review_id": 7, "restaurant_id": -17, "username": "Varifr", "date_of_visit": " December 2020", "rating": "2", "title": "Only for drinks", "comment": "Beautiful location, music was great and incredible vibes!!! That is!!! Don t go for food because is not worth it. We have waited more than 1 hour to get hamburgers and was 11.30 pm when we got them so we had to rush our dinner as at 12.00 pm they were closing. Drinks are ok but i was expecting more as i ordered a margarita and they served in the wrong glass ( mini martini cup). The classics are classics and cannot be changed! The place is worth it only for the incredible view!", "date_of_review": "7 February 2021"}
{"review_id": 8, "restaurant_id": -17, "username": "Rick3056", "date_of_visit": " December 2020", "rating": "3", "title": "Disappointed - Great for curating your Insta-life - Poor service ", "comment": "Disappointed - we planned, read reviews and booked in advance but The Nest did not meet our expectations.  The food was ok, hit and miss; delicious prawn bun and mini tartlets but dry scones and warm tea.... We booked afternoon tea in advance and arrived on time and seated at a window at the smallest table you’ve ever seen. We were reminded of our two hour slot (no problem with this). We ordered tea and a lager but without any explanation of when our food might arrive I didn’t drink my tea as I was waiting for my food. By the time it arrived my tea was cold and when I mentioned it I was advised I could have a top up. A simple explanation would have sufficed at the time of being seated.  The food was actually quite nice and the amount was more than enough however, you know that tense feeling you get when you’re constantly and unnecessarily looking around for service - well I had that feeling! No one there to replenish our drinks.... Oh, and it was freezing in there.....  I guess the problem is with this place is that it is ‘style over substance’ with the venue carrying the inattentive service and average food. We should have known better. It’s the place to be if you’re trying to curate your insta-life! Four people sitting close by were so entertaining as they took a million photos of each other in numerous comical poses and then spent an equal amount of time reviewing said photos . That said, it’s testament to to the lovely sky high venue and cool decor that encourages people to want to visit The Nest - fair enough.  We wouldn’t visit again. We enjoyed some of the food and had mixed feelings on the venue. We felt the service was poor. ", "date_of_review": "12 December 2020"}
{"review_id": 9, "restaurant_id": -17, "username": "G2979ZQangelac", "date_of_visit": " October 2020", "rating": "4", "title": "Fabulous ❤️", "comment": "Afternoon tea at The Nest, great atmosphere and service.  Lovely little pastries and cake selection. Nicely decorated with plants, greenery and comfy seating.", "date_of_review": "31 October 2020"}
{"review_id": 10, "restaurant_id": -17, "username": "JamesB247865", "date_of_visit": " August 2020", "rating": "5", "title": "Loved it!", "comment": "Having read a couple of negative reviews about this place just before I went, I was a bit concerned. However, it couldn't have been further from the experience I had, which was faultless. Social distancing in the bar/restaurant itself was in line with the current guidelines, and this made me feel very at ease. The staff were lovely and really helpful. They couldn't sit us out on the terrace straight away, so we had a snack and a drink inside, and they then moved us onto the terrace, once a space was available. All this was done very seamlessly. The view - incredible! Although not the only thing that made this experience really great. The food was excellent as well. Will definitely return and have already recommended the place to some friends. Thanks for a really nice time.", "date_of_review": "7 August 2020"}
{"review_id": 11, "restaurant_id": -17, "username": "SafferB", "date_of_visit": " November 2019", "rating": "5", "title": "pre lunch drinks", "comment": "Had pre lunch at The Nest. Very impressed from the welcome on the ground floor, reception welcomes as you come out of the lift, to the waiter service, drinks menu and spectacular service.  Will definitely return.", "date_of_review": "25 November 2019"}
{"review_id": 12, "restaurant_id": -17, "username": "Annette T", "date_of_visit": " December 2019", "rating": "5", "title": "16th floor bar area, great cocktails, lovely staff and spectacular 360 degree views of London", "comment": "This is a really special place to visit on your own if you want to chill in a lovely room with spectacular views, as a couple or a larger group. We were a group of 11 and really enjoyed the atmosphere, the interaction with the staff and the opportunity to get great views (and pics) of the London landscape. Interesting selection of cocktails - not the usual and a good selection of nibbles. We had booked for our group so advisable to ring in advance as a new venue with quite high security - which was quite comforting although it did take a few minutes to gain access.", "date_of_review": "12 December 2019"}
{"review_id": 13, "restaurant_id": -17, "username": "m3jal", "date_of_visit": " February 2020", "rating": "2", "title": "Sticky Toffee Pudding - Poor", "comment": "Sticky Toffee Pudding [Orange supreme, salted caramel sauce, crème fraîche] First time to treehouse and I recall the old hotel in the location was nothing to write home about but this new hotel looks very up to date and has a story around the brand, lets see if we get to go back to do a full F&B review and give some more insight into the brand and fuller experience. This was just a quick visit so I thought I would just order a dessert.  Having some experience of various places serving Sticky toffee pudding this was my selected option.  I was informed this is made fresh on-site and on a bright afternoon in the roof terrace this was the perfect surroundings and really looked forward to this prior to my meeting.  It took some time but this is usually a good sign, presentation is nice but afraid this is just too small a portion and I have had many a sticky toffee pudding and disappointed in a number of areas from the portion size through to the taste and was served cold, even the base powder had no real taste and sorry but I dont think you need to try to be clever with a sticky toffee pudding other than do it well and provide a good size portion with a home made ice cream and should be served hot with a special toffee sauce, it should be light and moist but this failed on all counts and was cold and dry.  I will look to attend again and try more dishes but I would urge the chef to reconsider this option and maybe on my next visit I can spend time to try a few options.", "date_of_review": "21 March 2020"}
{"review_id": 14, "restaurant_id": -17, "username": "stephaniecC", "date_of_visit": " March 2020", "rating": "5", "title": "Hidden gem with stunning views and decor", "comment": "Absolutely beautiful and calm place. Ideal for cocktails - yes its expensive but it really is worth it. So glad to have found it.", "date_of_review": "17 April 2020"}
{"review_id": 15, "restaurant_id": -17, "username": "cocojack123", "date_of_visit": " December 2020", "rating": "1", "title": "Lovely staff, shame about food and lack of heating inside!!", "comment": "The place was freezing even though we sat inside for the whole visit! Staff were lovely and gave us blankets but we were so cold when we left! Got stale ends of the bread for afternoon tea and can’t believe it was advertised as roast turkey when it was clearly cheap turkey slices. I asked for no fish/seafood and got nothing as an alternative.Save your money, much better places to go for £60 for afternoon tea for two! Also squeezing 4 people from separate households into those tiny lifts is very irresponsible in COVID times!!!", "date_of_review": "14 December 2020"}
{"review_id": 16, "restaurant_id": -17, "username": "MattS049", "date_of_visit": " February 2020", "rating": "5", "title": "New York Vibes, fantastic views", "comment": "We stumbled across The Nest whilst enjoying a night out in town and we were not disappointed in the slightest. You enter through the main hotel entrance and are transported to the bar via lifts, upon the doors opening you were greeted by a beautifully designed bar and restaurant area, with house music filling the air. Having arrived as a walk-in, we expected to have to sit at the bar which would have been fine. Within moments of finding bar stools a stewardess approached us and let us know that a table had become free, this level of customer care is superb. We were seated by a floor to ceiling window, with views across the London skyline, it was spectacular and the perfect backdrop for photos.  The cocktails were nothing short of amazing; each one prepared on site on a 360 bar; so you really get amongst the action. So reasonably priced, when you account for the level of service you receive.  We didn’t eat here, but all commented on the inviting smells coming from the kitchens; sadly, we’d eaten elsewhere!  A great place to meet friends, celebrate and chill.", "date_of_review": "4 May 2020"}
{"review_id": 17, "restaurant_id": -17, "username": "clairedenby", "date_of_visit": " July 2020", "rating": "5", "title": "Just wonderful", "comment": "After waiting months for an afternoon of cocktails, I wasn’t disappointed. We arrived late on Sunday afternoon so we had our pick of seats. The views speak for themselves but the bar itself is stunning.  The decor is homely yet glamorous without the need for gimmicky Instagram photo opportunities.  Service was attentive and whilst the team were clearly adhering to the new social distancing measures, they were happy to have a chat and made us feel very welcome. Our drinks were well made and arrived quickly. We had eaten elsewhere but a glance at the menu made us want to return next time for food. A special mention goes to Mikey who made the booking process seamless. He went above and beyond to accommodate us which gave a perfect first impression. One which was echoed throughout our booking. We had a truly wonderful time at The Nest and will definitely be back.", "date_of_review": "13 July 2020"}
{"review_id": 18, "restaurant_id": -17, "username": "BeckyR900", "date_of_visit": " July 2020", "rating": "1", "title": "Can you put zero?", "comment": "We visited on 25.7.20 and had high hopes as I had read about the Nest in two magazines.  On entering the restaurant, the front of house staff greeted me with 'You only have a 2 hour slot', not particularly welcoming! We sat down and requested some aperitivi, we were told that none were available and that the best they could do was bread basket. The bread arrived along with one set of cutlery and no plates and a meagre ration of butter. The bread was not artisan but of the pre-packed, part-baked, uniform, tasteless variety you would expect in a motorway service station.  Before the main course arrived, the waiter asked 'Would you like clean cutlery'. I was staggered at being asked such a question - given that hygiene standards should be high.  We ordered filet steaks and when they arrived they looked far from appetising. They were accompanied by blanched salad leaves - soggy, undressed and discoloured. The steak was terrible, probably the worst I have ever eaten. The meat appeared to have been cooked on a dirty grill and there was an overwhelming burnt taste. The taste of the meat did not come through at all. They were also under-seasoned. Never in my life I have left meat uneaten on my plate.  It was a poorly ran establishment with no check-backs, no condiments offered and a poor drinks selection.  I would also like to add that the ambiance was far from relaxing. There was a live DJ that played bass heavy dirge.  Upon paying the bill, I informed the member of staff that the meal was unsatisfactory. He was ambivalent and reluctant to take any action, hence having to voice my concerns on here. I shall also be writing to the Head Office.  I do not want other people to be subjected to overpriced 'room service' style food.", "date_of_review": "26 July 2020"}
{"review_id": 19, "restaurant_id": -17, "username": "Ginette P", "date_of_visit": " July 2020", "rating": "5", "title": "Fantastic staff", "comment": "Fantastic staff especially Juan they couldn’t do enough for u they move out of the way so good the drinks are expensive but the roof top,terrace is absolutely fantastic", "date_of_review": "10 July 2020"}
{"review_id": 20, "restaurant_id": -17, "username": "MarkS302", "date_of_visit": " August 2020", "rating": "1", "title": "style no substance, would never return", "comment": "Welcoming email from manager, all good, then downhill from there. No social distancing attempted, all very close together tables, definitely not 1 metre apart. Told we would need masks in the lift and in the bar until sat down, but that did not happen, ushered into a lift with others who were not wearing masks, (why?!) no one wearing masks, in the nest, staff had them around their necks half the time, no one to greet you when you walk in, stood there like lemons.  Food looked average, but did not matter as we were ignored for 30 mins when sat down, told we could not have an empty table outside as it would need a clean, how long could that take??!, we walked out in the end. Possibly teething trouble but not worth risking covid for zero attentiveness and v high priced menu with ZERO service. Avoid until something is done to give any attempt at customer service when public confidence is low, standards should be near 100 percent.", "date_of_review": "5 August 2020"}
