{"review_id": 1, "restaurant_id": -16, "username": "RachH1179", "date_of_visit": " August 2020", "rating": "3", "title": "Went on sunday and the brunch", "comment": "Went on sunday and the brunch menu was on offer. Good points - venue lovely, wine list good, relaxed service. Bad points - portions tiny, mixed leaf salad was just a chopped up iceberg, took an age to get the bill. In summary would return for drinks but not food as food represents poor value for money and left hungry. ", "date_of_review": "23 August 2020"}
{"review_id": 2, "restaurant_id": -16, "username": "samk392", "date_of_visit": " August 2020", "rating": "5", "title": "Perfect service, excellent food.", "comment": "From the outset, the service at front of house was perfect. For a very smart restaurant the first impressions were not pretentious nor snobby. We were taken to our table and offered water straightaway. The service from then on in was nothing short of perfect.  We had the small plates menu and every dish was outstanding. The Caesar salad and chicken were both brilliant. A very good experience. Thank you to the staff and the chefs - we will be back. ", "date_of_review": "5 August 2020"}
{"review_id": 3, "restaurant_id": -16, "username": "Florence_and_Mary", "date_of_visit": " August 2020", "rating": "4", "title": "Not really brunch ", "comment": "Allegra had been on the list for my friend and I to visit and we were pleased to book a table for their brunch menu when they reopened. Our booking for 12pm saw us one of only two couples in the restaurant so it made a very quiet and relaxing atmosphere. Things ‘picked up’ a little throughout our meal as more diners joined other tables. Staff were exceptionally attentive and very polite.  We found the menu less brunch and more lunch with not many items that jumped out at us.  My friend ordered the crab, I the fried gnocchi and for for the table the whole chicken and bread. The gnocchi and crab arrived first and we were told the chicken would arrive separately - it would’ve been helpful to have been told this on ordering as we suspect they are cooked to order as it did take some time to arrive. The portions are small and despite being asked you want the whole chicken’ I’m glad I did order it as the gnocchi would have left me hungry as delicious as it was. The whole chicken was £31 and served only with a sauce and alioli; again as tasty as it was it wasn’t quite worth £31.  With a limited menu offering I wouldn’t necessarily pick to visit again but would happily dine again if invited with other friends. ", "date_of_review": "17 August 2020"}
{"review_id": 4, "restaurant_id": -16, "username": "Bobbuild", "date_of_visit": " August 2020", "rating": "5", "title": "Birthday dinner", "comment": "Can’t fault the food and service here. Every dish was delicious and well presented. Nice touch of tequila shots for the table to celebrate birthday girl! Can’t be long before they get a Michelin star. ", "date_of_review": "25 August 2020"}
{"review_id": 5, "restaurant_id": -16, "username": "87JoshB", "date_of_visit": " August 2020", "rating": "5", "title": "Superb in every way", "comment": "I literally couldn't fault this restaurant for atmosphere, food, service, etc. We came for a treat dinner as a couple and it was absolutely fantastic. The staff are so welcoming, professional and genuine and the food is knock out. Genuinely one of the best dinners I can remember. I'm still daydreaming about the sweetcorn and white onion velouté! Everything had unbelievable flavour. We were greeted after we walked in by the Head Chef Patrick Powell and it just made it feel all the more special. Highly recommend this restaurant.", "date_of_review": "31 August 2020"}
{"review_id": 6, "restaurant_id": -16, "username": "Silvano S", "date_of_visit": " July 2020", "rating": "5", "title": "Sublime experience", "comment": "Allegra is a rare place where refined dining, creativity, indulgence, style, and staff courtesy exceed expectations. During the summer a stunning garden terrace is open for a classy aperitif or a unique al fresco dining experience.a The wine selection is impressive as it is the variety of the menu. It's highly recommend as you can also enjoy superb sviews over the Olympic Park.", "date_of_review": "3 August 2020"}
{"review_id": 7, "restaurant_id": -16, "username": "John A", "date_of_visit": " August 2020", "rating": "5", "title": "Refreshingly good! A top quality restaurant in Stratford", "comment": "The £28/35 2/3 course menu is exceptionally good value, food excellent and service impeccable. Came away very satisfied with our meal and will definitely be returning.", "date_of_review": "20 August 2020"}
{"review_id": 8, "restaurant_id": -16, "username": "g40max", "date_of_visit": " August 2020", "rating": "5", "title": "Top tier cooking - minimal fuss", "comment": "Some hotel restaurants really feel like they are an add-on to the hotel - Allegra is the opposite; A restaurant so good they decided to build a hotel underneath it!  Everyone, from the doorman to the sommelier, was utterly charming and helpful with minimal pretentiousness. There was great service throughout the meal. To start we had the lobster agnolotti and the confit chicken wing - both excellently balanced and sensibly portioned. For main we had the sharing rib eye - cooked to perfection, and for dessert we had the millefeuille and the parfait - both original and delecious. All told - £100 a head. Cannot recommend Allegra highly enough, for any occasion,", "date_of_review": "8 September 2020"}
{"review_id": 9, "restaurant_id": -16, "username": "oreghe", "date_of_visit": " September 2020", "rating": "5", "title": "Gets better and better", "comment": "Second visit this evening and even more blown away by the food. Service and atmosphere top notch too. Could not fault it in any way!", "date_of_review": "24 September 2020"}
{"review_id": 10, "restaurant_id": -16, "username": "sallyh456", "date_of_visit": " October 2020", "rating": "5", "title": "Fabulous Evening Thank you", "comment": "The chef really deserves a Michelin star, or two. We wanted to take our daughter and her fiancé out to celebrate their engagement. The staff were lovely. We felt very safe and Covid19 regulations strictly adhered to {we're nearly 70} and very well looked after. The food was some of THE BEST we've had in London ever.Each course was interesting with zingy fresh flavours, and beautifully presented. Louigi, the sommelier, was informative and knowledgable and delightfully enthusiastic. They have a really interesting wine list with wines by the glass, to broaden one's experience, which we felt was a perfect compliment to the excellent food. A really special, splendid evening. Thank you.", "date_of_review": "2 October 2020"}
{"review_id": 11, "restaurant_id": -16, "username": "Epops", "date_of_visit": " July 2020", "rating": "5", "title": "Amazing Food", "comment": "Very impressed with this restaurant, the surroundings were gorgeous and the food was some of the best we have tasted. There were 4 of us and we opted for the chefs selection, we were not disappointed at all. The pictures probably don’t do the food justice but can honestly say from the 7 courses every bite was delicious. Excellent value for money at £68 per person as would easily pay much more for the same quality in the centre of London. Well done Allegra", "date_of_review": "2 August 2020"}
{"review_id": 12, "restaurant_id": -16, "username": "Q1386AHdavidh", "date_of_visit": " February 2020", "rating": "1", "title": "Excellent bread but the rest was bland", "comment": "We went on this American Express Platinum Card promoted evening and as a result had high expectations. The bread was plentiful (thankfully) and delicious. Starters were for sharing but three small plates for four people was odd - portion sizes were small and quality bland. The main dish was a rather tough and tasteless small piece of pork plus one roasted carrot. The deserts were tasty but small portions and overly fussy. The wine was good, the service inattentive and we waited a long time for each course to arrive. Expensive for what we ate. Not worth traipsing out here for such mediocrity", "date_of_review": "12 February 2020"}
{"review_id": 13, "restaurant_id": -16, "username": "Balancedviewfromtwo", "date_of_visit": " February 2020", "rating": "4", "title": "Sunday Lunch Menu - tasty but not impressive", "comment": "This is the second time we have been to the restaurant- the first meal was a Friday night not long after opening and the second a Sunday lunch. Each were tasty but did not hit the mark and a-bit over priced for the offering. It lacks the top quality finish which it is clearly striving for, which is a shame as the restaurant is something that Stratford really needs!", "date_of_review": "3 February 2020"}
{"review_id": 14, "restaurant_id": -16, "username": "beckyldav", "date_of_visit": " February 2020", "rating": "3", "title": "Disappointing, but some plus points", "comment": "After all the great reviews, I was keen to try Allegra out so I booked it for my husband’s birthday. The restaurant is beautifully designed, and we enjoyed the cocktails we had at the bar - the bar service was also very good. However, if the restaurant is going to charge £170 for a meal for two they really need to up their game. The bread and starter (artichoke veloute) were both excellent. I also enjoyed the wine the friendly server suggested. However, the cod was awful. It came in a broth which just drowned any cod pieces and was completely tasteless. Combined with some stringy vegetable it was a hard dish to physically eat. I spent most of the time trying to chase the cod piece around the broth and very long stringy vegetable. However, after a couple of mouthfuls I decided it was not worth the calories and didn’t eat any more. What’s the point eating something so bland! My husband had the pork. It looked sous vide- so while it comes out looking a bit like the pork you would get in a school dinner he did report that it was very nice. We had the honey cake and the white chocolate mint thing to finish. Honey cake was good. White chocolate thing needed to be a bit creamier with more white chocolate, it was not that inspiring. I ate it but it had no finesse and I felt they really needed to raise their pudding game. Another disappointment was I had stated it was my husbands birthday when booking and again when we came into the restaurant. But no token happy birthday on the plate was done or anything similar. All in all, was it worth £170 and a trip out to Stratford - no. But hopefully things will improve", "date_of_review": "14 February 2020"}
{"review_id": 15, "restaurant_id": -16, "username": "jessicaloftus6", "date_of_visit": " February 2020", "rating": "5", "title": "Valentine's dinner ", "comment": "We had a 5 course tasting menu with champagne for £79 pp. Every bite of food was delicious, the service was impeccable, and the ambiance was chic yet warm. ", "date_of_review": "15 February 2020"}
{"review_id": 16, "restaurant_id": -16, "username": "Jonathan S", "date_of_visit": " February 2020", "rating": "5", "title": "A FANTASTIC EXPERIENCE.", "comment": "I arrived just after it opened at 6pm. I sat at the bar and had five double Jamesons and a 200ml bottle of Coca-Cola on the side. The Jamesons was one of the cheapest whiskies on offer. They have a wide range of all drinks at a very wide range of prices. I then headed for the restaurant where I had a four course meal starting with a little savoury ball which was delicious. I then had a starter of a chicken wing as recommended by my waitress. It was good but it didn't look like a chicken wing. I then had a lamb dish which was on two plates with a side of potatoes which I enjoyed. I then had a meringue dish with raspberry sorbet and frozen custard. Very interesting. I finished off with the cheeseboard. Quite interesting. I then had two Americano coffees. The entire bill including the drinks was £144. This restaurant is well worth checking out in my opinion and I do hope to return in the summer when I can enjoy the views over East London.", "date_of_review": "26 February 2020"}
{"review_id": 17, "restaurant_id": -16, "username": "Trevor G", "date_of_visit": " February 2020", "rating": "4", "title": "Nearly perfect", "comment": "Totally surprised by the set weekend lunch, which at £35 is an insane bargain. Agonising over which starter to order, the friendly young waiter explained that we get them all! Only mains and pud need ordering. This results in a table full of food, and you'll need to be hungry. The exquisite little choux bun stuffed with light parfait won't fill you, but the salt cod croquettes and roasted Jerusalem artichokes will. Everything was delish, and as the poverty priced Viognier (£36) was delighting, we were on a rush of adoration. Sadly, whilst he loved his wild garlic porridge (as did I), my belly pork was way too chewy. They way the knife seemed to make little impact was not a good sign, and though it had suitably crispy skin, the rest was nowhere near as melting as it should have been. Puds were decent, though not overly memorable. Service was just great, from young staff who were without exception enthusiastic about the venture, and keep to help. Decor is modern, sleek and subdued, and on this Saturday lunchtime, pretty empty. Stratford doesn't really deserve this. Overall, we loved it and will definitely be back. So close to 5 stars.", "date_of_review": "25 February 2020"}
{"review_id": 18, "restaurant_id": -16, "username": "Aileen M", "date_of_visit": " March 2020", "rating": "5", "title": "Early Saturday evening dinner", "comment": "We visited Allegra with friends on Saturday evening. The staff in the bar area and at our table were extremely polite, knowledgeable about everything on both the cocktail menu and the dinner menu, and friendly. The cocktails were delicious and the food was amazing. Service was perfect. I would thoroughly recommend Allegra and just hope that it will be able to survive in Stratford as they are definitely high-end London prices on the menu. ", "date_of_review": "9 March 2020"}
{"review_id": 19, "restaurant_id": -16, "username": "Globaladventure", "date_of_visit": " August 2020", "rating": "5", "title": "Delicious food in a stylish oasis", "comment": "Perched above the retail bedlam of Westfield, Allegra is a stylish oasis of calm, coupled with friendly, unintrusive service and delicious food. We spent a wonderful afternoon on the terrace, enjoying inventive cocktails, a light and tasty brunch and the interesting wine list. The Team really made us feel welcomed and relaxed, to ensure we had a wonderful time catching up with friends who we had not seen for ages, due to lockdown. It’s great to have a quality restaurant in East London and if you fancy a break from retail therapy, it’s the perfect place to escape to.", "date_of_review": "1 August 2020"}
{"review_id": 20, "restaurant_id": -16, "username": "vonschmidt72", "date_of_visit": " August 2020", "rating": "5", "title": "Allegra...a post COVID treat ", "comment": "Tonight I visited Allegra for the first time for a combined Birthday celebration for my daughters and wife, as their birthdays were during lockdown. What a treat! Food and service were excellent. They have done their best to adjust to the COVID situation and still maintained a friendly and personal atmosphere. I can highly recommend the food, in particular the lamb. Thank you to our waitress.", "date_of_review": "1 August 2020"}
{"review_id": 21, "restaurant_id": -16, "username": "flavourvenuesearch", "date_of_visit": " January 2020", "rating": "5", "title": "Allegra - An absolute joy", "comment": "Good old January eh? An icy chill in the air, plus bloated post-Christmas waistlines and credit card statements. The free venue finding team at Flavour Venue Search needed a little cheering up at this challenging time, so a visit to Allegra restaurant and bar generated all the happiness we’d hoped for. Perched on the 7th floor of The Stratford, the newly built uber-cool hotel in, you guessed it – Stratford, Allegra’s stunning food, service and ambiance blew away all our January blues. Allegra was brought to life by impressive ingredients. Patrick Powell, former head chef at Chiltern Firehouse and his team produce culinary works of art in the kitchen. The dining room was designed by Space Copenhagen, the team behind four-time World’s best restaurant winner Noma. The result is truly delightful food, lovingly served in a space which marries modern Scandinavian style with tastefully understated luxury. The main dining room is furnished with rich wood and soft grey upholstery, with modern lighting warming the walls with a gentle glow. A smattering of metal and foliage completes this chic and comfortable space. There’s also an indoor semi-private space for 12, an outdoor dining terrace and access to a breath-taking rooftop space with stunning London views. The food at Allegra was truly exceptional. Their seasonal menu showcases classic European skill blended with modern techniques and invention. The house bread included the best sourdough we’ve ever tasted. Baked fresh twice daily and served with light salted butter and a tangy green sauce. We followed this with a delicious pre-starter of pistachio choux filled with a rich and creamy liver parfait, which was wonderful. Next, we tasted the crispy confit chicken wing accompanied by yummy parmesan dumplings, wild mushroom and sorrel. We thoroughly enjoyed the smoked eel pithivier. The cutest little pie with layers of smoke and creaminess, offset by a tangy chilli vinegar and a verdant thick sauce of parsley and garlic. Our dinner was made more joyous by the fantastic service we experienced. Our Sommelier was warm and demonstrated his expertise by picking out a tasty, low sulphite Lebanese red for our pleasure. Our waiter was approachable, charismatic and hilarious. The staff clearly enjoyed being part of something special. Speaking of special, our main courses were spectacular. The aged Gloucester old spot pork cut like butter and came with lovely barbecued carrots. The wild venison loin was among the best dishes we’ve ever tasted. Cooked to absolute perfection and complimented with roasted celeriac, pickled blackberries and trompettes. This already stellar dish was elevated to new heights by the braised shoulder cottage pie accompaniment, which may be the best thing we’ve ever tasted. The tart rhubarb and custard vacherin delivered a light sweetness to finish a magnificent meal. Allegra impressed us on every level. If we gave star-ratings, they’d get them all. We’ll certainly be recommending this wonderful establishment for private dining, corporate lunches, large group bookings and full venue hire events where quality is a must. If you’re planning a special event, we’ll tell you all about Allegra and the other excellent venues we can recommend. Contact Flavour Venue Search today.", "date_of_review": "3 February 2020"}
{"review_id": 22, "restaurant_id": -16, "username": "Jimmyboy1978", "date_of_visit": " November 2019", "rating": "5", "title": "Amazing lunch, perfect service and great venue!", "comment": "Stratford has found its new luxury dining experience! My colleagues and I had the most incredible lunch on Friday 15th November with amazing food, outstanding service and perfect cocktails. We were a group of 5 that become 14, and the waiters had no issue serving a much bigger table with everything delivered promptly and with perfection.  The starters were amazing, we pretty much had everything on the menu, and the main courses, both Lamb and Chicken were incredible. So much flavour and cooked to perfection.  Our Italian waiter was very friendly, super efficient and helpful when deciding what to have and all of his recommendations were great.  We were lucky to meet and spend time with the general manager of the restaurant and hotel, Joel and he was amazing. It was great to hear the story of the restaurant. And for a venue that has only been open a few months, it is already far beyond some well established restaurants ive been to.  I cant recommend this venue enough and will be back again soon for both business and pleasure.", "date_of_review": "18 November 2019"}
{"review_id": 23, "restaurant_id": -16, "username": "Bobbin99", "date_of_visit": " January 2020", "rating": "5", "title": "Delicious and innovative food but turn the music down please!", "comment": "The food here is absolutely delicious. Innovative and imaginative without being over fancy. The mushroom pain perdu was outstanding. Great waiting staff and nice decor. It's not particularly cheap - our dinner for two (3 courses, no wine/alcohol) was about £90 including service but well worth it for a treat. The only negative was the ridiculous loud elevator music. It was playing as we came up in the lift and unfortunately still playing in the restaurant. Turn it down and choose some better music!", "date_of_review": "25 January 2020"}
{"review_id": 24, "restaurant_id": -16, "username": "R7706GWpaulw", "date_of_visit": " January 2020", "rating": "4", "title": "Amazing food .. But slowish service.", "comment": "We really enjoyed our evening meal at Allegra with friends. The food was really inventive and extremely tasty with some amazing flavours. My personal highlights included the Pistachio choux, liver parfait, preserved kumquat and the Cornish brill poached in seaweed butter, lemon, charred winter leaves .. The dessert of Treacle cake, cranberry, caramelised pastry ice cream was a slight disappointment.  My reason for not leaving a 5 star review was the slow service. Our table was booked for 8.45pm but we were not seated until 9.25pm and then we had a rather long wait until our orders were taken.  Looking forward to visiting the restaurant in the summer and trying out the beautiful terrace.", "date_of_review": "26 January 2020"}
{"review_id": 25, "restaurant_id": -16, "username": "A3824DCmarkl", "date_of_visit": " January 2020", "rating": "5", "title": "Secret sublime spot", "comment": "We went for lunch at £39pp and it was outstanding. Service was absolutely impeccable but not obtrusive, the food was superb and imaginative. The starters were sublime and there were plenty of them, mains were beautifully cooked and the dessert (particularly the rhubarb and custard) was out of this world. There really is nothing to fault with the food and it’s up there with some of the very best meals I’ve eaten.  Absolutely worth the quick trip from kings cross (5 mins on the fast train). Will certainly be back for the full evening menu soon. ", "date_of_review": "13 January 2020"}
{"review_id": 26, "restaurant_id": -16, "username": "JMPowell7", "date_of_visit": " January 2020", "rating": "5", "title": "Marvellous", "comment": "Went for lunch. Simply excellent. Food, service, surroundings all top notch. Can't wait to go again.", "date_of_review": "11 January 2020"}
{"review_id": 27, "restaurant_id": -16, "username": "Zephyr101", "date_of_visit": " January 2020", "rating": "1", "title": "Poor food poor service", "comment": "We took friends to this restaurant expecting something special. The decor and design of the restaurant was very good however the evening was ruined by the quality of food. The mains took one hour to come to the table during which time no one came to check on us. When the food arrived it was average. If you are paying £300+ for a meal for four you expect the food to be excellent. The restaurant is out of its depth and we would not recommend eating there.", "date_of_review": "27 January 2020"}
{"review_id": 28, "restaurant_id": -16, "username": "MichaelynCoxon", "date_of_visit": " December 2019", "rating": "5", "title": "Perfect date night dining", "comment": "Beautiful restaurant with attentive and charming staff. We picked with restaurant for our anniversary as a treat and it did not disappoint. We had wonderfully crafted cocktails at the bar before being shown to our corner table. The wine list was superbe and the wine waiter was helpful and knowledgable. The food was delicious and a real treat for the eyes and palate. The staff were without fault and answered any query we had with friendly enthusiasm. Unlike similar venues you didn’t feel out of place or an inconvenience for snobby staff. The only criticism I would have is for such a lovely restaurant you would expect a smart casual dress code out of respect. I was surprised to see a man in flip flops and shorts, and a woman in ripped to shreds jeans and ugg boots! It did bring down the specialness of the whole atmosphere.", "date_of_review": "22 December 2019"}
{"review_id": 29, "restaurant_id": -16, "username": "Perichardson", "date_of_visit": " January 2020", "rating": "2", "title": "Very underwhelming , very disappointing!", "comment": "A party of 10 of us went to the restaurant last Saturday. We generally visit restaurants as a group every couple of months. We had heard great things about this restaurant but frankly is was so disappointing. Let's give the positives first: Excellent location, fantastic ambience, very attentive staff, comprehensive wine list, notable and interesting cheese board. Negatives: So many choices (starters, mains and then desserts) were off the menu, not a great start! Starters were ok. 2 of our party chose the Cod for a main meal, unfortunately both were cold and sent back. 2 of us shared the rib eye and 2 shared the duck, both were underwhelming and so were the desserts apart from the cheese. The manager was very apologetic and knocked 15% of the bill but even with this, it still came to £210 per couple, we did have a lot of wine! It was so disappointing and the restaurant needs to up its game.  ,", "date_of_review": "28 January 2020"}
{"review_id": 30, "restaurant_id": -16, "username": "Silvano S", "date_of_visit": " February 2020", "rating": "5", "title": "Exquisite cuisine at reasonable prices", "comment": "At Allegra you can not only enjoy refined dishes and exquisite wines but you get a broader experience with stunning views on the Olympic Park, attentive and very kind staff, soothing atmosphere. The food presented is the expression of passion for fresh ingredients, delicious combinations of flavours wrapped up with a touch of artistry. It’s highly recommended the formula of a tasting menu accompanied a spectacular wine flight.", "date_of_review": "1 February 2020"}
{"review_id": 31, "restaurant_id": -16, "username": "SharonH43", "date_of_visit": " November 2019", "rating": "4", "title": "Fab venue, excellent staff, great food", "comment": "Beautiful restaurant on the 7th floor of the equally fabulous Stratford Hotel. Staff knowledgeable, present without being intrusive and charming. Interesting menu, well presented food, a little fine tuning with the taste would make the restaurant excellent.", "date_of_review": "12 November 2019"}
{"review_id": 32, "restaurant_id": -16, "username": "Meander09494252993", "date_of_visit": " September 2019", "rating": "5", "title": "Super Lunchtime Experience", "comment": "Early days for this beautiful establishment as the team seem to be still testing the menu and service. But what a good job they are doing. Even the initial nibbles and the bread were a very accomplished. You can even salt your own butter. Starters were delicious and main courses were perfect for a light lunch. The mackerel in particular was as well done as I have seen anywhere. The Achill Island oyster instantly transport your taste buds to the Wild West coast of Ireland. We had several desserts - these were lovely - beautiful, light and tasty. Most importantly, the service and friendliness of the staff were exceptional. For those arriving by car, like ourselves, the car park next door was very convenient. All in all a really good experience.", "date_of_review": "19 September 2019"}
{"review_id": 33, "restaurant_id": -16, "username": "DavidandStuart", "date_of_visit": " September 2019", "rating": "5", "title": "Outstanding", "comment": "We live locally to the Stratford Hotel and we've watched the building go up and now (finally) open. The brasserie downstairs is excellent - and very sensibly priced; Allegra is their high-end offering and it's excellent. A calm and stylish space and a fantastically well-executed menu. It's expensive - but the prices are justified by the quality of the cooking. One small criticism: the service was professional and attentive but our glasses were topped up rather too obviously to edge us towards a second bottle. Its always more impressive when a waiter makes a good wine last...", "date_of_review": "29 September 2019"}
{"review_id": 34, "restaurant_id": -16, "username": "Keith P", "date_of_visit": " September 2019", "rating": "4", "title": "Modern, Plush but a Still a Work-in-Progress", "comment": "Allegra is a smart, welcome addition to the East London restaurant scene. Our visit was 3-days after the official opening and on a Saturday \"date night\". Upon arrival we were greeted by an excellent front of house team and were personally taken up 8 floors (in the lift) to our table situated in a long, comfortable room that encompasses the entire perimeter of the building. Dressed in muted tones all the decor is fresh and inviting. Service was excellent with lots of young, willing and eager staff and a learned sommelier who was keen to show-off the short, interesting wine selection and his well-stocked wine-room. There were a few blips along the way, most notably an error with the initial drinks order but the main issue we had was the main course. We ordered the \"sharing\" whole-roast-chicken and the perfectly cooked bird was brought to our table on a wooden board atop an array of pine branches - all very snazzy. The bird was then taken back into the kitchen for further preparation.  Salivating at the thought of such a sumptuous, plump bird being carved and laid-out on giant plates we were therefore very disappointed when it returned in its final form. Two small, over prepared slithers of breast meat and a dollop of mushroom puree was a major let-down. Half way through the main course a further plate of four small chicken \"snacks\" were brought out - what happened to the rest of the bird? Perhaps I'm a philistine and not aware of the intricate. skilled and detailed work that goes into reducing a succulent, plump chicken into what looks (and tastes) like over-salted turkey roll. For me (and my wife) it was a major anti-climax. Everything else was fine. Good wine, attentive service, nice cheeses and truly excellent Old-Fashioneds. We will go back but we won't have the chicken.", "date_of_review": "1 October 2019"}
{"review_id": 35, "restaurant_id": -16, "username": "MercedesBlanco8", "date_of_visit": " October 2019", "rating": "5", "title": "A new Gem in London", "comment": "What an amazing experience we had! Knowledgeable bar staff with fantastic cocktails (try the Up-Beet for something different and incredibly tasty). Top notch service and the food oh wow! Our favourites - pistachio choux (I would eat loads of them) the Crap tart was incredible tasty and the textures were exquisite. And the honey cake was elevated by the sommelier’s recommendation of a glass of Greek Muscat. Restaurant is beautifully designed with a serene interior space that made the dinner even more special.  Service 10/10 Food 10/10 Drinks 10/10 We’ll be happy to go again!", "date_of_review": "6 October 2019"}
{"review_id": 36, "restaurant_id": -16, "username": "SouthtoEast", "date_of_visit": " September 2019", "rating": "4", "title": "Fabulous decor and roof garden", "comment": "Allegra benefits from a fabulous position in a new and innovative hotel in Stratford. The architecture of this hotel will be an iconic building for the future, close to all the amenities of the East Village which is the legacy of the 2012 Olympics. The interior design is by the same company who designed NOMA in Denmark; we are lucky enough to have been there and there are similarities but the Allegra; is slightly more sumptuous.  The style of cooking is European, small dishes, from the chef who made Chiltern Firehouse a success. Expensive but a joy to be there as the staff are charming and the atmosphere calm. The roof garden is beautiful and there is an area which in the summer will be wonderful but was quite empty on the evening we dined.  We went for all the starters on the menu, slightly mixed, some excellent some not quite sure. Bread is charged for but only three pounds. However one of my great bugbears is where in France does one ever pay for bread? The brasserie and bar on the ground floor of the hotel are also very nice but music far too loud and inappropriate for conversation and business get togethers. A lot of singing and just too loud. When asked to turn it down we were told this couldn't happen as it was pre-selected - really! This is really the first of what I am sure will now be a number of high end restaurants in this area as the East of London quite rightly becomes more and more popular.", "date_of_review": "6 October 2019"}
{"review_id": 37, "restaurant_id": -16, "username": "AnneRobe", "date_of_visit": " November 2019", "rating": "5", "title": "Delicious meal ", "comment": "I have never ever eaten such beautifully chosen and cooked plaice !!!! This was delicious and a thick Halibut style cut. Followed by Apple mille feille very nice. Lots of service and very good wines. Tasty bread to start. ", "date_of_review": "3 November 2019"}
{"review_id": 38, "restaurant_id": -16, "username": "dsc815", "date_of_visit": " October 2019", "rating": "5", "title": "Superb execution and presentation", "comment": "Allegra is in an attractive space in a new development in Stratford but what shines is the food and the creativity of Chef Powell. The smoked eel pithiver is an amazing instagram picture - with the beautiful green parsley garlic purée complementing the flaky pie with creamy smoked eel and potato confit inside, but it also had superb flavor, was freshly baked, and wasn’t too heavy.  I also enjoyed Scottish lobster with crown prince pumpkin - served as discs, broth, and purée, with the claw meat on top of shiitake mushrooms. Artful presentation and especially tasty! Service was attentive and friendly and a fairly broad selection of wines by the glass - including some more exotic choices such as an assyrtiko from Santorini. Highly recommended if you are not only looking for atmosphere and design but also superb food, it is well worth venturing out to.", "date_of_review": "25 October 2019"}
{"review_id": 39, "restaurant_id": -16, "username": "Douglas C", "date_of_visit": " October 2019", "rating": "5", "title": "Excellent lunch", "comment": "A pleasant surprise and what a great addition to this part of Stratford. Dining on the 7th floor with good views ,however bit to cool today to use what looks like a attractive garden terrace. Lunchtime menu was a bit of the limited side - mains - 2 cod dishes,1 chicken and 1 veggie dish ,no red meat ! What we had was first rate, on the small side but very tasty. Good recommendation for the wine and very good service . Gluten free no problem, lovely gf bread.", "date_of_review": "15 October 2019"}
{"review_id": 40, "restaurant_id": -16, "username": "Netballgoalshooter", "date_of_visit": " November 2019", "rating": "5", "title": "Excellent food and service", "comment": "I was a little apprehensive as I usually go for more informal dining - I shouldn't have wasted my time as this was simply not the case - thank goodness! Friendly, professional service - attentive but not uncomfortably. We were a party of four and chose different starters to share - faultless. Weirdly my son insisted we try the bread too - once you eat it, you'll see why. Beyond perfect sourdough and creamy, oh-so-salty butter and then another one (Irish soda?) that had a green sauce - tasted like a cut lawn on a summer's day. No idea what was in it but tasted fantastic. We all had mains of lamb which was again delicious. I don't usually have dessert when we are out as I often feel let down - not this evening! We ordered four different ones to share and they were sublime. The creamiest of ice creams - unique flavours - syrup pudding to die for, pastry, Apple combo that was truly the best I've eaten. Really blown away. We are hypercritical diners as we like to think we can cook to a good standard and couldn't fault the food or the service.  Our only negative thoughts with were the hyper-sensitive taps in the bathrooms - yup, that's our only negative!", "date_of_review": "3 November 2019"}
{"review_id": 41, "restaurant_id": -16, "username": "Jana S", "date_of_visit": " September 2019", "rating": "5", "title": "Quite simply outstanding", "comment": "One of the best meals I have had anywhere in London. Perfectly cooked & presented food with excellent wine pairing and matching service in a stunning restaurant. I can't wait to come back. Allegra team, thank you for this amazing evening.", "date_of_review": "12 September 2019"}
{"review_id": 42, "restaurant_id": -16, "username": "futtock21", "date_of_visit": " September 2019", "rating": "5", "title": "Haute Cuisine E20 stule", "comment": "This is billed as one of the most exciting openings of the year, as a destination fine dining restaurant on the seventh floor of a new hotel in the Manhattan Lofts district whose kitchen is headed up by none other than Patrick Proctor, the former head-chef of Chiltern Firehouse. But fear not the destination in question is not downtown New York but the Stratford hotel adjacent to Stratford International station. By enlarge my lunch here lived up to the hype. Not sure about the view of Westfield Shopping Centre or other skyscrapers still under construction but the interior all light Danish furniture and furnishings with an outdoor terrace was comforting enough. The lunch menu is short. No more than half a dozen starters that rather morph into even fewer mains. Bread served in two varieties one brown the other sourdough with salted butter and a minty sauce made for a quite superb start. Service was attentive too with my water carafe being replaced as soon as it had been almost completely drained. A glass of white Zinfandel was refreshing. My starter and main were similar in that they both featured fish as their central ingredient and a spoon sufficed to consume the yellow sauce each cane in. For my starter a dish containing cubes of trout pieces of potato and herbs had poured over it from a jug what was described as a chowder but which was more of a consommé. An egg yolk neatly dissolved into the mixture. My main of cod again cut into small pieces came with coco beans in a stew. Both were two of the most accomplished dishes I have had anywhere this year. A dessert of figs on an ice cream beneath a granita was a cool finish. No complaints about the espresso either.", "date_of_review": "18 September 2019"}
