{"review_id": 1, "restaurant_id": -11, "username": "readingLondon", "date_of_visit": " August 2020", "rating": "5", "title": "Brilliant wedding reception", "comment": "Our son and his bride had their wedding reception there ,literally the day the covid restrictions were lifted.So everything was last minute with constant changes. We were on the roof terrace, all safely socially distanced in the open air yet covered by a very large type of parasol.It was ideal. There is an open fire so you can stay warm without noisy or obtrusive heaters.  The food was great and the service outstanding. The roof terrace is totally private from the rest of the pub and is ideal for wedding receptions, work parties , or just a private party.I n the covid era with all its guidelines, a safe yet surprisingly cosy ambience. All this with the most positive and helpful landlord you could hope for , and it didnt break the bank either.", "date_of_review": "17 August 2020"}
{"review_id": 2, "restaurant_id": -11, "username": "Christanm", "date_of_visit": " January 2020", "rating": "2", "title": "Good food, Awful staff", "comment": "Booked the day before to go for a Sunday roast as they are rated as one of the best. Location and interior all lovely.  The roast was great, really well cooked and portion size was great. I would recommend the beef if it’s on.  The biggest issue we had was the staff, they were just rude. Seemed like we were a inconvenience to be there. The bar staff were the worst, it really felt as though we were not worthy of there time.  Such a shame and will never return. ", "date_of_review": "27 February 2020"}
{"review_id": 3, "restaurant_id": -11, "username": "louismR4532GB", "date_of_visit": " August 2020", "rating": "5", "title": "Rooftop Lunch", "comment": "We managed to book lunch on the rooftop terrace and were amazed by the views, which were heightened by the sun coming out. For starters we shared the padron peppers, buratta, house focaccia and the quail scotch egg which were all delicious. The only criticism is that the peppers were extremely spicy. For drinks we had the rose which was surprisingly cheap and lovely. For mains we both had the shellfish pasta with brown crab butter which we agreed was one of the best dishes we had ever tasted, simply sublime. A wonderful lunch in a mesmerising location, we will definitely be back.", "date_of_review": "9 August 2020"}
{"review_id": 4, "restaurant_id": -11, "username": "Steviefull", "date_of_visit": " January 2020", "rating": "4", "title": "A busy saturday evening", "comment": "We popped in here for 'refreshments' before a Jack The Ripper tour and it was absolutely packed and clearly a place to start a saturday night. We got a couple of cocktails and eventually a table was free, the place was buzzing with conversation and people enjoying themselves. At around £10 for a cocktail it wasn't cheap, but then again it is London. We didn't have a chance to check out the roof terrace as again it was really busy. A fine night out in an old school pub.", "date_of_review": "14 March 2020"}
{"review_id": 5, "restaurant_id": -11, "username": "Hold1971AHeart", "date_of_visit": " February 2020", "rating": "5", "title": "Amazing venue.", "comment": "Had a drink in the pub first, a meal in the restaurant and had a look at the roof terrace. All fantastic. Will definitely be returning.", "date_of_review": "26 February 2020"}
{"review_id": 6, "restaurant_id": -11, "username": "18SCOTTS2020", "date_of_visit": " December 2019", "rating": "5", "title": "Excellent Sunday Lunch", "comment": "Went for Sunday lunch a few weeks ago, probably one of the best we’ve had, really nice atmosphere, excellent overall! ", "date_of_review": "2 March 2020"}
{"review_id": 7, "restaurant_id": -11, "username": "Soos52", "date_of_visit": " February 2020", "rating": "3", "title": "Just ok with staff who looked bored", "comment": "Went on a cold February afternoon to warm up before we went out for the evening. Yes it served drinks but the staff just seemed lack lustre. A bit of a smile or personal engagement would have made all the difference. We were unlucky as it was already cold and there was a beer delivery and we had to endure the main doors being open for nearly half an hour. Understand the reason and we were at the far side but it made me even colder. Would go back but hope for a warmer reception next time. We don't come to London much and a few words of greeting make all the difference. Its always been more than about the drink!", "date_of_review": "5 February 2020"}
{"review_id": 8, "restaurant_id": -11, "username": "344blankas", "date_of_visit": " August 2020", "rating": "4", "title": "Sunday roast on their lovely rooftop", "comment": "The rooftop of The Culpeper is a popular Sunday lunch spot and for a reason. The views are great and the atmosphere cosy and fun. The Sunday roast is sumptuous and a lots of beer and cocktail options are available to accompany your meal. The Eton mess is a good British quintessentiality to close the lunch. The staff is really friendly and make sure that your meal out actually feels like a meal in your own home.", "date_of_review": "24 August 2020"}
{"review_id": 9, "restaurant_id": -11, "username": "mrsg2017", "date_of_visit": " February 2020", "rating": "4", "title": "Large group.", "comment": "Had brunch here with a large group of friends. Service was very good and the food was of a good standard apart from the sausages on the breakfast's x 3 which had not been thoroughly cooked and we're still pink inside.", "date_of_review": "4 February 2020"}
{"review_id": 10, "restaurant_id": -11, "username": "fcarroll", "date_of_visit": " October 2019", "rating": "5", "title": "Amazing meal", "comment": "The best meal and service we have had while visiting London.The meal was delicious and we would definitely go again on our next visit.Superb.", "date_of_review": "9 October 2019"}
{"review_id": 11, "restaurant_id": -11, "username": "David E", "date_of_visit": " September 2020", "rating": "5", "title": "Fantastic food, friendly staff, great service", "comment": "We ate here last Friday evening (11 September). It was quite busy, although all tables were socially distanced and we felt very safe here. Good choice of dishes and the food was exceptional. Service was brilliant and sure it would have been with a smile, if it weren't for the face coverings being worn by all the staff. After our wonderful meal in the first floor restaurant we were found a table in the bar for a drink. whilst it was busy, social distancing and safety was clearly paramount with potential customers being politely turned away at the door when all the tables were occupied. All in all, an excellent night out and would definitely recommend.", "date_of_review": "18 September 2020"}
{"review_id": 12, "restaurant_id": -11, "username": "Tsten", "date_of_visit": " September 2019", "rating": "5", "title": "Unexpected", "comment": "Excellent food, great restaurant, excellent staff and in a great spot. Wasnt expecting the food to be so delicious and prices are reasonable too. Will definitely go back. The bar can get a little busy but a perfect spot to eat so close to Spitalfield", "date_of_review": "4 November 2019"}
{"review_id": 13, "restaurant_id": -11, "username": "lauriannee", "date_of_visit": " August 2020", "rating": "5", "title": "Absolutely delicious!", "comment": "Friendly greeting from entrance and pleasant service. They source their ingredients locally, their meat in particular. I had the bavette which was pink and tender. This gem is absolutely worth a visit!", "date_of_review": "30 August 2020"}
{"review_id": 14, "restaurant_id": -11, "username": "M7368SUlees", "date_of_visit": " November 2019", "rating": "4", "title": "Late Drinks", "comment": "Good service over late night drinks after dining.  Service was good and the presentation good. Ordered some nibbles to go with drinks and again nothing was too much trouble - A great find.", "date_of_review": "7 November 2019"}
{"review_id": 15, "restaurant_id": -11, "username": "C3966OOjohnt", "date_of_visit": " November 2019", "rating": "5", "title": "Good gastro pub", "comment": "We had a lunchtime meal here and it was amazing, window seat with a view of the world going by, good draught beer to start, friendly professional staff, superb sour dough bread served with anchovy butter. We both had the signature dish, Bavette steak just perfect with a good red wine. Desert was a wonderful apple and blueberry crumble. The atmosphere was quite and relaxed, while of an evening it’s a very lively dining experience.", "date_of_review": "28 November 2019"}
{"review_id": 16, "restaurant_id": -11, "username": "Blondey87", "date_of_visit": " January 2020", "rating": "2", "title": "Rude and uninspiring ", "comment": "Booked a table for Sunday lunch very easily on their website based on good online recommendations. However, bar staff seemed most put out to actually serve a few pints and they were not welcoming to a friend who turned up a little late. Food was average, nowhere near the best I’ve had and the drinks were incredibly overpriced even for London. Will not be returning. ", "date_of_review": "5 January 2020"}
{"review_id": 17, "restaurant_id": -11, "username": "Jackie J", "date_of_visit": " December 2019", "rating": "5", "title": "Great food, atmosphere and team", "comment": "Had our works dinner for 30. Great atmosphere and the food and staff were brilliant. Really friendly place, with Christmas dinner served on platters for everyone to serve, worked really well. Next time, a return to the rooftop.", "date_of_review": "14 December 2019"}
{"review_id": 18, "restaurant_id": -11, "username": "John W", "date_of_visit": " December 2019", "rating": "4", "title": "Well worth a visit", "comment": "Met friends for lunch in midweek. Quite busy, good sign. Not a huge selection of beers, but some unusual ones, including a very decent \"Mad Goose\". Menu in downstairs eating area not very extensive, but \"Pie of the Day\" (lamb, mushroom and carrot) with hispi cabbage was very good, and a selection of starters went down well, with some splendid chips to boot. Popular with large(ish) groups in the upstairs restaurant, which has a larger selection on its menu, and seemingly it has a pleasant roof garden area also. Service was very good and efficient. Would happily return if in the area.", "date_of_review": "5 December 2019"}
{"review_id": 19, "restaurant_id": -11, "username": "BeverleyG1978", "date_of_visit": " November 2019", "rating": "3", "title": "Bar staff were lovely- but", "comment": "Bar staff were lovely- but ruined by the clientele- rude and obnoxious customers. Rudely knocked out of the way, drink spilt over me and just no consideration for others around them.", "date_of_review": "22 November 2019"}
{"review_id": 20, "restaurant_id": -11, "username": "katecon18", "date_of_visit": " August 2019", "rating": "5", "title": "A seven hour lunch....", "comment": "I went to Culpeper thinking it’s going to be just another average Sunday lunch but I was really really pleasantly surprised... I had the bavette steak roast...it was really really fantastic. Bavette can be badly cooked but this was excellent. Gravy good and a decent amount of veggies and Yorkshire pudding. We all had desert. The chocolate moose was great. I had the pannacotta which was good tasting but was not a pannacotta. Too soft and no form.  Will go again though. Great food.", "date_of_review": "6 August 2019"}
{"review_id": 21, "restaurant_id": -11, "username": "LuxurySeekerNorwich", "date_of_visit": " August 2019", "rating": "1", "title": "Only one very bland red wine??", "comment": "They do suggest it’s a Malbec substitute, a Shiraz substitute, a cab sab substitute etc. Truth is it’s a lifeless cheap merlot that I can’t imagine anyone would like? We’ve been using this pub on and off for a few years and due to lack of wine have now spent the last 30 mins on a sat night exploring nearby pubs just to avoid the ‘no nice red wine Fri night scenario’. Such a shame. There’s supermarkets nearby with heaps of £5 bottles they could charge £9 a glass for? A pub that’s lost its heart and doesn’t care", "date_of_review": "17 August 2019"}
{"review_id": 22, "restaurant_id": -11, "username": "Spurstraveller", "date_of_visit": " August 2019", "rating": "5", "title": "No complaints at all", "comment": "How interesting to read the wide range of reviews for this place. From our experience of eating in the restaurant, not the pub area, my wife and I can only say how delightful we found the whole experience. From a small but varied menu, my wife had lamb and I had a bavette steak; both were cooked to perfection. We shared a cheese board for dessert and that was also very good. The staff were lovely and went out of their way to make us feel welcome. They were happy to vary the accompaniments for the meats to suit our tastes and gave us a taste of a couple of wines before we made our final choice. We were not rushed at all and were able to take our time in a very relaxed atmosphere.  For London, it is reasonably priced. We would definitely go again.", "date_of_review": "18 August 2019"}
{"review_id": 23, "restaurant_id": -11, "username": "Mona J", "date_of_visit": " February 2019", "rating": "4", "title": "Creative pub-food!", "comment": "Dropped into this pub after a show, and had really nice food. Very different from what I would consider pub-food, and that is perfect for us. Some was a bit too odd, but still - would come back again if I was in London.", "date_of_review": "20 August 2019"}
{"review_id": 24, "restaurant_id": -11, "username": "Indrajit A", "date_of_visit": " September 2019", "rating": "4", "title": "Trendy pub food - not particularly cheap", "comment": "I happened to be in London last week and Culpeper came up as highly recommended. The reviews looked decent so I gave it a try. I dropped in for lunch and found the selection of dishes downstairs in the pub quite extensive although all were quite heavy. In the end I went for the fish & chips - a traditional choice for a visitor to the UK I guess. What I got was not particularly large in terms of portions but the fish (haddock) was beautifully flaky and could not have been fresher. The batter was not at all greasy. The chips were just right but the peas were perhaps the most pleasant surprise although I thought the portion of peas was a bit stingy. As a starter I had the black pudding bites, which I thought were disappointing. The choice of drinks seemed limited too.", "date_of_review": "13 September 2019"}
{"review_id": 25, "restaurant_id": -11, "username": "Stenvoid", "date_of_visit": " September 2019", "rating": "5", "title": "Consistently fantastic", "comment": "I love this restaurant - a limited but wonderful menu (too much choice would confuse here and make you feel you were missing out on many delicious options), great decor, location and service. I had goats' cheese filo pastries with fig, a main of fish with incredible curried mussels and the chocolate mousse with mint meringue and olive oil was divine. Never fails to impress clients when I take them here. Highly recommended.", "date_of_review": "20 September 2019"}
{"review_id": 26, "restaurant_id": -11, "username": "islandgryl", "date_of_visit": " September 2019", "rating": "5", "title": "Raining 😢", "comment": "No sitting on fabulous top deck as it was raining. Stopped for loo & G&T made with City of London Dry Gin. Girls next to me had a beetroot Bloody Mary which looked great. This is very iconic place close to Spitalfields Mall.", "date_of_review": "22 September 2019"}
{"review_id": 27, "restaurant_id": -11, "username": "JonnyP5", "date_of_visit": " August 2019", "rating": "1", "title": "Lunch for 6... the good, the bad, the ugly...", "comment": "Was treated to a business lunch at the above yesterday afternoon...  Great pub atmosphere on the ground floor and THE most helpful chap helped us get a booking upstairs in their restaurant after a mix up with names/booking...  Great food and helpful french waitress in the restaurant, but major attitude problem with the front of house girls in relation to having a drink on the balcony (2nd floor). Forced to book an area on our phones and then told we had to wait 5mins, 5 times with the ever helpful \"is that alright\" and the customary roll of the eyes... Nobody was up there on the balcony, they just couldnt be bothered to serve. Totally unhelpful, rude and plane lazy. Stay on the ground floor and bring a crash hat if you want to go upstairs", "date_of_review": "23 August 2019"}
{"review_id": 28, "restaurant_id": -11, "username": "h_varh2017", "date_of_visit": " September 2019", "rating": "5", "title": "Excellent food and atmosphere", "comment": "Had the croquettes and mackerel pate, especially the last one was very tasty. Excellent service, music and atmosphere as well. ", "date_of_review": "29 September 2019"}
{"review_id": 29, "restaurant_id": -11, "username": "markd970", "date_of_visit": " September 2019", "rating": "2", "title": "Bar qqqqqqqs", "comment": "Trying to get a drink between 17-19pm on a tues took 15mins every time. The reason, only 2 bar staff and one of them didn’t have a clue. For example, one of the beer pumps ran out, he waited 5 minutes for it to work again before he served anyone else. People just walked out.  Great pub but could be so much better and make more money. If you own this place employ more and better bar staff.", "date_of_review": "18 September 2019"}
{"review_id": 30, "restaurant_id": -11, "username": "Sofya D", "date_of_visit": " January 2020", "rating": "5", "title": "Positively surprised!", "comment": "I Don’t usually go to gastropubs but this one was recommended to me by a colleague. The place has a nice atmosphere and the food was delicious! We had a fish dinner consisting of fish pate, fish croquets and fish chips for the main! I couldn’t fault any of the dishes, the fact that the menu was small really helped as I get lost in massive menus.", "date_of_review": "7 January 2020"}
{"review_id": 31, "restaurant_id": -11, "username": "HellTyrell", "date_of_visit": " June 2019", "rating": "1", "title": "Oh dear.....the service :'(", "comment": "We've wanted to go too this pub for a very long time now as supposedly one of the best and it's been recommended to me so many times. I'm a keen follower of their social and really love everything they do from the rooftop to the plants, the food to the interior. Very sad to have to speak to such a snotty and to be honest, downright rude manager over the phone. I appreciate you may be a busy and popular pub but to be so standoffish on a first encounter whilst trying to book a table is crazy! Pretty bad customer service and I don't reckon I'd visit after that experience!!!", "date_of_review": "20 June 2019"}
{"review_id": 32, "restaurant_id": -11, "username": "BajanLadyM", "date_of_visit": " August 2019", "rating": "1", "title": "NO FOOD???", "comment": "Tried to obtain something to eat - was told we just opened!! Notice there was a certain type of cliental eating and drinking but we were told there's no food!!!", "date_of_review": "4 August 2019"}
{"review_id": 33, "restaurant_id": -11, "username": "jonathanw86", "date_of_visit": " June 2019", "rating": "2", "title": "Dog hair infused gin!", "comment": "Dogs are welcome here, also welcome in your drink apparently. Staff are sharp and surprisingly unhelpful. One positive is the money I saved on tips, since clearly none of them wanted tips. Roof top garden is lovely but closes between 4-5. Tables don’t seem to be cleaned, sprinkled with salt and left over food. Wouldn’t be in a hurry back.", "date_of_review": "15 June 2019"}
{"review_id": 34, "restaurant_id": -11, "username": "ian1232015", "date_of_visit": " June 2019", "rating": "4", "title": "Lively pub buzzing on a Saturday afternoon", "comment": "Number three on a Saturday afternoon pub crawl; big friendly pub full of people enjoying a beer and a chat. ", "date_of_review": "3 July 2019"}
{"review_id": 35, "restaurant_id": -11, "username": "Madalina Q", "date_of_visit": " July 2019", "rating": "1", "title": "Staff do not do their jobs properly !!", "comment": "I called them in the afternoon asking for a rooftop table for 2 people. The girl at the reception told me that there is no booking needed and I should just go there and there might be a waiting list where we need to wait a bit and then we can go in. When we got there, the girl said that unfortunately there is no table available for tonight as there are too many people outside. Why would she not tell me that on the phone so I won't need to travel all the way to this place??? Clearly she doesn't do her job properly, I am very dissapointed with this restaurant. I will never go back there again.", "date_of_review": "15 July 2019"}
{"review_id": 36, "restaurant_id": -11, "username": "Adrian L", "date_of_visit": " July 2019", "rating": "1", "title": "Don't waste your money eating here !", "comment": "My wife and I come to London 2-3 times a year and always stay in the Spitalfields area because it's always bustling and we are near the Spitalfieklds market with loads of great bars and restaurants on tap .   We have eaten here quite a few times, and when we knew we were coming to London again a few weeks ago we booked for Sunday 14th of July. We booked for Sunday lunch with a time of 5.30. We arrived at 5.00 and had a couple of drinks downstairs, then went up to the restaurant area at 5.30 to eat. We shared a white bait which was ok, but nowt special. We had then ordered the Sunday roasts, my wife the chicken, and me the beef.   It arrived and again was nowt special, but to my dismay was stone cold. The waiter asked how was our food, I told him it was stone cold, and he said he'd get another, but it would take 15 mins as they make it all fresh. So my wife was eating here with me sat there waiting for the chefs to make my fresh hot dinner. After a few minutes my wife also complained that gets wasn't hit either, so we asked tgecwaiter if it could be heated up a bit in the microwave, he said they couldn't do that as they don't have a microwave (I find that hard to believe )  After 20 minutes he brought our fresh meals again, and again mine was stone cold, the Yorkshire pud looked like it has been made hours before, and was rock hard, and just disintegrated when I tried to cut it as it was so dried out. My beef wasn't rare, it was actually raw flesh ! The veg was cold and over cooked, it was total garbage, and not fit to feed a dog.   I took the plate back to the chefs and told them in no uncertain terms that this was total garbage, the manager said there was nothing wrong with it, so I asked her to taste it which she refused. We paid for the over priced drinks and average white bait and left. Do not waste your money eating here, there are plenty of other places far better near by. 20 out of 100 food, 10 out of 100 attitude.", "date_of_review": "15 July 2019"}
{"review_id": 37, "restaurant_id": -11, "username": "eaja-on-tour", "date_of_visit": " July 2019", "rating": "1", "title": "How to get it SO wrong ", "comment": "It was all set up for a beautiful summer evening on the terrace. England had even won at cricket. Then we were offered just two brands of beer ...both of which were warm. However, that was nothing compared to the rose wine which was actually hot! Food was diabolical... trying way too hard with dishes like kimchi and baba ganoush which were so far off the mark that they couldn’t even claim to be abstract interpretations. Really need to get back to a few basics they can actually cook. Service ... one helpful server, one who was so surly I can only assume she was a Kiwi cricket fan or had been forced to try the hard potatoes we’d been served. We left after a couple of rounds... never to return.", "date_of_review": "4 July 2019"}
{"review_id": 38, "restaurant_id": -11, "username": "ole12", "date_of_visit": " July 2019", "rating": "4", "title": "Great, friendly atmosphere", "comment": "This is a good place to relax after visiting Spitalfield market. It’s a traditional pub with food and it’s dog friendly..a bowl of water was brought for our little dog as soon as we sat down! We would have liked to have sat on the roof garden but the weather was so good that it was full...possibly book in advance. There are two menus,a pricier one for the roof terrace and a different one for downstairs. The scrambled egg with smoked salmon on toast was delicious. Staff were friendly and although it was busy, they were happy to take photos of us. The downstairs seating is also dog friendly so if the weather is bad you can still go there with your pooch.", "date_of_review": "14 July 2019"}
{"review_id": 39, "restaurant_id": -11, "username": "jimbo_n1_2015", "date_of_visit": " August 2018", "rating": "5", "title": "Mums 50th Birthday", "comment": "We went for mums 50th birthday she had a blast we hired the rooftop what a great experience, food with the different wines was exceptional would love to go back staff was brilliant had our own barman to ", "date_of_review": "28 July 2019"}
{"review_id": 40, "restaurant_id": -11, "username": "LJB04", "date_of_visit": " April 2019", "rating": "2", "title": "Wayyy Overpriced Mediocre Food", "comment": "Pub trying to offer fine dining quality food. Nothing fit together on the plate and everything was tasteless. Undercooked. Under seasoned. Thankfully the bread was replenished !", "date_of_review": "6 April 2019"}
{"review_id": 41, "restaurant_id": -11, "username": "Manuel G", "date_of_visit": " January 2019", "rating": "4", "title": "Real pub", "comment": "Exactly what you can expect in a real, British pub. Number of drought beer included, and a fantastic fish and chips. They have much more than that, but even just for that, wellworthy a visit!", "date_of_review": "16 April 2019"}
{"review_id": 42, "restaurant_id": -11, "username": "SimonHedinburgh", "date_of_visit": " April 2019", "rating": "2", "title": "Got wrong most of what they could get wrong", "comment": "Left still hungry and disappointed. Went with hopes. A sad sequence of under-performances added to issues. Some recompense but not enough to encourage benefit of the doubt and a repeat visit. Now see similar comments on here. Scene 1 Arrival - Great a table available - its a gastro pub - I'll have a pint of bitter. 5 minutes later The bitter's run out. OK no problem now I've read the menu and the waiter tells me the bavett is a big dish. I'll have eel and Pinot Gris, Bavette with Nero d'Avalo and sparkling water. Scene 2 the £10 eel was 35mm x 20mm, teaspoon of rhubarb and teaspoon creme fraiche - OK I ordered as an experiment 'cos smoked eel isn't something I know. Portion size was a surprise at price but its E1. Now I know smoked eel is significantly similar to smoked mackerel and hey I'l just have a desert Scene 3 the bavette arrives. Another small portion. Yikes its tough to cut, tough to chew and stringy, not that tastie but the Bearnaise helps. C'est la vie. Try the pomme anna - nice and crisp, in places not 100% cooked through, try the baby gem - OH Yuck - Mustard dressing yuck yuck yuck how did I miss that? I didn't - its not on the menu despite being an allergen. Scene 4 Report back the bavette wasn't great, the mustard was horrid and unannounced... Scene 5 Waitress \"My college says you didn't like...\" \"No I say because.... \" There is something in her look I don't understand I pause \"You asked...its an allergen...its not listed...\" she replies \"I can't know everyone's tastes and its not my fault\" Oh i reply I thought... No I just came to apologies Oh OK thanks for the apology (why am I giving the thanks for whats progressively a declining experience and the attitude I could do without!?) then I go to finish the wine and luckily I spot the slagheap of sediment in the glass - emptied the very dregs of the bottle into the glass. There was an offer of a \"splash\" Really on top of all the above? It was removed from the final bill - good - but by then I've decided I won't chance a desert and I don't want to stay where I'm giving the thanks for a bad experience and the discussion and recognition still translates to we'll make our profit from you. IF they'd got it all correct I think it would have been good despite some reservations on portion size. IF they'd addressed the issues I could have said \"at least...\" and felt better about \"we all make mistakes...\" and I think the waiter was there even if the waitress clearly was not. As it is I'm disappointed, mildly hungry, Almost £50 poorer and pissed-off. None of which is individually too bad but all together is a 2 star. I hope for you none of these factors repeat but I see I'm not the first to note most of my points", "date_of_review": "2 April 2019"}
{"review_id": 43, "restaurant_id": -11, "username": "Jim S", "date_of_visit": " April 2019", "rating": "3", "title": "Loved the pub and the atmosphere but the food was poor", "comment": "We went for Sunday lunch and sat at a decent table on the ground floor. The beer was well kept and the service warm and friendly. However there is no hiding place and the food was poor, the only decent part was the deep fried nibbles we shared as a starter. The beef roast was just a cheap cut of steak, the fish pie was average with little in the way of chunks of fish. The Mille Feuille for dessert was dry and inedible. A real shame as it's a great London pub with a lovely buzzy busy atmosphere. Need to sort the kitchen out quickly.", "date_of_review": "17 April 2019"}
{"review_id": 44, "restaurant_id": -11, "username": "craghillh", "date_of_visit": " March 2019", "rating": "4", "title": "Great Sunday roasts", "comment": "Me and my partner went in March for a Sunday roast, and it was fab. Great food, lovely wine, nice atmosphere. Easy to travel too - would recommend booking a table.", "date_of_review": "22 April 2019"}
{"review_id": 45, "restaurant_id": -11, "username": "trythetajorpington", "date_of_visit": " May 2019", "rating": "1", "title": "Service was really terrible", "comment": "Food wasn't nice and service was bad rude staff dont even bother what customers needs are very sad to say will not come back again", "date_of_review": "19 May 2019"}
{"review_id": 46, "restaurant_id": -11, "username": "mephine", "date_of_visit": " April 2019", "rating": "5", "title": "Nice Pub!", "comment": "Nice People, Nice Beer and Cocktails. The Barkeeper mixes all what you want. It's also possible to taste the Beer before you buy it", "date_of_review": "18 April 2019"}
{"review_id": 47, "restaurant_id": -11, "username": "emmamoore85", "date_of_visit": " May 2019", "rating": "5", "title": "Epic! ", "comment": "The building is beautiful, the food is beautiful, the staff were beautiful! And that’s before you even see the view from the roof garden. Can’t recommend it enough, only hesitation in doing so is I selfishly don’t want it to be harder to get a table. ", "date_of_review": "22 May 2019"}
{"review_id": 48, "restaurant_id": -11, "username": "edelparam", "date_of_visit": " June 2019", "rating": "2", "title": "Disappointing", "comment": "Poor food, terrible service. Our waiter continually disappeared to find out what items on the menu actually were, and took forever to take our order. Food was poor and prices were over-inflated - I know it's in trendy Spitalfields but surely if you're prepared to spend the money it's reasonable to expect decent food in return! It's a really beautiful building and a lovely concept, but poor food and even poorer service is inexcusable. I gave 2 stars because the building is so beautiful...", "date_of_review": "9 June 2019"}
{"review_id": 49, "restaurant_id": -11, "username": "Simon L", "date_of_visit": " July 2019", "rating": "5", "title": "Table of 9 very happy people", "comment": "Service and cooking were top notch. Some people at the table only had a couple bites while others went for a full 3 course meal. Everything was perfectly seasoned and affordable. The anchovy butter with the bread was a stroke of genius. Will be back next time I’m in london", "date_of_review": "24 July 2019"}
{"review_id": 50, "restaurant_id": -11, "username": "davidcW7218LD", "date_of_visit": " May 2019", "rating": "5", "title": "Cocktails ", "comment": "Great bloody Mary’s , fantastic building in a great location friendly helpful staff , was gutted I missed out on the great Sunday lunch but hey there’s always next time ", "date_of_review": "27 May 2019"}
{"review_id": 51, "restaurant_id": -11, "username": "HollyGr", "date_of_visit": " March 2019", "rating": "2", "title": "The food on the rooftop is overpriced and not realy good", "comment": "I can not say something about the the pub food or the restaurant, we went to the rooftop for dinner. They have tapas style food from the grill there, we orderd the Rooftop Seafood Pot (1-2ppl £20). We where very disapointed a hand full of not very fresh mussels, about 5 very small pices of octopus and 2 red prawns, that tastet just awfull. Service was nice but that could not save our evening. The rest we had was ok, but very price for the smal portions. So nice for a beer, but do not eat on the rooftop bar.", "date_of_review": "1 April 2019"}
{"review_id": 52, "restaurant_id": -11, "username": "AndrewB556", "date_of_visit": " February 2019", "rating": "5", "title": "Just popped in", "comment": "Just popped in on the way to our hotel. We only planned on having a pint but ended up having a few plus some food.  The food was great!! Loads of flavour and the whole place was really delightful. 10/10", "date_of_review": "28 February 2019"}
{"review_id": 53, "restaurant_id": -11, "username": "Ny R", "date_of_visit": " March 2019", "rating": "3", "title": "It just felt a bit over designed", "comment": "Does everything it says on the can; however this 'lifestyle' template is becoming rather hackneyed. It's fine for a drink but just failed to inspire.", "date_of_review": "7 March 2019"}
{"review_id": 54, "restaurant_id": -11, "username": "RyanBlake83", "date_of_visit": " February 2019", "rating": "5", "title": "Great place!", "comment": "Great place with a nice atmosphere, nice selection of beers and the ambiance was fantastic. Definitely recommend visiting the rooftop bar!", "date_of_review": "28 February 2019"}
{"review_id": 55, "restaurant_id": -11, "username": "John S", "date_of_visit": " March 2019", "rating": "4", "title": "Excellent Gastro-pub", "comment": "In an unlikely location just behind Aldgate East Station is one of London's best gastro-pubs. Downstairs is a well-appointed bar attracting a young professional crowd. Upstairs is a very welcoming dining room, offering a small but very well-chosen menu of mainly modern variations on traditional British recipes. We took the duck and the bavette, both excellent, with very nicely prepared trimmings. A nice winelist, and friendly service combined to create an excellent and welcoming atmosphere. They didn't put a step wrong.", "date_of_review": "5 March 2019"}
{"review_id": 56, "restaurant_id": -11, "username": "cullen13", "date_of_visit": " February 2019", "rating": "1", "title": "Worst Roast in London", "comment": "Today I stopped in the Culpeper for a roast dinner. I decided to try the Pork Belly. The menu was very limited but i thought id give the Pork a go.  It was tasteless, fatty and you definitely needed good strong teeth to chew it. This was served with 3 roast potatoes, cabbage, a single carrot and a yorkshire pudding.  The staff asked how the meal was I was honest regarding the meat but this went in one ear and out the other so clearly they dont value customer feedback! Avoid the Pork Belly Roast at all costs overpriced and awful.", "date_of_review": "24 February 2019"}
{"review_id": 57, "restaurant_id": -11, "username": "mickeastlake", "date_of_visit": " March 2019", "rating": "4", "title": "Decent bar", "comment": "Popped into this bar to get out of the rain. Pretty decent bar, good range of beers and staff efficient. A good atmosphere and a pretty decent place to spend some time ", "date_of_review": "10 March 2019"}
{"review_id": 58, "restaurant_id": -11, "username": "Mike_Macrone", "date_of_visit": " March 2019", "rating": "4", "title": "Great Vibe!", "comment": "I started out on the first floor where the bar is and had a beer before having dinner. Great vibe in the bar area with everyone up and about. The bartenders were very helpful and nice to deal with. I then went up to the second floor for dinner and ultimately decided to go to the third floor (the rooftop) to eat. Please be aware that if you eat on the rooftop it is a very limited menu. If you want a larger menu then I suggest the second or first floor. The food was very tasty (however a little overpriced) and the staff were attentive. The decor of the entire place was very neat and each level had its own feel. Would definitely recommend this for at least a drink!", "date_of_review": "15 March 2019"}
{"review_id": 59, "restaurant_id": -11, "username": "sallystevensonss", "date_of_visit": " March 2019", "rating": "1", "title": "Sunday Lunch", "comment": "Four of us met here for Sunday lunch. The menu was very limited. One of our party chose Shoulder of Lamb - mostly fat and inedible, when spoke the waiter, he wasn’t interested that we hadn’t enjoyed our meal. We went elsewhere for dessert and coffee.", "date_of_review": "25 March 2019"}
{"review_id": 60, "restaurant_id": -11, "username": "StuartD825", "date_of_visit": " March 2019", "rating": "4", "title": "Decent Pub", "comment": "Busy on a Tuesday ... plenty of staff, quick service at the bar and not bad prices. good atmosphere and nice decor .. you could chose much worst !", "date_of_review": "28 March 2019"}
{"review_id": 61, "restaurant_id": -11, "username": "DNantoon", "date_of_visit": " February 2019", "rating": "2", "title": "Good /not good enough", "comment": "the culpeper is a cozy bar, which extends its style to the top. ground floor is a busy bar (evenings) where you have little trouble if you sleep on the 2nd floor. On the first floor we had breakfast in the morning what the breakfast was simple but very tasty and fresh! just do not expect when you ask for a scrambled egg with salmon that they effectively put raw salmon in little chunks over your eggs. this was not necessary for me and also not tasty in the morning! the dinner was very special and daring very tasty and very fresh, something I would dare to eat regularly. the first time I came into the rooms I was mostly faded damp spots and holes in the walls that I saw. This is apparently their style. it is something special but worth the effort! This also gave the necessary charm to the whole experience. Very nice that there is a Nespresso coffee machine in the room and delicious freshly made chocolate cookies that were replenished daily. THE HYGIENE was ultimately everything except from the bathroom was I really disillusioned mold in the shower edges the walls in the shower were really greasy never to clean off so there was really a layer of fat on all products that were already with the time walked through the toilet behind the toilet glasses but as the worst the toilet brush was literally still full of lumps of toilet paper is verry unfortunate because it costs not much to throw away and just put a new one! At one point I had the feeling that they only want money here in their whole concept from bar-restaurant to hotel and do not want any improvements for this. The experience was fun, instructive and at affordable price for London. Beqeause the hygiëne i give 2stars this is too important  Wegen they solute this i feel free to give more!", "date_of_review": "13 February 2019"}
{"review_id": 62, "restaurant_id": -11, "username": "Jacob B", "date_of_visit": " November 2018", "rating": "5", "title": "Awesome vibe, delicious drinks.", "comment": "Also a hotel, this joint was bumping on a Friday night! Great selection of beer/wine/spirits with an upscale (but not too upscale) flow. Lots of attractive looking peeps and a steezy ye olde Londonney decor.", "date_of_review": "21 December 2018"}
{"review_id": 63, "restaurant_id": -11, "username": "48PaulK48", "date_of_visit": " December 2018", "rating": "4", "title": "Great venue", "comment": "Was very fortunate to be invited to the Greenhouse (a conservatory on the top floor)., with a gherkin to rival the concrete version (which lit up when dark). Once I had got my breath back climbing all the stairs, we were treated to a fabulous lunch, including bake Camembert, scallops for starters with carrots wrapped in blankets, plus gorgeous roast lamb served with Kale and potatoes. To finish, the \"Tarte Tatin\" was gorgeous. So why not score it a 5? As I explained to David, our very attentive waiter, unfortunately the plates were cold, which took away from the gorgeous taste of the lamb. To be fair, David explained that they had not been able to warm plates because of the busy Christmas rush. Would love to return in the summer.", "date_of_review": "19 December 2018"}
{"review_id": 64, "restaurant_id": -11, "username": "isabellah-traveling", "date_of_visit": " February 2018", "rating": "5", "title": "Best Food I had in London so far!", "comment": "The Culpeper is an absolutely lovely place to visit, be it for a drink in the pub on the ground floor, or food in the restaurant on the 2nd floor or on the their rooftop. Both the place itself as well as their food and drinks and lovely staff are a treat, don't miss out on this, it's truly worth it!", "date_of_review": "3 January 2019"}
{"review_id": 65, "restaurant_id": -11, "username": "ClairePaterson1", "date_of_visit": " January 2019", "rating": "5", "title": "Steak Tartare to die for!", "comment": "The steak tartare at the Culpeper is just beyond divine..... the best I can remember having anywhere! I'll be back soon for more - congrats to the chef and the team.", "date_of_review": "27 January 2019"}
{"review_id": 66, "restaurant_id": -11, "username": "Rob R", "date_of_visit": " September 2018", "rating": "2", "title": "Good for drinks - fishy butter, avoid", "comment": "Go here for drinks often, it is good although busy and pretty pricy. Avoid the restaurant, I just dont understand how someone thinks raw fish is acceptable to be included in butter.", "date_of_review": "10 January 2019"}
{"review_id": 67, "restaurant_id": -11, "username": "MM_SVK", "date_of_visit": " February 2019", "rating": "5", "title": "Sunday roast at its best", "comment": "Absolutely satisfied. We googled this place and were advised to book table in advance, which we did luckily. Place was packed. Staff is friendly, I really enjoyed the ambience. We ordered two different roasts - one with horseraddish and steak, other one with lamb shoulder and mint-jelly. Both were great. Small complimentary starter included. Thank you ", "date_of_review": "10 February 2019"}
{"review_id": 68, "restaurant_id": -11, "username": "zagbronx", "date_of_visit": " February 2019", "rating": "5", "title": "Wonderful Staff", "comment": "We had a very good experience here. The staff was very efficient and friendly, someone went out of their way to find us a table on a crowded Sunday afternoon. Food was very good with many traditional options and my companions were very happy with their cocktails. I would go back in a mnute!!", "date_of_review": "3 February 2019"}
{"review_id": 69, "restaurant_id": -11, "username": "jaksdad", "date_of_visit": " February 2019", "rating": "4", "title": "Just great", "comment": "Sunday lunch was delicious with interesting starters including steak tartare and mackerel plus sourdough and anchovy butter. Bavette steak with veggies and crisp roasties was brill the lamb less so as a bit fatty but wine was good by the glass carafe and bottle. Bit quieter upstairs as bar is buzzy and staff are super friendly ", "date_of_review": "11 February 2019"}
{"review_id": 70, "restaurant_id": -11, "username": "Simon B", "date_of_visit": " July 2018", "rating": "5", "title": "Amazing food, a super breakfast and a lovely stay.", "comment": "We loved staying here so much we have stayed three times already. Warm atmosphere, friendly staff and awesome food. We love it here. Also very close to local markets and attractions. Take a walk up to Columbia road, and discover all the food outlets along the way. Very nice!", "date_of_review": "12 February 2019"}
{"review_id": 71, "restaurant_id": -11, "username": "Liz H", "date_of_visit": " December 2018", "rating": "3", "title": "Left feeling I wanted more", "comment": "This place has a lovely vibe and the staff very polite and accomodating. However, both myself and my husband were left somewhat disappointed with our meal from the First Floor Kitchen. The produce appeared to be good but lacked seasoning and there simply wasnt enough of it! Perhaps a little refined for us!!! But, there didnt appear to be any side orders available either. I think the bar menu would be far better for us and looked rather tempting too. I would love to give this place another chance as they obviously are doing something right due to the amount of people there. ", "date_of_review": "18 December 2018"}
{"review_id": 72, "restaurant_id": -11, "username": "masonfitzgerald", "date_of_visit": " October 2018", "rating": "5", "title": "Great food ", "comment": "Dined here a couple of weeks ago for a work dinner. All of us were very impressed by the food. I had mushroom on brioche for starter followed by the hake. The hake, served with mussels and chorizo, was amazing. The fish beautifully cooked and the flavours perfect.  Look forward to returning in the warmer weather to try out the rooftop bar. ", "date_of_review": "28 October 2018"}
{"review_id": 73, "restaurant_id": -11, "username": "mark00007", "date_of_visit": " October 2018", "rating": "5", "title": "Great food and service, cute rooftop bae", "comment": "The food here was amazing, we were very fortunate to get a table as it was quite busy and we had no booking.  The food was delicious, we were delighted with our meal. The service exceeded expectations.  Ending the evening with a cocktail on the rooftop bar was a great touch. I look forward to returning.   ", "date_of_review": "30 October 2018"}
{"review_id": 74, "restaurant_id": -11, "username": "484stefanom484", "date_of_visit": " November 2018", "rating": "5", "title": "Top", "comment": "I have been here before for drinks and today I found out that they served food too! So... food is amazing and of great quality. Service is great. Much better than many fancy places.  I really recommend this lovely place to everyone!", "date_of_review": "14 November 2018"}
{"review_id": 75, "restaurant_id": -11, "username": "danielrwalsh", "date_of_visit": " November 2018", "rating": "3", "title": "A little disappointing", "comment": "My wife and I were a little early for our Lunch at RockIT so we decided to pop into the Culpeper for a Coffee. Although it was late morning, about 11.45ap, my wife and I decided to just have a Coffee as we were about to go and eat Lunch at RockIT which is across the way. We did not ask for nor were we offered a food menu even though it was getting near lunch. I had a Cappuccino whilst my wife had a Latte. My Cappuccino was positively cold. In contrast, my wife's Latte was fine. Not exactly encouraging for us to return to try their food, but who knows", "date_of_review": "13 November 2018"}
{"review_id": 76, "restaurant_id": -11, "username": "Stephen G", "date_of_visit": " October 2018", "rating": "5", "title": "I eat and drink here whenever I'm in town.", "comment": "Great little pub, great little restaurant, great little roof top other restaurant. Interesting and well prepared food using their own home-grown veggies. I keep coming back!", "date_of_review": "30 November 2018"}
{"review_id": 77, "restaurant_id": -11, "username": "Phill_Essex", "date_of_visit": " December 2018", "rating": "5", "title": "Amazing Christmas lunch experience", "comment": "Visited the Culpepper with my work team for Christmas lunch. Had an amazing experience. Service was wonderful throughout. Food was simply amazing. Squid ./ goats cheese filo starters were sublime. Beef wellington / Chicken / Veg tasty and delicious Dauphinoise potatoes - OMG And delightful deserts and wine as well. Highly recommended!", "date_of_review": "18 December 2018"}
{"review_id": 78, "restaurant_id": -11, "username": "trendytommy", "date_of_visit": " November 2018", "rating": "5", "title": "Very decent place to stay", "comment": "My partner and I found the Culpeper a cracking little place to stay. It's very handily located near Aldgate East tube station and is only a short walk from the Shard, Tower Bridge and the Tower of London. Our bedroom was comfortable, warm and stylish and the bathroom clean. Highlight was the excellent breakfast with the best black pudding I've ever eaten! Also worth saying the staff were all very friendly and helpful. Highly recommended.", "date_of_review": "30 November 2018"}
{"review_id": 79, "restaurant_id": -11, "username": "Phil W", "date_of_visit": " November 2018", "rating": "4", "title": "Nice food and friendly service", "comment": "We had the roof top room and the taster menu.Staff were really friendly and helpful, the food was well cooked and very tasty. There's an optional drinks flight which was good, though not convinced it matches the food. Service pretty good given we were a large table.", "date_of_review": "29 November 2018"}
{"review_id": 80, "restaurant_id": -11, "username": "Rossco27", "date_of_visit": " December 2018", "rating": "5", "title": "Excellent standard of food and drink", "comment": "A menu that changes weekly is refreshing, but a menu that delivers quality is spot on. Lovely meal this evening with friends. Three meat eaters and a vegetarian. Each course is freshly prepared and delicious. Steak Tartar was excellent and so was the duck. Very good service. This is all based on the first floor restaurant.", "date_of_review": "14 December 2018"}
{"review_id": 81, "restaurant_id": -11, "username": "Arlette L", "date_of_visit": " August 2018", "rating": "3", "title": "Hot & Hip?", "comment": "We had a lunch here and the guys liked the craft beer. The food was good. It was more snack type food and all of us left still hungry. We had the soft shell prawn skewers - tasty. A friend had the caesar salad, drenched in mustard. The cherry tart went down well.  It was piping hot in the heatwave and a few people said they really should have umbrellas up here. It became unbearable after 2 hours. Maybe umbrellas would not fit with the look, yet it would be worth having some.  If you go bring a sun hat, fan and spf. The pub downstairs is lovely. I like the concept. Basically I am not a fan of snack type tapas food though, so the roof restaurant place was not for me. The others had mixed reviews. Good service. Enjoy your experience and bring that hat!", "date_of_review": "8 August 2018"}
{"review_id": 82, "restaurant_id": -11, "username": "LucLiza", "date_of_visit": " October 2018", "rating": "5", "title": "Cool, chic but not up itself! ", "comment": "This place has a great vibe without being too ‘Shoreditch’. I took my other half there for birthday drinks, dinner and stay over, so we experienced all of the hospitality The Culpeper has to offer.  The pub downstairs is a great space. We sat there sharing tables and people watching for a good couple of hours.  The beer was good and they had 4 different beers on tap (yes he did try them all!) and the team behind the bar took time and care when making me a lovely Old Fashioned or two!  We then went up to the first floor for dinner. A small but very well thought out seasonal menu, that takes care of the carnivores, the pescatarians and the veggies very well. It’s a cost space with about 35 covers and it is smooth, well run but you certainly don’t feel like they are constantly asking you if everything is ok. (One of my bugbears!)  We had wood pigeon wellington and a trout salad to start and then both had the bavette. Very good food at very reasonable prices.  We stayed there too and our room although it was one of the smaller ones was really well appointed with lovely tea and coffee options including fresh milk (yay!) A neat ensuite with a great shower.  And finally, breakfast was fantastic. (I am sure I could see the chef making sausages!) a generous full English with the best soft black pudding I’ve eaten in years!  However, if you are feeling slightly more abstemious then there are loads of different and delicious breakfast options.  Well done to The Culpeper - we loved our stay and we’ll be back! ", "date_of_review": "21 October 2018"}
{"review_id": 83, "restaurant_id": -11, "username": "vanitabarrett", "date_of_visit": " August 2018", "rating": "4", "title": "Great London pub with good food", "comment": "The Culpeper has a lovely feel to it when you walk in - I came on a very hot, sunny day and they had the large glass windows open which meant you got a nice breeze even when sitting inside. The food was lovely, but the service was extremely slow - we spent about 1h30 there in what was meant to be a quick work lunch. However, we did spring a table of 9 on them at short notice. However, they were very apologetic about it, and took 2 desserts off the bill as they took so long to arrive. As for the food itself, I enjoyed it but it was far too salty for me. I had the fish and chips, and everything on the plate seemed to be over-seasoned. Food was also a bit expensive (£14 for fish and chips), but this is a London \"gastropub\" so is to be expected.", "date_of_review": "6 August 2018"}
{"review_id": 84, "restaurant_id": -11, "username": "ViaBen", "date_of_visit": " August 2018", "rating": "4", "title": "Sunday Roast!", "comment": "I went to The Culpeper for Sunday roast and loved the place! It's a big, light filled, modern pub with quirky decor, good service, a good choice of wines and very good modern British food. I had the traditional Sunday roast that was excellent - good quality ingredients, nice presentation, excellent beef; my friend went for one of the veggie option (eggplants Parmigiana) and that was good too. The starters were fine and we were too full to try desserts. I am not a big fan of English Sunday roast so I can't really rate this as 'excellent' but I will definitely go back.", "date_of_review": "24 August 2018"}
{"review_id": 85, "restaurant_id": -11, "username": "reeceder", "date_of_visit": " September 2018", "rating": "1", "title": "Underwhelming roast ", "comment": "We ate a very poor Sunday roast here (chicken). The meat was dry and flavourless, the potatoes lacking any seasoning. It was also served with ratatouille which does not belong with a roast. The gravy was incredibly watery, devoid of any flavour. It was also annoyingly served on a large plate for us to serve ourselves. I didn't realise I had ordered a sharing platter from Nando's. Very disappointing. ", "date_of_review": "16 September 2018"}
{"review_id": 86, "restaurant_id": -11, "username": "campbellscottage", "date_of_visit": " September 2018", "rating": "5", "title": "Wonderful rooftop with views,garden, fantastic staff and delicious food.", "comment": "Went to rooftop on Friday lunchtime for family celebration. Booked table in advance. On day weather unpredictable. Arrived and started meal in sunshine. Stunning.Then the rains fell and we were ushered into greenhouse area where a table had been laid for us..just in case! Within a short space of time the sun came out and a great waiter dried off our original table and out we went to enjoy scenery and scents of herbs and flowers.A little later the weather changed again and back we went to greenhouse. Nothing was too much trouble. Absolutely fantastic. And the food was stunning too. We will be back.Thank you.", "date_of_review": "23 September 2018"}
{"review_id": 87, "restaurant_id": -11, "username": "BLACKBL00D", "date_of_visit": " August 2018", "rating": "5", "title": "Eating out in a big city", "comment": "Sorry for empty plates but this place was awesome the food the service the staff atmosphere again sorry for the empty plates but really it’s very good try it fish to die for I can’t enthuse enough try it oh 4 eatin with drinks wine aperitif (I know) £148", "date_of_review": "31 August 2018"}
{"review_id": 88, "restaurant_id": -11, "username": "Rman1", "date_of_visit": " September 2018", "rating": "5", "title": "Great bar, great food", "comment": "Not your average bar in so many respects. It’s smart, trendy, has two floors and a rooftop terrace. Not unusual for London perhaps, however the bar food served is innovative, tasty and well presented, and all at a great price. Full marks. ", "date_of_review": "19 September 2018"}
{"review_id": 89, "restaurant_id": -11, "username": "The_Prof58", "date_of_visit": " September 2018", "rating": "4", "title": "Family Sunday Lunch", "comment": "Lovely venue for a relaxed Sunday lunch with the family. They had a table large enough to accommodate all 15 of us (following visit to Secret Studio escape room up the road. Excellent service and friendly atmosphere.", "date_of_review": "30 September 2018"}
{"review_id": 90, "restaurant_id": -11, "username": "Stenvoid", "date_of_visit": " September 2018", "rating": "4", "title": "As good as ever - great spot for a sociable and out of the City business lunch", "comment": "Love this place - modern restaurant vibe in an old-school London pub. The restaurant upstairs is just wonderful - had some incredible seafood pasta here, excellent wine by the glass, but the chocolate dessert was out of this world.", "date_of_review": "15 October 2018"}
{"review_id": 91, "restaurant_id": -11, "username": "lucyelizabra", "date_of_visit": " June 2018", "rating": "2", "title": "Mediocre ", "comment": "Nice cosy rooftop with lots of home grown herbs and veg, however the food and drink in the restaurant is underwhelming and overpriced, £30 for a pitcher of unbottled prosecco is just ridiculous. ", "date_of_review": "7 June 2018"}
{"review_id": 92, "restaurant_id": -11, "username": "thoughtfuldiner", "date_of_visit": " June 2018", "rating": "4", "title": "Pleasant return", "comment": "This was my second visit (see my first review), and overall it did not disappoint. A caponata starter was light, tasty and came with good home-made ricotta. Another starter of asparagi was satisfying in the way basic dishes can be: just a high quality product matched by a well-made accompaniment, in this case a Hollandaise. Pork belly was full of flavour too and immensely satisfying, thanks to the quality of both the produce and the cooking, perfectly matched by a bean cassoulet. But the best dish of the evening was a cod, good, yes, but the show almost stolen by the amazing tomatoes coming with it, donating their sweet flavour and their intense moisture to the dish, with an olive tapenade providing yet another layer. The mains were the peak of our meal. This time we were underwhelmed by the desserts: a very eggy cherry clafoutis with very few cherries, lacking love; and a strawberry Eaton Mess consisisting mostly of lumps of sweet meringue, with little cream and virtually no strawbeeries. Service was pleasant, prices are OK for this area of London and in relation to the quality (and portions are not mean either). I tried a tequila cocktail and wasn't too impressed, but the drink list is interesting. The cuisine here is very direct and unfussy. Most dishes are very simple, but there is cleverness in this simplicity, and when you make the effort of getting high quality produce, this may be one of the best ways to showcase it.", "date_of_review": "15 June 2018"}
{"review_id": 93, "restaurant_id": -11, "username": "NanoElle93", "date_of_visit": " August 2018", "rating": "5", "title": "Best barman in the city!", "comment": "Just popped in for a quick drink on a lazy Sunday afternoon with a friend. Amazing customer service from a brilliant barman named Mat, who served us bespoke drinks for us fussy ladies. Wonderful drinks and a lovely atmosphere! Looking forward to this becoming our local :)", "date_of_review": "5 August 2018"}
{"review_id": 94, "restaurant_id": -11, "username": "simonpP9982GF", "date_of_visit": " March 2018", "rating": "4", "title": "Really good bar with good food", "comment": "Really good bar with good food can be standing room only on a weekend. I have been told it's a small hotel but I wasn't aware as we just went for drinks a few times. The bar staff make excellent cocktails.", "date_of_review": "25 June 2018"}
{"review_id": 95, "restaurant_id": -11, "username": "RYK_67", "date_of_visit": " December 2017", "rating": "4", "title": "Top bar with a fantastic roof top view.", "comment": "Obviously being London it’s quite a pricey place to drink for a long period of time, but if you do go here then make sure you go at a time / day that the roof top bar is open. The views are awesome from up there.", "date_of_review": "20 June 2018"}
{"review_id": 96, "restaurant_id": -11, "username": "693darrinh", "date_of_visit": " June 2018", "rating": "4", "title": "Sunday lunch", "comment": "Nice traditional looking pub/restaurant with a fairly extensive but different menu with that traditional feel. There were three in our party and we all had the lamb Sunday roast and I think we were all in agreement it was very good. The staff were brilliant despite no internet so no card payment facility at the time. The pub is a short stroll from Liverpool st station and you can wander through Petty Coat Lane market. In all a very pleasant experience.", "date_of_review": "23 June 2018"}
{"review_id": 97, "restaurant_id": -11, "username": "dayners820", "date_of_visit": " July 2018", "rating": "5", "title": "Great pub!", "comment": "In London for a few days just to eat, drink, and have a good time. The Culpepper was by far the best pub we’ve visited. Harry (the security) was awesome and so personable. He gave us great suggestions for food and where to watch the England World Cup match. Thanks for a great evening!", "date_of_review": "6 July 2018"}
{"review_id": 98, "restaurant_id": -11, "username": "K_R_2466", "date_of_visit": " July 2018", "rating": "4", "title": "Great pub & roof terrace", "comment": "The ground floor bar looked really good but we headed straight to the roof terrace. Surrounded by plants, herbs and foliage with the backdrop of tall buildings from the City made this roof terrace the best pub roof garden I’ve been to. I will return to try the food.", "date_of_review": "21 July 2018"}
{"review_id": 99, "restaurant_id": -11, "username": "badger5515", "date_of_visit": " April 2018", "rating": "5", "title": "As good as a gastropub gets", "comment": "Nicely designed and decorated. Excellent selection of real ales. Top quality service. Generous portions of well-cooked and tasty food. But it's the little extra touches that lift this place above the average. The anchovy butter with the bread was divine, and the home made tartare sauce with the fish made you realise just how awful the package stuff is. Superb lunch.", "date_of_review": "12 April 2018"}
{"review_id": 100, "restaurant_id": -11, "username": "mkh77", "date_of_visit": " April 2018", "rating": "4", "title": "Nice brunch", "comment": "Really nice pub with quick food service. It gets very busy so worth trying to book in advance. The menu is quite small but we were very happy with all the food that we ordered. I would highly recommend the poached eggs and the ham hock.", "date_of_review": "29 April 2018"}
{"review_id": 101, "restaurant_id": -11, "username": "Monty M", "date_of_visit": " April 2018", "rating": "4", "title": "Expensive and very 'Shoreditch', but just about worth it", "comment": "We had an early lunch here at noon, I was taking three clients out, all of whom are brilliant and under the age of 25; I'm not. Within two minutes we talking expansively about which type of gin to have with our tonics, so I knew I was in Shoreditch. We stayed for 80 minutes and the bill was (somewhat) high at more than £200, but that was probably because we were played when it came to the gin. The food was a tad pretentious, but nothing particularly wrong with that when it was so delicious. The waiter/waitress service was, as you expect, as if we were privileged to be speaking to them (not least about gin). Still, it was fun and a good start to the afternoon. I would give it a try, but stick to the food, not the (many times aforesaid) gin. I'll probably go back.", "date_of_review": "2 May 2018"}
{"review_id": 102, "restaurant_id": -11, "username": "Holly A", "date_of_visit": " May 2018", "rating": "1", "title": "Outrageous", "comment": "Was very excited to visit the Culpeper with my friends this week. We had reserved a table on the roof for some drinks and possibly dinner. We decided at the table not to order food after all and proceeded to drink the Sangria we had ordered. We were later told that we HAD to order food, otherwise we would be charged £15 per head for sitting at the table. The waitress insisted that this was a) stated in the booking telephone call (it wasn’t) and b) on the confirmation email. Having left, and checked the email it definitely isn’t stated. It specifies that you will be charged if you do not turn up or cancel within 24 hours (understandably) but there is not mention of being charged for not choosing to order food. Waitress said that they had turned away tables (despite there being multiple empty tables whilst we were sat there). We also offered to leave straight away - bearing in mind we had only been there for 20 minutes.  We asked for the bill after deciding we didn’t want to eat (considering there was only minimal options for my vegan friend), we asked to speak to the manager again but no avail to discuss our decision. We left after paying just for our drinks only to then receive a curt email stating that the charge had been taken without any prior warning.  Outrageous service. Definitely will not be returning - which is a real shame as the setting was lovely.", "date_of_review": "15 May 2018"}
{"review_id": 103, "restaurant_id": -11, "username": "RamonaC967", "date_of_visit": " May 2018", "rating": "1", "title": "Disappointing end of the lunch ", "comment": "First time here , and I invited some friends to enjoy the experience together . Food and drinks great ( a little bit overpriced but well we had a great view ).  We ordered a last round of drinks which we didn’t managed to finish by 4pm ( when we suppose to leave ). The attitude of the manager was rude telling us to leave , even though we said when the next booking arrives we going to stand up and leave , (she was keep telling us the booking is there waiting .).We didn’t finish and we left because the way she reacted was ridiculous , in our way out nobody was waiting ( and trust me is just one way out the “stairs”) . Never again . ", "date_of_review": "8 May 2018"}
{"review_id": 104, "restaurant_id": -11, "username": "citygirl53", "date_of_visit": " May 2018", "rating": "4", "title": "Quirky pub and restaurant with rooms", "comment": "Great pub with excellent food. We had a number of small plates and they were all very good.Loved the sourdough bread. There is also an open-air garden/restaurant on the roof - very quirky! It is possible to stay overnight as they have a few rooms. The rooms were very comfortable with lots of little extras like bottled water, an electric fan and home-made cookies.Due to its position on a main road however - it is fairly noisy at night - particularly if you have the window open.Just be prepared and dont go to bed too early ! Overall a very enjoyable stay.", "date_of_review": "11 May 2018"}
{"review_id": 105, "restaurant_id": -11, "username": "helenbbyrne", "date_of_visit": " May 2018", "rating": "4", "title": "Excellent pub and restaurant ", "comment": "I meet up with 2 particular friends about 3 times a year. They always choose the restaurant and it is always great. This time was my turn and we were not disappointed. The ambience and food were excellent and wine list was very good indeed. We shared the beef wellington between us and the accompaniments were fries and gem lettuce, lovely. We had a drink on the roof top after dinner, which was quirky esp the 7 foot cucumber ", "date_of_review": "28 May 2018"}
{"review_id": 106, "restaurant_id": -11, "username": "brianstalnaker56", "date_of_visit": " May 2018", "rating": "5", "title": "Great atmosphere", "comment": "Wonderful vibe, great local scene and quality food. Bar staff was friendly, and the food was very creative and unique for being a genuine and casual feeling pub ", "date_of_review": "30 May 2018"}
{"review_id": 107, "restaurant_id": -11, "username": "Jackjuniper1", "date_of_visit": " May 2018", "rating": "1", "title": "Customer service doesn’t deserve 1 star", "comment": "Went into here for my Brothers 40th birthday, I bought a cocktail which was £10 (very fair price). However, I did not like this drink and spoke to my sister.. saying that she shouldn’t buy a cocktail as they’re disgusting.. before she has the chance to reply, a barman whom I had not spoken to beforehand replied “the problem is not within here *shaking the glass* but with you.  I found this extremely rude, and the rest of my family were also flabbergasted at such a response from a member of staff. Following this, another member of staff were rude to my brother, which we then all decided to leave. Absolutely disgusting customer service. WILL NOT RETURN (Blonde long haired man, and female bartender were absolute jokes when it came to customer service)", "date_of_review": "27 May 2018"}
{"review_id": 108, "restaurant_id": -11, "username": "sc7162015", "date_of_visit": " March 2017", "rating": "5", "title": "Great pub in the east ", "comment": "Lovely pub, great Sunday roast and excellent espresso martinis.  In the summer there’s a lovely rooftop,. ", "date_of_review": "20 February 2018"}
{"review_id": 109, "restaurant_id": -11, "username": "londoner_n06", "date_of_visit": " February 2018", "rating": "3", "title": "Nice atmosphere, disappointing service", "comment": "Sunday roast was a bit of a miss. While the steak with trimmings was very good, the roasted chicken was surprisingly below par. What’s more, staff seemed incapable of handling special requests appropriately making this an unpleasant experience.", "date_of_review": "19 February 2018"}
{"review_id": 110, "restaurant_id": -11, "username": "TheLathe", "date_of_visit": " April 2018", "rating": "5", "title": "Brilliant Sunday lunch", "comment": "Absolutely fantastic Sunday lunch, super atmosphere, and an excellent selection of craft beers. Staff are friendly and attentive. Really couldn't fault it.", "date_of_review": "9 April 2018"}
{"review_id": 111, "restaurant_id": -11, "username": "JaneAiken", "date_of_visit": " February 2018", "rating": "4", "title": "Sunday roast", "comment": "Easy to book a table online. There was not a choice of meat for the roast Sunday lunch, but having said that the pork belly, and the whole meal was delicious. The meal, for two, is served on a huge plate and then you help yourself to what you want. Good coffee. Friendly staff, attentive service. Easy to find (opposite Petticoat Market). Recommended.", "date_of_review": "25 February 2018"}
{"review_id": 112, "restaurant_id": -11, "username": "saintlysinner", "date_of_visit": " March 2018", "rating": "4", "title": "Only drinks ", "comment": "We popped in here for a quick drink after work. Some of us had the food which was thoroughly enjoyed. It's a great pub with a good selection of alcohol on offer. Definitely recommended if you're in the area.", "date_of_review": "2 March 2018"}
{"review_id": 113, "restaurant_id": -11, "username": "katiedJ1465GM", "date_of_visit": " February 2018", "rating": "4", "title": "Great pub, great beer", "comment": "This pub has a relaxed vibe with some nice squashy chairs and little nooks to sit in. It gets really busy post work on a Friday but that means a buzzing atmosphere. Good beer selection, although only 1 IPA. Not crazy expensive either. ", "date_of_review": "25 February 2018"}
{"review_id": 114, "restaurant_id": -11, "username": "RobertEkr", "date_of_visit": " March 2018", "rating": "4", "title": "No Commercialism here", "comment": "I love a real buzz when walking into an establishment for the very first time so no disappointment here. A Monday night after work, cold and gloomy outside but step into this warm and welcoming characterful corner building to be greeted by service with a smile, comfy banquettes and a crackling atmosphere. Cheers!", "date_of_review": "6 March 2018"}
{"review_id": 115, "restaurant_id": -11, "username": "kippersharp", "date_of_visit": " March 2018", "rating": "3", "title": "Lads Day Out", "comment": "Although we are all regulars to the area, none of our party had been to this pub. As with 'all' the other drinking establishments of the area its very 'hip and trendy' as we're the beers on tap which was a complete letdown. Not being a lover of the 'London Brewery' scene that's been growing for some time, this all that this place (appears) to sell. It's popular but just not for me... ", "date_of_review": "25 March 2018"}
{"review_id": 116, "restaurant_id": -11, "username": "CorneliusJ22", "date_of_visit": " March 2018", "rating": "5", "title": "Excellent Sunday Roast", "comment": "Finding a place that does a decent Sunday Roast anywhere near or in London, is very much a rarity. Either the meat is sub standard, or the potatoes and veg have seen better days, So it's with great delight that we had Sunday lunch on the ground floor of this expansive pub; itself done up in a thoughtful mix of traditional and modern. Even on a busy Sunday (and it does get busy and bustly), the staff were very welcoming, friendly and attentive. We had a selection of starters which were generally very good indeed; tasty and well presented. The main courses (although not 'Roasts' in the traditional sense) were excellent. The bavette steak and pork belly came on platters and were excellently cooked and full of flavour. The accompanying roast potatoes, Yorkshire puddings and cauliflower cheese were really good. A very small criticism being that it left an overall impression of being just a touch salty, although this may just be down to individual food selection and my low salt threshold. The desserts, particularly the Chocolate Lava Cake, rounded off the meal nicely. Coupled with an extensive wine, beer and cocktail list, my faith in the 'Traditional Sunday Roast' has been restored.", "date_of_review": "20 March 2018"}
{"review_id": 117, "restaurant_id": -11, "username": "Johnnycash72", "date_of_visit": " March 2018", "rating": "2", "title": "Won't be returning - rude staff that overcharged on drinks bill", "comment": "Nice pub downstairs. The food in the restaurant is really lovely. But the staff leave something to be desired. One woman was particularly snappy. I asked for drinks several times that never turned up. I didn't realise till I got home we had been overcharged for drinks too. We were meant to hang around after dinner but left soon after. It's a shame as it totally spoilt a really good night. Won't be returning.", "date_of_review": "12 March 2018"}
{"review_id": 118, "restaurant_id": -11, "username": "BB90", "date_of_visit": " June 2018", "rating": "2", "title": "Expensive small portions", "comment": "VIsited for lunch and ordered the cured salmon, on pickled cumcumbers. This is £8 and appears in the main meals section of the menu. When the meal came, it was served on a side plate! There were just a few thin fragments of salmon spread around the plate on finely sliced cucumber. That was it. Hardly going to fill anyone. Lucky I'd ordered a portion of chips (which were outrageously priced at £4) to pad it out. Other people in my group ordered the fish and chips (£13), which looked slightly more filling. Left hungry and feeling ripped off.", "date_of_review": "1 June 2018"}
{"review_id": 119, "restaurant_id": -11, "username": "konstantinosc247", "date_of_visit": " December 2017", "rating": "5", "title": "Super Place!", "comment": "Nice drinks, friendly staff and very good food.  Industrial decor, mix of metal and wood, with quirky lights.  Good location and nice layout of chairs, tables etc.  Restaurant upstairs worths a visit too. Go there every time I come to London!", "date_of_review": "10 December 2017"}
{"review_id": 120, "restaurant_id": -11, "username": "davidcW7218LD", "date_of_visit": " January 2018", "rating": "5", "title": "Random walk past ", "comment": "I only came in because I wanted a quick drink , I ended up having a pretty good red  snapper drink ( Bloody Mary with gin instead of vodka ) and a stunning bavette steak Sunday lunch , with out a doubt one of the nicest Twist on a Sunday lunch I have had in London , the steak was juicy and tender , the cauliflower cheese was stunning crisp on top and perfectly cooked , and the Yorkshire pudding was pretty much as good as I get back home in the north east of England where we are famous for Yorkshire puddings , the waiting staff and barman who were working could not have been more helpful in serving me drinks and food . Stunning food and drinks ", "date_of_review": "14 January 2018"}
{"review_id": 121, "restaurant_id": -11, "username": "ThisIsNotASong", "date_of_visit": " January 2018", "rating": "5", "title": "Drinks only and very good!", "comment": "Went here for drinks and it did not disappoint. Very busy room -lovely atmosphere. If tripping around this part of town, well worth a visit!", "date_of_review": "19 January 2018"}
{"review_id": 122, "restaurant_id": -11, "username": "alanpick87", "date_of_visit": " December 2017", "rating": "4", "title": "Excellent modern British Pub", "comment": "A good choice of beers and foods, with lovely interior design. Staff provided great service and I would definitely come back!", "date_of_review": "25 January 2018"}
{"review_id": 123, "restaurant_id": -11, "username": "sglondon", "date_of_visit": " January 2018", "rating": "4", "title": "very good all round", "comment": "This is more of a gastropub than a restaurant with limited but good menu and nice rustic atmosphere in the 1st floor dining room. We all had different things, maybe only the squid as a starter was a bit soggy but everything else was good,. Extensive wine list, fair overall prices and friendly service.", "date_of_review": "19 January 2018"}
{"review_id": 124, "restaurant_id": -11, "username": "Rob R", "date_of_visit": " January 2018", "rating": "2", "title": "Poor, overrated in general", "comment": "I appreciate that the place had character. My starter was good. But my main the baked cod was truly awful. ", "date_of_review": "25 January 2018"}
{"review_id": 125, "restaurant_id": -11, "username": "L1I1D", "date_of_visit": " December 2017", "rating": "4", "title": "Christmas Friends Meal", "comment": "A group of 12 of us booked for a Christmas meet up, we were seated up stairs on a long table. The building and deco is lovely old/modern mix. The food was shared platters- absolutely delicious. Great amount a food and the sharing style meant you could have more than one dish. The beef wellington and potato dauphinoise were particularly good.", "date_of_review": "28 January 2018"}
{"review_id": 126, "restaurant_id": -11, "username": "Rachel A", "date_of_visit": " January 2018", "rating": "5", "title": "Great service, excellent food", "comment": "The staff at Culpeper did everything they could to make my experience there enjoyable. I called them to tell them I would be late for my reservation, and that was not a problem. I ordered the steak roast lunch - Medium Rare. However, it was a little rare for me (Maybe personal preference or the kind of steak it was), I asked the waitress to ask the chef to go over it for a few minutes. It came out delicious.. the whole meal was amazing. Thankyou", "date_of_review": "29 January 2018"}
{"review_id": 127, "restaurant_id": -11, "username": "Bear5308", "date_of_visit": " January 2018", "rating": "5", "title": "Unplanned. Excellent.", "comment": "Had met here for a drink with 9 old friends ahead of a booking at a nearby famous Pakistani curry institution. On arrival at the curry house, they refused to acknowledge our booking and invited us to join the 40 long queue. We weren’t impressed so we returned to the warm, welcoming arms of The Culpeper to plan our next move. Having eaten here before we knew it was good, so not expecting there to be a table for 9, we asked anyway... The response was outstanding. Within 15 minutes we were seated upstairs and being served charmingly by the staff. Good wine flowed, we shared 3 delicious starters (the anchovy butter however has a niche audience) and then 8 of us moved onto the shared beef bavette. Outstanding. One friend inexplicably chose something else, but it also looked good.  Great work Culpeper - more than a silver lining; should just have eaten here in the first place!", "date_of_review": "7 February 2018"}
{"review_id": 128, "restaurant_id": -11, "username": "ChrissyLee_12", "date_of_visit": " February 2018", "rating": "5", "title": "Busy pub with a lively vibe", "comment": "Popped in here at 6pm on Friday evening to meet our son who works nearby on Brick Lane. The pub was full - standing room only but great, lively atmosphere. Modern decor and good choice of drinks. Didn't eat here as already had other plans so cannot comment on the food but we would definitely go here again if only for drinks.", "date_of_review": "19 February 2018"}
{"review_id": 129, "restaurant_id": -11, "username": "f0xyf0x124", "date_of_visit": " September 2017", "rating": "4", "title": "Nice cold beer on a sunny afternoon", "comment": "Four of us had a quick drink in Culpeper on one of the few sunny afternoons we had this summer. Unfortunately, the roof garden was full and we were not allowed to even have a look, but we were happy enough to sit in the bar. Just had a beer but it was a really nice pub; lovely atmosphere and very nicely decorated", "date_of_review": "19 September 2017"}
{"review_id": 130, "restaurant_id": -11, "username": "752kyleb", "date_of_visit": " September 2017", "rating": "5", "title": "Great food drink and service", "comment": "Went there for a snack and some food with friends. We sat on the roof garden. The drinks were really good, especially the cocktails. We also had the steak and the lamb off of the BBQ which was outstanding. The service there on all levels was exceptional, they clearly take time to pick friendly and helpful staff. Would recommend ", "date_of_review": "17 September 2017"}
{"review_id": 131, "restaurant_id": -11, "username": "Karenpon", "date_of_visit": " July 2017", "rating": "5", "title": "So we are back!", "comment": "We liked it so much we came again! This time the roof top terrace was open and what a treat. The weather was stunningly hot so breakfasting on the terrace was absolute perfection. Surrounded by the ghastly yet impressive skyscrapers of eastern London we ate delicious food and enjoyed our rooms as much as last time. Ps the elderflower cocktail is a must!", "date_of_review": "4 October 2017"}
{"review_id": 132, "restaurant_id": -11, "username": "HattieW18", "date_of_visit": " September 2017", "rating": "5", "title": "Excellent stay!", "comment": "Spent three nights here on a trip to introduce my grumpy Scottish boyfriend to London and it didn't disappoint. Two minutes walk from Aldgate East tube with well appointed rooms on the second floor. Room was small (but this is London) but comfortable and very clean. Despite being on a main road and above a heaving pub and restaurant the room was remarkably quiet at night. Breakfast the next morning was very tasty with generous portions. An excellent stay, and a bargain too! Will be recommending to all my friends and family!", "date_of_review": "23 September 2017"}
{"review_id": 133, "restaurant_id": -11, "username": "sorrell53", "date_of_visit": " October 2017", "rating": "5", "title": "A warm welcome and excellent service", "comment": "Our daughter had recommended staying at The Culpeper and my wife and I were down in London for a concert so we decided to stay the night. We were not disappointed with any aspect of our stay from the warm welcome with the first drink on the house to the exceptional full English breakfast the next day. Our room was decorated in the Culpeper style and very clean and well-appointed with a bijou en-suite well-stocked with toiletries. Whilst the pub is popular and busy, the noise from below does not travel up to the bedrooms which have double glazed windows anyway. Every member of staff was onside with the fact that the customer should be treated well. We have to single out Tamsin, who was looking after check-in and was also maitre-de in the restaurant. She was professional and ultra- helpful. The prices were reasonable for London and transport links are great with Aldgate East tube station five minutes walk away. Thoroughly recommend this great pub/restaurant/hotel.", "date_of_review": "28 October 2017"}
{"review_id": 134, "restaurant_id": -11, "username": "HaljoHal", "date_of_visit": " October 2017", "rating": "4", "title": "Cool Spot Near Spitalfield's Market", "comment": "This multi-floor versatile property houses a street level pub, upstairs restaurant, + a 5 room boutique hotel and a rooftop garden spot for private events as well as public dining when open.  We stopped in for drinks and found the staff very welcoming + easy to order. We'd wished we did not already have dinner plans because the food coming out of the kitchen really looked great.", "date_of_review": "9 October 2017"}
{"review_id": 135, "restaurant_id": -11, "username": "patrickmg2015", "date_of_visit": " November 2017", "rating": "3", "title": "Good", "comment": "Had a double date here on a Saturday night. Food - it was good and tasty, but nothing to shout Home about. Portion size could’ve been slightly bigger, but I’m a big eater... Creme brûlée was really delicious. Service - really good and attentive. One negative thing - we were told when we were close to finishing up that they needed to the table. Fair enough, as we had been there for around 90 minutes. But the host came back again to remind us and then started moving all the tables around us to push them together while we were getting up. Literally as soon as we stood up they moved our table and i thought it wasn’t very professional as we’d just spent a lot of money. But on the whole it was good and 3 out of 5 is fair.", "date_of_review": "12 November 2017"}
{"review_id": 136, "restaurant_id": -11, "username": "smilgaki", "date_of_visit": " December 2017", "rating": "4", "title": "Very good food but will go a la carte next time", "comment": "Came here in a big group for our Xmas dinner. The pub is located on Commercial Street about 2 minutes walk from Aldgate East station. Very nice decor, especially downstairs, in an industrial chic kind of of way.  Had a drink downstairs to start with and got served pretty quickly despite the crowds. Good range of drinks including locally brewed beers. I must admit I was sceptical of the Xmas dinner menu arrangement - as a group you had to vote for your favourite dishes and those that got the most votes would be served and shared, i.e. no individual servings. This meant that if you are a very fussy eater you could theoretically end up with nothing you like. I decided to go vegetarian as that actually guaranteed your own starter and main.  The starters were enjoyed by all, though the omnivores struggled with the vegetable tart as it was really too small to be cut up and shared amongst so many. It also created a colossal mess on the table. For the main course, the omnivores got a real feast of meats and side dishes; whereas the vegetarians got a tiny portion of angel hair past with pesto and a few slivers of jerusalem artichoke and no sides (if the vegetarians were meant to get a share of the other sides that was not explained). The vegetarian portions were so small we had to go and order some chips to have enough to eat. Seeing that the vegetarian meal cost the same as the non-vegetarian meal that struck us as pretty outrageous. The pasta also seemed like an odd choice for a Xmas meal even though the taste was good.  The beef was very rare, which was enjoyed by some, but those who prefer their meat more well done struggled to eat it. Dessert was shared by all and the huge quantities of crumble and cheese served definitely made up for lack of vegetarian main course. We all ended up incredibly full. Overall the concept of the meal didn't go down that well, but everyone really enjoyed the food itself. It's rare to get a good Xmas meal in a group but we all agreed that the quality of the food was excellent. Seating was a bit tight and made the sharing more difficult and messy. The service was extremely good and Fabio who served us was utterly brilliant.  I have every intention of returning to have some more of the food but will definitely go a la carte next time and probably opt for the meat rather than the vegetarian option.", "date_of_review": "2 December 2017"}
{"review_id": 137, "restaurant_id": -11, "username": "bearcare", "date_of_visit": " August 2017", "rating": "1", "title": "Good luck getting served if you're not blonde", "comment": "Met a group of friends for drinks on a Friday, so predictably very busy. It was almost impossible to get any of the bartenders' attention to be served - they seem to only notice blonde women! We all noticed this, and decided it was not worth it to wait 20mins at the bar trying to make eye contact. Also, the tables and floor were really dirty, lots of dirty glasses and spillage that had not been cleaned.", "date_of_review": "22 November 2017"}
{"review_id": 138, "restaurant_id": -11, "username": "ContentTravellor", "date_of_visit": " July 2018", "rating": "5", "title": "Cucumber ", "comment": "The roof terrace in the summer is the place to sit, although you will have to book well in advance and hope it doesn’t rain. ", "date_of_review": "27 July 2018"}
{"review_id": 139, "restaurant_id": -11, "username": "PeteD_London", "date_of_visit": " August 2018", "rating": "5", "title": "Really good pub", "comment": "Nice place to go for the evening for a few drinks. Good range of beers. Excellent atmosphere. Not tried the food yet.", "date_of_review": "3 August 2018"}
{"review_id": 140, "restaurant_id": -11, "username": "xSB1992x", "date_of_visit": " September 2017", "rating": "5", "title": "Rooftop food is absolutely amazing", "comment": "The sad news is that you cannot book the rooftop tables and it's relatively small. But the good news is that the food is absolutely stunning. Amazing meats, salads...absolutely everything is flawless. The view's aren't bad either!", "date_of_review": "15 September 2017"}
{"review_id": 141, "restaurant_id": -11, "username": "Maria C", "date_of_visit": " August 2017", "rating": "5", "title": "Very nice place in suburbs of shorditch", "comment": "It is a super nice place with modern interior always filled with crowd of young professionals. Stuff is friendly and most importantly not everybody knows this place is open till late - as in later then any other pub in the area. Cul!peper!", "date_of_review": "8 August 2017"}
{"review_id": 142, "restaurant_id": -11, "username": "brucestalker1", "date_of_visit": " July 2017", "rating": "5", "title": "Our Go To Place To Stay", "comment": "Great location for exploring the E1 area as well as easy access to central London. Two minutes walk from Aldgate East and 5 -10 minutes from Liverpool Street tube stations. Flesh pots of Shoreditch, Hoxton and E1 in general all within easy striking distance. We primarily use this as a hotel. There is a flat rate price of £120 per night including breakfast, complimentary cocktails on arrival, and 10% off food and drink during your stay. Rooms are very well appointed. Someone has gone to a lot of trouble to take the rooms back to a dilapidated, Victorian look but this is far from a shoddy building. Very good beds, spotless bathrooms and good quality coffee/ toiletries. Love the historical books on the area. Breakfast is taken in the restaurant and is very special. Full range of cereals, bread and pastries cooked on the premises and superb cooked options (try the Harissa Eggs). Left luggage facilities and a separate side entrance if the bar is closed. We ate a light lunch on the Roof Terrace. I know there are mixed reviews but the test is trying to get a table up there. The bar does stay open late but we found noise was not an issue. Great place, real character, very good staff, and not a plastic chain hotel - what is not to like?", "date_of_review": "9 August 2017"}
{"review_id": 143, "restaurant_id": -11, "username": "Paul K", "date_of_visit": " August 2017", "rating": "5", "title": "Used as a base to get to World Athletic Champs", "comment": "Had a one night stay here in August. Arrived a little early to check in. Staff were brilliant and kept us informed all the way until the room was ready. Had lunch whilst waiting (shoulder of lamb) which was exquisite. My wife had caponata with ewe's cheese which almost turned this confirmed carnivore's head! Our room was fantastic and had lots of the facilities that some more expensive hotels don't e.g. Nespresso machine, rain forest shower, Ruark hi-fi. A free cocktail (and a couple after) followed which were unique really and new to us (and we know cocktails!). We visited the roof garden which is quite small but charming and a little piece of bucolic greenery in the City. Bed was extremely comfy and the room surprisingly quiet considering it's on a main arterial road. Breakfast the next day was even better than lunch. A full English with french black pudding-that should be an affront to this Lancastrian but it was too good to fault. All in all a cracking stay. We've been lucky to stay in some good hotels lately such as the Z, Citizen M and the Hoxton but this beats them all and is much cheaper at £120 a night including breakfast and cocktails. Close to the tube too-get down there!", "date_of_review": "11 August 2017"}
{"review_id": 144, "restaurant_id": -11, "username": "Ospreyhawk", "date_of_visit": " August 2017", "rating": "5", "title": "Excellent food ", "comment": "Had lunch here and it's so close to Spittalfields but away from the throng. Decent eating environment with lots of space and small quality menu. I had the Hummus , pickled red onion, fennel , dukkah with flatbread it was excellent and the flavours worked well. My wife and son had the fish and chips which looked so tasty The feedback was that the batter was lovely and crisp, the fish moist and tasty and the chips complemented the meal. Free bottled water on the table and free bread and a tasty Anchovy butter while waiting Overall a lovely decent priced lunch that I would recommend to visit.", "date_of_review": "10 August 2017"}
{"review_id": 145, "restaurant_id": -11, "username": "Dicko188", "date_of_visit": " August 2017", "rating": "5", "title": "Ambitious menu - good delivery ", "comment": "Great meal here. Menu looked a bit OTT - limited range but well thought through - but the delivery was bang on!! Cosy atmosphere and great service, with excellent cooking - will deffo come back ....", "date_of_review": "11 August 2017"}
{"review_id": 146, "restaurant_id": -11, "username": "sarahbush", "date_of_visit": " November 2017", "rating": "5", "title": "Friendly and relaxing", "comment": "Had a lovely evening celebrating a birthday - service was perfect, relaxed but attentive and kind. Food was tasty with some unusual twists - goats milk ice cream delicious. Lighting, decor and table spacing spot on too.", "date_of_review": "14 November 2017"}
{"review_id": 147, "restaurant_id": -11, "username": "lara1070", "date_of_visit": " August 2017", "rating": "5", "title": "Lunch in the sun", "comment": "Beautiful rooftop terrace. If you get there early enough you get a table straight away, otherwise there's a waiting list. The waiters are very attentive and polite. Food is great, cocktails are innovative. I recommend you visit this place, especially when the sun is out. ", "date_of_review": "13 August 2017"}
{"review_id": 148, "restaurant_id": -11, "username": "MIchealB2187", "date_of_visit": " April 2017", "rating": "4", "title": "Trendy place with great food", "comment": "Went here for lunch with my partner. Place is very stylishly decorated and food was excellent. Also have a decent range of beer in bottles. We sat downstairs but looked as though they also have a upstairs restaurant and roof terrace. Will go back.", "date_of_review": "6 June 2017"}
{"review_id": 149, "restaurant_id": -11, "username": "LondonEtcEtcEtc", "date_of_visit": " August 2017", "rating": "3", "title": "Sadly all a bit average for the price", "comment": "Had dinner here recently after reading glowing online reviews. Food from the short menu was not bad but nowhere near the standard it should be for the price. Wine list was again short but had some interesting choices to be fair. Restaurant interior was a bit \"hipster by numbers\" we felt (is presenting both starter and main on chipped plates cool now or did no one really notice this ?) and the turquoise banquet seating was a bit of an eyesore to be honest. Service was very \"casual\" to say the least, a bit amateur at times but mostly well meant. Overall a pretty average dinner and experience and way too expensive. A shame really as the pub downstairs where we had a drink before and after our meal was fine - great drinks selection and very nice bar staff. We were going to try their other (new) site for Sunday lunch but have shelved that idea now.", "date_of_review": "19 August 2017"}
{"review_id": 150, "restaurant_id": -11, "username": "Chris B", "date_of_visit": " June 2017", "rating": "1", "title": "Absolutely awful", "comment": "Had lunch in the rooftop area. Unbelievable rip-off. A single sausage cost £8 and the radish salad was, literally, a load of mud covered radishes, some of which were dry as a bone. No seasoning and a distinctly average sauce. Vegetable portions were minuscule and ridiculously over-priced. Worst lunch I've had in London. ", "date_of_review": "6 June 2017"}
{"review_id": 151, "restaurant_id": -11, "username": "Olympiadep", "date_of_visit": " June 2017", "rating": "5", "title": "Amazing rooftop - well kept secret!", "comment": "The whole interest of this pub is the rooftop terrace! It is very welcoming and is a vegetable garden at the same time. You can't be served the same menu as Inside, but they have a selection of sausages and meats, as well as nibbles and excellent desserts. Drinks are great too! Note that you cannot book in advance. A great place to go for lunch or dinner when the sun is out!", "date_of_review": "11 June 2017"}
{"review_id": 152, "restaurant_id": -11, "username": "fabio_ixelles", "date_of_visit": " June 2017", "rating": "2", "title": "Really bad cocktails", "comment": "Had a few drinks on the rooftop, which is a really nice and peaceful spot. Unfortunately the cocktail experience was an absolute disaster.. the quantity in the glasses is ridiculously small for the price you pay. As a fan of Negroni I can tell this was the worst Negroni's variation I've ever tried. Luckily it was over in litterally 2 sips...", "date_of_review": "13 June 2017"}
{"review_id": 153, "restaurant_id": -11, "username": "deborahl130371", "date_of_visit": " June 2017", "rating": "4", "title": "Nice bottomless brunch with friends", "comment": "It's very central and easy to get to. The atmosphere is friendly and te staff are helpful. We were quite a demanding bunch as there was 12 of us for a birthday but they coped really well. The place has a nice vibe, was nice and busy but not too busy and the food was good. The only thing I would say is they had no meat on the menu which made it a little difficult for some. Overall would definitely go back though and I love the fact that their cocktails are based om yhe herbs they grow on the roof :) so they are seasonal....lovely idea!", "date_of_review": "12 July 2017"}
{"review_id": 154, "restaurant_id": -11, "username": "gourmetkinglondon", "date_of_visit": " June 2017", "rating": "4", "title": "Great Sunday Roast ", "comment": "Popped in here last Sunday for lunch and was really impressed. Great produce and the roast chicken was two die for. A really nice touch to get sourdough bread with anchovy butter for free to start with. Highly recommended. ", "date_of_review": "27 June 2017"}
{"review_id": 155, "restaurant_id": -11, "username": "Stephen G", "date_of_visit": " July 2017", "rating": "5", "title": "I love this place", "comment": "I've eaten and The Culpeper twice in the last two weeks and probably a dozen or more times since they opened. I love this place. Great pub-ish vibe with excellent food (including veggies they grow themselves).  They've got a small hotel upstairs too but I've never been able to stay there ... they're always booked.", "date_of_review": "10 July 2017"}
{"review_id": 156, "restaurant_id": -11, "username": "PocketRocketsBlog", "date_of_visit": " June 2017", "rating": "5", "title": "Awesome Roof Garden", "comment": "Pub worth writing home about - traditional, huge plus a leafy roof garden. Not the cheapest, but prices you expect for what it is.", "date_of_review": "3 July 2017"}
{"review_id": 157, "restaurant_id": -11, "username": "wakelang", "date_of_visit": " July 2017", "rating": "4", "title": "Nice atmosphere, good food", "comment": "We ate fish and chips here. Easy to get to from our hotel. Nicely decorated. They have a full bar- had a traditional margarita, not bad. We were there on a Sunday evening. ", "date_of_review": "20 July 2017"}
{"review_id": 158, "restaurant_id": -11, "username": "lindsaytyrrell", "date_of_visit": " July 2017", "rating": "4", "title": "Great Sunday Lunch ", "comment": "Service was warm, friendly and attentive. The menu appears to change very regularly so on the Sunday we visited our meat options were pork belly or bavette (steak). We tried both and they were delicious, the bavette especially. My only complaint was the veg were covered in a strong mustard dressing which was quite overpowering. It would have been better if this was mentioned on the menu so we could have asked for the dish without it. Good local beers served. ", "date_of_review": "23 July 2017"}
{"review_id": 159, "restaurant_id": -11, "username": "mogiblade", "date_of_visit": " August 2017", "rating": "4", "title": "Good ", "comment": "This place is probably one of the best in east London, need more seats and less rude customers for sure .", "date_of_review": "24 August 2017"}
{"review_id": 160, "restaurant_id": -11, "username": "960erikv", "date_of_visit": " August 2017", "rating": "5", "title": "The fit boyz!", "comment": "We were greeted by a wonderful young lady at the door who seated us with a beautiful smile...Diogo served us (upstairs)he was wonderful in his pink shirt not to mention how he made us feel special and gave us great fantastic service all rounds we had a fabulous time and will recommend to friends and family and be back soon.  Thank you for a lovely Sunday treatment ", "date_of_review": "20 August 2017"}
{"review_id": 161, "restaurant_id": -11, "username": "James W", "date_of_visit": " April 2017", "rating": "5", "title": "Lively pub!", "comment": "Lively pub with bedrooms for booking just upstairs. (highly recommend the rooms, by the way) Always a good crowd and a really nice aesthetic feel to the place. 3 minute walk from Aldgate East station.", "date_of_review": "13 April 2017"}
{"review_id": 162, "restaurant_id": -11, "username": "sarasJ8406ID", "date_of_visit": " April 2017", "rating": "5", "title": "Great roof deck ", "comment": "Had a wonderful drink and yummy snacks with a friend on the beautiful roof deck. You should go there. The view can't be beat. ", "date_of_review": "2 May 2017"}
{"review_id": 163, "restaurant_id": -11, "username": "Oliver O", "date_of_visit": " March 2017", "rating": "5", "title": "One of my favourite Gastropubs in London", "comment": "Great food. Expensive though but its certainly a meal you walk away though and are pleased you paid up. Great atmosphere downstairs too and they have a rooftop up the top. One the verge of fine dining in the restaurant on the first floor. Will continue to come back here as the food and service is top notch.", "date_of_review": "23 April 2017"}
{"review_id": 164, "restaurant_id": -11, "username": "CharlouUK", "date_of_visit": " March 2017", "rating": "5", "title": "Great place for drinks or dinner!", "comment": "The bar is gorgeous, cocktails are good. The restaurant upstairs is very nice as well. But if you think that you can get a table at the last minute, you'll need to be very lucky. So book in advance so that you can enjoy both.", "date_of_review": "11 May 2017"}
{"review_id": 165, "restaurant_id": -11, "username": "sdbman", "date_of_visit": " May 2017", "rating": "3", "title": "Could be better", "comment": "This pub with rooms is in a great location just two minutes walk from Aldgate East tube station, across the road from petticoat lane and round the corner from Brick Lane. We arrived about 3.30pm and were asked to have a drink whilst our room was checked. Half an hour later a woman who had been sat about three feet away from us asked us if we were waiting to check in. It seems no one had bothered to tell her! The room itself was fine, secondary double glazing shuts out most of the traffic noise but I can imagine it would be very hot in summer. Our overhead lights did not work which we reported the following morning. We were told they would be looked at but it seems that the only thing done in our room all day was that the bed was made. There was no evidence anyone had cleaned the bathroom and the towels were not changed - not even the ones we left on the floor. I heard a member of staff complaining about the cleaner so maybe we were not the only ones to suffer. On the plus side, breakfast was superb, I love the refurbishment and the shabby chic feel to the place.The staff were friendly and apparently eager to please but there seems to be a general lack of coordination. ", "date_of_review": "19 May 2017"}
{"review_id": 166, "restaurant_id": -11, "username": "Rafael H", "date_of_visit": " May 2017", "rating": "5", "title": "Awesome rooftop", "comment": "It's got a pretty cool and hip space, but the rooftop is really the soul of the business. So awesome to get some sun up there! ", "date_of_review": "18 May 2017"}
{"review_id": 167, "restaurant_id": -11, "username": "lilyr127", "date_of_visit": " May 2017", "rating": "1", "title": "Lunch on the rooftop terrace", "comment": "We had lunch on the rooftop.  The menu is a bit weird, you have to pick some meat (like sausage or a bavette), and then some veggies to go with it. Veggies were in very small portion. Meat was ok. There was a hair in my radish. I thought it might be one of mine so I didn't say anything. Wine was tasteless. We had dessert, and I had ANOTHER hair in my chocolate dessert. I clearly pulled it out of the dessert. I showed it to the waiter, who asked me if I found it on the napkin. I said no and showed it was covered in chocolate.  He didn't say anything, and didn't even apologized.  I won't go back. Too bad as the rooftop is nice.", "date_of_review": "25 May 2017"}
{"review_id": 168, "restaurant_id": -11, "username": "ben_didonc", "date_of_visit": " February 2017", "rating": "4", "title": "Good bar", "comment": "Went there for a few beers before dinner.  Lively atmosphere and good choice of beers on tap. Will go again.", "date_of_review": "4 June 2017"}
{"review_id": 169, "restaurant_id": -11, "username": "meganlauranisbet", "date_of_visit": " June 2017", "rating": "5", "title": "A very cool pub", "comment": "Rooftop terrace, bar and restaurant? What more do you want? The atmosphere of this pub is cool and the interior - full of plants and quirky features, makes this place the perfect spot to enjoy a gin and tonic or a bite to eat. The rooftop terrace is popular so make sure you arrive early to ensure a spot!", "date_of_review": "3 June 2017"}
{"review_id": 170, "restaurant_id": -11, "username": "cambriant", "date_of_visit": " March 2017", "rating": "4", "title": "Huge portions!", "comment": "Went there for dinner. Had the fish and chips which was huge! Good but not spectacular. My cocktail was nice. Nice ambience though ", "date_of_review": "6 April 2017"}
{"review_id": 171, "restaurant_id": -11, "username": "SheensA86", "date_of_visit": " January 2017", "rating": "3", "title": "Nice pub with original features", "comment": "The Culpeper – A London Pub, 40 Commercial Street hotel restaurant and pub. Beautiful features in a well preserved Victorian building. The pub area is quite large with tables and bench seating, the restaurant upstairs is a mixture of booths and tables. Service wasn’t the best, in that it took a while to get someone’s attention but the food was good and the atmosphere pleasant. A nice local for people in the area and for anyone organising a get together with friends, everything under one roof.", "date_of_review": "2 June 2017"}
{"review_id": 172, "restaurant_id": -11, "username": "Nicola R", "date_of_visit": " February 2017", "rating": "5", "title": "Meal with family", "comment": "The rooftop was a lot quieter and the staff were attentive. Small choice of menu but food was really tasty. ", "date_of_review": "20 February 2017"}
{"review_id": 173, "restaurant_id": -11, "username": "Marzino", "date_of_visit": " February 2017", "rating": "5", "title": "Popped in for a few drinks....", "comment": "Was in for a few drinks with friends whilst on business in London. Nice friendly atmosphere, helpful and cheery staff and a good range of lagers and beers. Good looked good although didn't eat here. ", "date_of_review": "25 February 2017"}
{"review_id": 174, "restaurant_id": -11, "username": "Nur4AnjasReisen", "date_of_visit": " February 2017", "rating": "5", "title": "Good Food, Nice People, Good Atmosphäre", "comment": "Its Easy going. Food and selection drinks are amazing. A real good Pub. Better make sure that there is al Table available. Or you have to stand.", "date_of_review": "27 February 2017"}
{"review_id": 175, "restaurant_id": -11, "username": "Peter R", "date_of_visit": " February 2017", "rating": "4", "title": "Good interior but very noisy!", "comment": "Not sure if this wants to be a pub or a restaurant - a lot of space is given over to the latter. Whilst it's a pleasant interior at busy times you'll struggle for a seat - a very larger bench table doesn't help here. In the warmer months we'll try the roof garden. It is noisy though - hard surfaces and no soft furnishings - and you will probably have to shout your conversation. A plus is to have Meantime ales on tap which in itself makes the visit worth while.", "date_of_review": "22 February 2017"}
{"review_id": 176, "restaurant_id": -11, "username": "Koolbreeze51", "date_of_visit": " January 2017", "rating": "2", "title": "A Sunday Lunch Visit", "comment": "Poor. The choice was beef and it was tough. Dried out roast pots and the veggies were poor. Will not return especially at the prices they charge for poor fare.", "date_of_review": "27 February 2017"}
{"review_id": 177, "restaurant_id": -11, "username": "Kirstin B", "date_of_visit": " February 2017", "rating": "4", "title": "Birthday", "comment": "We came for stars.. for a birthday.. veggie food great.. but with all against us laura made our night. Wind rain and cloudy nights didn't stop her from making a smashing night for us.. and our knowledgeable night sky guide was great too x", "date_of_review": "27 February 2017"}
{"review_id": 178, "restaurant_id": -11, "username": "futtock21", "date_of_visit": " March 2017", "rating": "4", "title": "Full to the rsfters", "comment": "In contrast with many other eating on or near Commercial Street which were largely empty this Saturday lunchtime The Culpeper was fairly bursting at the seams with drinkers and diners alike. Perhaps it's because unlike many of its rivals, it adapts at weekends to what appears to be an egg-based brunch formula. Scrambled eggs with slices of Bayonne ham was enjoyed by my wife, whilst my daughter had an exemplary croquet Monsieur. I had a more conventional cottage pie served in an earthenware bowl with a side dish of rather refreshing kale, a green I'm pleased to see is coming back into favour. By the time it came for desserts such as creme brûlée orvrhubarb crumble, or even a choice of four cheeses, the noise from all the other drinkers and diners was proving a little overwhelming so we left a bit prematurely.", "date_of_review": "4 March 2017"}
{"review_id": 179, "restaurant_id": -11, "username": "marina15TO", "date_of_visit": " October 2016", "rating": "5", "title": "Great!", "comment": "Small rooftop patio is lovely for drinks when the weather is warm. Inside decor is beautiful and the atmosphere is always really lively. Great spot!", "date_of_review": "14 March 2017"}
{"review_id": 180, "restaurant_id": -11, "username": "Nicholas B", "date_of_visit": " April 2017", "rating": "4", "title": "Good but ", "comment": "Excellent place good London vibe. Great staff friendly atmosphere, only downside was the noise from the road. ", "date_of_review": "3 April 2017"}
{"review_id": 181, "restaurant_id": -11, "username": "digri87", "date_of_visit": " January 2017", "rating": "1", "title": "I had the worst experience ever in the restaurant upstairs.", "comment": "Honestly speaking the pub downstairs looks amazing but I had the worst experience ever in the restaurant upstairs. Food was terrible, uncooked and disgusting.", "date_of_review": "28 January 2017"}
{"review_id": 182, "restaurant_id": -11, "username": "Irissssss11", "date_of_visit": " January 2017", "rating": "4", "title": "Great", "comment": "Nice and friendley staff, good surroundings and great beers. Went here on a sunday for a drink and a bite, kitchen closses at 6 so only drinks for us", "date_of_review": "29 January 2017"}
{"review_id": 183, "restaurant_id": -11, "username": "eh999", "date_of_visit": " January 2017", "rating": "4", "title": "Try the sloe gin fizz", "comment": "We didn't eat here but stopped for a couple of drinks. They had a lovely looking cocktail menu but I only got as far as the sloe gin fizz as it was too tasty! If you're in the area it's a nice place for a stop.", "date_of_review": "2 February 2017"}
{"review_id": 184, "restaurant_id": -11, "username": "OxfordFamilyonTour", "date_of_visit": " January 2017", "rating": "1", "title": "Worst Sunday Roast Ever!!", "comment": "My daughter booked this pub for a Sunday roast as I was visiting her. On first impression it seemed nice and was busy which always is a good sign. I ordered the roast lamb which was on the standard menu and my daughter ordered the gnocchi. Well all I can say it was the worst roast I had ever had!  The lamb was just a slab on my plate, a bit like a doorstep. The vegetables were covered in a burgundy colour so I couldn't actually make out what they were and the worst were the roast potatoes which seemed to be reheated and glazed in another layer of oil and re used again and again! I complained that they were rock hard and they brought the same out again, couldn't eat it. There was no fresh veg as you would normally get with a proper roast and no colour to the dish. The only good thing about it was the huge Yorkshire pud that came with it. Disappointing!", "date_of_review": "31 January 2017"}
{"review_id": 185, "restaurant_id": -11, "username": "CustomerLondon1", "date_of_visit": " February 2017", "rating": "4", "title": "Good food and dogs friendly!", "comment": "After an hour spent looking for a place to eat with our little dog, we finally found this place that is dogs friendly! The food was nice, the staff exquisite and we had plenty of time to eat and chat. Very relaxed atmosphere, spacious and full of light. Perfect for a Sunday roast. Portions are decent size. Not on the cheap side. Would definitely go back.", "date_of_review": "13 February 2017"}
{"review_id": 186, "restaurant_id": -11, "username": "rakesh k", "date_of_visit": " February 2017", "rating": "5", "title": "Fabulous Valentine's treat ", "comment": "Visited with the Mrs on Valentine's eve and was well impressed by the ambiance, food and drinks, but most importantly, the helpful and knowledgeable staff. Simon and Josh took real good care of us. They knew their job well, answered all our questions patiently. The food was excellent.. we had the Duck hearts and squid risotto for starters, the rib eye steak to share for mains and the chocolate dessert, with a bottle of red (Rhone) and everything was perfect.  Totally recommend this place. ", "date_of_review": "15 February 2017"}
{"review_id": 187, "restaurant_id": -11, "username": "barbaramZ1070EZ", "date_of_visit": " February 2017", "rating": "4", "title": "Meal", "comment": "Had a lovely chicken, mushroom & leek pie with kale. Nice meal and good atmosphere pleasant staff. The only problem is the limited choice", "date_of_review": "18 February 2017"}
{"review_id": 188, "restaurant_id": -11, "username": "Amie T", "date_of_visit": " February 2017", "rating": "5", "title": "Excellent buzzing bar and trendy hotel! ", "comment": "Good value hotel and complimentary drink on arrival! Lovely staff can't do enough for you, will definitely be returning! Thank you ", "date_of_review": "19 February 2017"}
{"review_id": 189, "restaurant_id": -11, "username": "886aimeeh", "date_of_visit": " December 2016", "rating": "4", "title": "Great bar, but so busy", "comment": "Have been here on a couple of Fridays and I really like the atmosphere and the décor etc, but it really is uncomfortably busy on a Friday! Would like to go on another day when it's a bit calmer because it's a cool place. ", "date_of_review": "18 February 2017"}
{"review_id": 190, "restaurant_id": -11, "username": "slipshaney", "date_of_visit": " February 2017", "rating": "4", "title": "Nice spot", "comment": "Came here for a few after dinner drinks on a Friday night and was very happy with the place. The staff are nice, theres a good atmosphere and a good selection of drinks at the bar", "date_of_review": "20 February 2017"}
{"review_id": 191, "restaurant_id": -11, "username": "QiaoQiaoLondon", "date_of_visit": " December 2016", "rating": "5", "title": "Beautiful pub restaurant ", "comment": "We had dinner before our anniversary night out. The pub was packed downstairs and restaurant was busy. Really nice decors and good vibes. Food was great, high standard bistro style. Group of us all had a great time there! ", "date_of_review": "28 December 2016"}
{"review_id": 192, "restaurant_id": -11, "username": "sky A", "date_of_visit": " January 2017", "rating": "4", "title": "Cosy Pub", "comment": "It is very cosy place to go for drink. But at the weekend it is very crowded. If you are searching quite place go for weekdays. Especially employees are ver friendly. They have very good chips and beer selection. ", "date_of_review": "26 January 2017"}
{"review_id": 193, "restaurant_id": -11, "username": "Corrado B", "date_of_visit": " November 2016", "rating": "1", "title": "Worst dinner I had in a while", "comment": "WE HAD A TERRIBLE EXPERIENCE at the restaurant upstairs. We paid quite a lot of money for a rather mediocre meal. The apetizer was good but didn't require any cooking (burrata with a bit of pesto on top) and the main was a sad looking dish with beef mixed with chocolate and mashed potatoes on the side. Not only that... they only had three mains on teh menus (one meat based, one fish based and a third vegeterian )!! Which is totally fine, but how can you get them wrong if you only have three (polus the apetizers of course but 90% of them didn't require any actual cooking), so that got me wondering what types of chefs they've got in the kitchen... I think it's one of those places aiming at creating a fancy dinner experience (hence the beef with chocolate) but lacking in the ability to actually do so. The atmosphere is good but nothing special (just another hipster places with a meant-to-be-fancy rough decor). I would definitely recommend avoiding this place for dinner. It's a rip off. The pub downstairs looks nice though, and perhaps also the food isdecent (you can't really go wring with a burger), but I haven't checked the prices...  In conclusion just to be on the safe side and mainly to boicot these London restaurateurs who don't even try to provide a decent service and treat customers like a bunch of fool cashcows - AVOID THIS PLACE", "date_of_review": "17 December 2016"}
{"review_id": 194, "restaurant_id": -11, "username": "Gavin F", "date_of_visit": " December 2016", "rating": "5", "title": "Fantastic Sunday roast", "comment": "Have been here twice in the last few weeks and can whole heartedly recommend it for Sunday roast. The beef comes perfectly cooked on a large platter along with excellent Yorkshire puddings and lots of lovely roast vegetables. We had roast potatoes on one visit and what I would describe as roasted dauphinoise potatoes on the other: both perfectly cooked. You can order the beef in 100g portions which means it's perfect for all...depending on how hungry you are. They vary the roasts that are the alternative so sometimes chicken and other times pork. Both great alternatives. The staff were excellent and very accomodating and the price fair. The only thing I would note is that on both occasions we sat upstairs where the accoustics are far better than downstairs especially if you are looking for group conversation.  We will be going back again soon!", "date_of_review": "30 December 2016"}
{"review_id": 195, "restaurant_id": -11, "username": "DrSarah62", "date_of_visit": " December 2016", "rating": "4", "title": "Great Pub with Homemade Food", "comment": "A lovely friendly pub in Whitechapel serving a good range of wines and home made food and snacks. There is table service id you're eating and dinner is served from six pm.", "date_of_review": "4 January 2017"}
{"review_id": 196, "restaurant_id": -11, "username": "alisonchardy", "date_of_visit": " January 2017", "rating": "4", "title": "Great selection of Gins ", "comment": "We went here for a pre-dinner drink. Excellent atmosphere and a great selection of Gins. Although the bar was busy, were were served very quickly- the bar staff are very good. It's not cheap but it is good! ", "date_of_review": "6 January 2017"}
{"review_id": 197, "restaurant_id": -11, "username": "jandd51", "date_of_visit": " January 2017", "rating": "3", "title": "Mediocre would be the most positive way to describe the Sunday Roast.", "comment": "Nice place and a very tasty cider. Good service and friendly staff. Having read some reviews on how wonderful the Sunday Roast is we were sorely disappointed. £16 for a main/roast for that was poor value. We won't return to eat.", "date_of_review": "15 January 2017"}
{"review_id": 198, "restaurant_id": -11, "username": "602camilleb", "date_of_visit": " December 2016", "rating": "5", "title": "Best sunday roast in London", "comment": "We had one of the best Sunday roasts at the Culpepper. The food was delicious and all ingredients were very fresh. The atmosphere of the restaurant is great as well as the decoration.", "date_of_review": "14 January 2017"}
{"review_id": 199, "restaurant_id": -11, "username": "rebeccaldallimore", "date_of_visit": " January 2017", "rating": "5", "title": "Yummy Saturday lunch and great upbeat atmosphere", "comment": "We went for a late lunch toward the end of service on Saturday, we were a party of 10 in the bar area downstairs, despite being fairly busy we were served quickly and the food was really tasty. We stayed on for drinks afterwards until around 11pm when the lighting is dimmed and the bar is lively. Great fun place to go for casual drinks.", "date_of_review": "23 January 2017"}
{"review_id": 200, "restaurant_id": -11, "username": "VR747", "date_of_visit": " January 2017", "rating": "4", "title": "Lovely pub", "comment": "Lovely looking pub, great cocktails, great food menu, great atmosphere. Would definitely go back very soon!", "date_of_review": "23 January 2017"}
{"review_id": 201, "restaurant_id": -11, "username": "Joanne W", "date_of_visit": " December 2016", "rating": "3", "title": "Mid Week", "comment": "The atmosphere here is really good and the staff upstairs really engaging making the experience in dinning very good. The food was not up to that high standard we had medallions of beef for 5. The beef was inconsistent and on the light side for the five that were served, the vegetables were limited and the cabbage served was nice in presentation but not so appealing to taste. But we would thank the restaurant for the service and attention paid during the meal.", "date_of_review": "17 December 2016"}
{"review_id": 202, "restaurant_id": -11, "username": "Eva B", "date_of_visit": " November 2016", "rating": "4", "title": "Great food, great service, great Pub!", "comment": "Stayed for two nights with my husband, booked the greenhouse for a surprise Birthday dinner! The food was amazing, staff happy to please, lovely rooms and a real ‘gem’ of a pub. We will definitely be back.", "date_of_review": "21 November 2016"}
{"review_id": 203, "restaurant_id": -11, "username": "johnffodie", "date_of_visit": " November 2016", "rating": "4", "title": "Loved it ", "comment": "The place is Central location, open late and good variety of drinks. Downside is how crowded it gets at late nights meaning you have to stand outside and get herded behind a blue line to avoid inconveniencing passers-by! But over all very nice place ", "date_of_review": "21 November 2016"}
{"review_id": 204, "restaurant_id": -11, "username": "neil2108", "date_of_visit": " November 2016", "rating": "5", "title": "All round excellence", "comment": "We drank, ate and stayed the night in this wonderfully designed establishment. We cannot fault the Culpepper in any area from concept, service, value, vibe and atmosphere . Everything from the quality and unique nature of the menu (and the cocktails menu!!), the staff, the design and the whole feel of the place was wonderful. It is so refreshing to venture into Shoreditch 'hipster' land and find a total lack of pretension and get excellent food and service without feeling ripped off. Please keep it just as it is!", "date_of_review": "28 November 2016"}
{"review_id": 205, "restaurant_id": -11, "username": "P13NSA", "date_of_visit": " November 2016", "rating": "2", "title": "Very average ", "comment": "Really don't understand how this place is getting the reviews it does. Very mediocre food, not very generous portions. Did just enough not to get a complaint on the day. flat beer, small amount of chicken on plate dissapointing", "date_of_review": "29 November 2016"}
{"review_id": 206, "restaurant_id": -11, "username": "Lani N", "date_of_visit": " December 2016", "rating": "5", "title": "Best fish and chips! Great pub atmosphere! ", "comment": "Was the best fish and chips I've had so far! Absolutely loved it I could have licked my plate clean. Pub was excellent vibe with plenty of beers on tap. Busy but didn't have to wait too long for a table at all. ", "date_of_review": "1 December 2016"}
{"review_id": 207, "restaurant_id": -11, "username": "moorlad", "date_of_visit": " December 2016", "rating": "2", "title": "Won't be back", "comment": "Me and my wife had lunch in the culpeper after a visit to spitalfields market, on the board outside Sunday roast was advertised so we went in and chose the beef, we were then told the price of your meal was based on beef being £11 per 100grams but we could only have either 350 or400g portion this must be the most bizarre way of pricing a meal ever, when our meals came they looked nothing like a traditional roast dinner...no mash but a square of potato gratin, a hollow Yorkshire pudding and a mix of non descriptive vegetables the only plus side the beef was excellent...In total it cost £44 for 2dinners plus £5 for 2 small cokes plus £6.13 service charge they don't tell you about, If your looking for a reasonable priced traditional Sunday roast dinner then keep well away from the culpeper ", "date_of_review": "4 December 2016"}
{"review_id": 208, "restaurant_id": -11, "username": "shaminehm", "date_of_visit": " December 2016", "rating": "3", "title": "Good Xmas Dinner", "comment": "Service and atmosphere was excellent but the set Xmas dinner was overpriced. Would rather have paid less and had an edible quantity, than have so much food go to waste. Food itself was good but nothing special. ", "date_of_review": "3 December 2016"}
{"review_id": 209, "restaurant_id": -11, "username": "Richard_On_Route", "date_of_visit": " December 2016", "rating": "5", "title": "Great beer, food and atmosphere ", "comment": "A funky London boozer that offers great local ales and fab food. We visited here on numerous occasions during our stay in the square mile and it never disappointed. Always busy and with a great atmosphere, the food beer, food and service were all exceptional. Highly recommend. ", "date_of_review": "5 December 2016"}
{"review_id": 210, "restaurant_id": -11, "username": "Andrew_Swiss", "date_of_visit": " April 2016", "rating": "5", "title": "Rooftop with skyline view!", "comment": "I loved this place! They have a good range of local beers and friendly staff! The pub itself is very beautiful with vintage furniture and a lot of plants. Very cozy. Usually the pub is very crowded. The highlight of this bar is the awesome rooftop! Its a nice little rooftop with a small bar and a large grill on it. In summer you can enjoy some drinks and a delicious meal up there and enjoy the view! The food was awesome. I would come back anytime!", "date_of_review": "16 December 2016"}
{"review_id": 211, "restaurant_id": -11, "username": "CurlyJus", "date_of_visit": " October 2016", "rating": "5", "title": "4 Beautiful Rooms - a little gem of a place ! ", "comment": "The Culpeper Rooms are a real treat - cosy - so comfortable - a home from home ! 2 min walk from Aldgate East the Culpeper is well positioned. When I arrived I was greeted with a FREE first drink from the bar and 10% off food and drink thereafter - just show your Key.  There's a separate entrance so you don't have to walk through the bar - and the rooms are through a door on the top floor so you're not disturbed by the laughter in the bar. I had an early night and slept so soundly from 9:30 till 7:00 fantastic and needed ! With a coffee machine free sparkling and still water in the room I felt treated !  Breakfast is included but I didn't want to get out of bed so I missed it - but next time !!!  It's a walk upstairs no lift just for the lazy readers but there's an offer to carry your bags - if needed.  Don't be put off because these rooms are over a bar - it's a great place and worth a try ! LOVE IT x ", "date_of_review": "22 October 2016"}
{"review_id": 212, "restaurant_id": -11, "username": "traveloclock", "date_of_visit": " November 2016", "rating": "4", "title": "Lovely pub!", "comment": "Really enjoyed coming into here recently for a pre-dinner-pint. Exactly what one would expect for the area, and it ticked the boxes. cheers!", "date_of_review": "14 November 2016"}
{"review_id": 213, "restaurant_id": -11, "username": "Smifffy22b", "date_of_visit": " October 2016", "rating": "2", "title": "All suit. No trousers. ", "comment": "3 friends having a mid evening meal. Total cost with wine: £191. The venue and decor are trendy. If this was a highlights show then we'd be soft focusing on the exposed brickwork and trendy lighting.  But it's not a highlights show - it's a place that's supposed to serve good wine and food & this is where the problems start.  We shared a rump steak for 2 - one portion was inedible with gristle. The Rosso Italian was of the 3-Euro-at-the-vinyard variety, so paying £44 for a below average tipple was disappointing.  The culinary highlight was the beetroot starter which was tasty and original - so some hope remains - but not for me. I'll not be back. ", "date_of_review": "26 October 2016"}
{"review_id": 214, "restaurant_id": -11, "username": "423jafj", "date_of_visit": " October 2016", "rating": "5", "title": "Superb", "comment": "Wonderful restaurant. We had a drink in the pub downstairs first; excellent margaritas, very good selection of craft ales and friendly staff – a good start. Dinner in the restaurant was superb. The choices were limited to four starters and four mains but it was varied and between the five of us we tried a lot of different dishes, each one was delicious. I didn’t study the wine list too closely but found a very good Rose for £22. The atmosphere was laid back and friendly, the staff were very attentive but not intrusive, all in all a great night out. Will definitely return.", "date_of_review": "30 October 2016"}
{"review_id": 215, "restaurant_id": -11, "username": "Veralein", "date_of_visit": " October 2016", "rating": "5", "title": "Nice Pub with no tourists and good pale ale", "comment": "We found this pub by pure chance while rambling around Spitalfields and the brick lane. The pub is really nicely done up. We tasted several different types of beer and loved the pale ale. It was such a good place that we came back another night. We will definitely visit the Culpeper when we are back in london.", "date_of_review": "20 October 2016"}
{"review_id": 216, "restaurant_id": -11, "username": "S4549YSdanielb", "date_of_visit": " November 2016", "rating": "4", "title": "Good food, relaxed style", "comment": "Evening food with a friend. They had a special rump steak on offer which we both had and was excellent. Good selection of wine and beer. We ate in the upstairs restaurant. Downstairs is generally rammed especially on Fridays when we ate. One of the better pubs in the area. Decent puddings too. Friendly laid back service.", "date_of_review": "8 November 2016"}
{"review_id": 217, "restaurant_id": -11, "username": "albolinopasquale", "date_of_visit": " October 2016", "rating": "3", "title": "Rude staff", "comment": "I came in for lunch, kitchen was almost closing and I asked one of the guys if I could quickly order, they aloud me to do that but I think they might have been in rush because I had only a big grumpy face and rude attitude. I understand that kitchen was almost close but rather than have an awful service I preferred not to be seated at all.", "date_of_review": "11 November 2016"}
{"review_id": 218, "restaurant_id": -11, "username": "JLW27", "date_of_visit": " October 2016", "rating": "5", "title": "NFL Weekend Dinner Treat", "comment": "Wow!!! Second visit here, this time for dinner. Ignore the negative reviews, the food here is amazing. Fresh locally sourced produce cooked to perfection, knowledgeable attentive staff, great cool atmosphere, a brilliant place to eat, loved it and my other half has not stopped raving absolutely the quality. Definitely recommend this place and will be returning soon", "date_of_review": "22 October 2016"}
{"review_id": 219, "restaurant_id": -11, "username": "perry_braves98", "date_of_visit": " November 2016", "rating": "5", "title": "Excellent cuisine", "comment": "Saturday evening meal out. The bar was buzzing. The restaurant full but not cramped. Great atmosphere. Food and wine were excellent. Friendly helpful staff who know their stuff. Would highly recommend this pub/restaurant", "date_of_review": "12 November 2016"}
{"review_id": 220, "restaurant_id": -11, "username": "John S", "date_of_visit": " October 2016", "rating": "5", "title": "Excellent restaurant", "comment": "An amazing atmosphere. Arrived late from flight from Mexico, so had to share others' 'nibbles': excellent. Had fried fish and chips. The best I have ever tasted! The batter: well, it could have been a dish on its own!! Amazing! Culpeper is incredibly accessible (even from Heathrow!): just a couple of minutes from Aldgate East underground", "date_of_review": "21 October 2016"}
{"review_id": 221, "restaurant_id": -11, "username": "philomena o", "date_of_visit": " October 2016", "rating": "3", "title": "Credit to the lovely staff at the Culpeper, a place full of character and charm.", "comment": "Visited today for lunch with my brother. We choose an onion and cheese tart for starters and was disappointed to find the puff pastry was virtually inedible and the melted cheese sauce topping was very salty and was not to our liking. All credit to the member of staff and the manager who not only apologised and offered us a different starter but gave us complimentary desserts as well as taking the price of the starters off the bill. Our main course of brill with new potatoes and greens was superb. Though the roof top garden area is closed now for the winter we were still shown the area at our request as I'd seen this restaurant advertised in the Times travel magazine and wanted to check it out, as they grow some of their produce there. It was no trouble to the staff member to show us around and in fact he seemed proud to do so. Despite the shaky start we will go back for sure as we feel this place has so much to offer.", "date_of_review": "17 October 2016"}
{"review_id": 222, "restaurant_id": -11, "username": "katiefsharvey", "date_of_visit": " September 2016", "rating": "5", "title": "Busy and great for drinks.", "comment": "We didn't eat here, although the menu looked good. The Culpeper was our local while we stayed in Whitechapel, and there wasn't a single night that it wasn't busy. They have a great bar with good cocktails on offer, and the pub itself is very pretty. Would definitely recommend for after work drinks or some cheeky pre-dinner G&Ts! ", "date_of_review": "19 September 2016"}
{"review_id": 223, "restaurant_id": -11, "username": "th0masverbist", "date_of_visit": " September 2016", "rating": "5", "title": "Chillin' with a view on the Shard", "comment": "Be on time when the sun comes out! This beautiful rooftop bar is popular among locals. It is a perfect place to get away from the busy Commercial street and relax. ", "date_of_review": "18 September 2016"}
{"review_id": 224, "restaurant_id": -11, "username": "TheGraciousOne", "date_of_visit": " September 2016", "rating": "5", "title": "Lunch in the sunshine!", "comment": "Caught up with friends here during a recent trip to London. They are locals and seemed to have plenty of good things about this place, I'm not surprised, it was excellent!! We had food and drinks in the rooftop garden and it was devine, granted the amazing sunshine and fabulous view added to the experience. The menu was quite limited but we all found something, I had the mackerel with a house salad and it was delicious. The others had lamb and salad which they said was great. I had wine but a couple had cocktails and they looked lovely. It's a very relaxed vibe and this is reflected in the attitudes of staff, which I found quite refreshing, although some may be frustrated by this. The menu downstairs had a lot more variety although if you eat here you loose the charm of the garden. Highly recommended!!!", "date_of_review": "25 September 2016"}
{"review_id": 225, "restaurant_id": -11, "username": "Simpson0n", "date_of_visit": " September 2016", "rating": "5", "title": "A great mix of pub an restaurant with a bonus on the roof. ", "comment": "This is an East-end pub that has been brought forward in a sympathetic way and without losing its charm.  Decor gives a real glimpse of its past.  Good selection of ales, wines and spirits.  Staff very effective and with real personality. They know their products and provide great service.  The restaurants don't take bookings, and can be very popular but it's a nice wait in the bar.  The first floor restaurant has a small menu, but one where I was happy to choose every dish. All cooked to order and good quality. The rooftop is entered through a greenhouse with their own grown produce. There was no space to eat there when I visited but it sure smelled good and worth a walk up to see the terrace.  The fact that the place is full every time have visited speaks volumes to me ", "date_of_review": "28 September 2016"}
{"review_id": 226, "restaurant_id": -11, "username": "esansom53", "date_of_visit": " September 2016", "rating": "5", "title": "Terrific evening out!", "comment": "Pre dinner drinks in buzzy, vibrant surroundings but with attentive staff clearing glasses as soon as people left, wiping tables and keeping clean. Then upstairs to dinner and wow! Charming, enthusiastic staff who know their wines, understand the menu and can explain things beautifully. I had the rabbit casserole on white beans cooked with herbs and greens - it was totally delicious.! Compliments to the chef!", "date_of_review": "1 October 2016"}
{"review_id": 227, "restaurant_id": -11, "username": "Stenvoid", "date_of_visit": " September 2016", "rating": "4", "title": "Great efficient business lunch - spot on", "comment": "First visit here in some time but as impressed as ever. Great service - friendly welcome and a lovely table set aside having booked early.  The Wild Goose ale is very tasty and went well with the exotic beetroot, carrot and cow's curd Middle Eastern salad.  For the main we shared the incredible beef - beautifully cooked and succulent with perfect vegetable and anya potato accompaniment. From previous experience I knew to sample a glass of the \"Ink\" red wine.  Couldn't miss dessert - a beautiful chocolate fondant with white cheese sorbet.  Extravagant and interesting food combinations but served without fuss or pretension. Everyone I have taken here has gone back under their own steam and I am sure today will provide the same! ", "date_of_review": "28 September 2016"}
{"review_id": 228, "restaurant_id": -11, "username": "Q1033RVdanm", "date_of_visit": " October 2016", "rating": "1", "title": "Poor food and service", "comment": "Booked a table for a 1pm Sunday roast, at 2pm we had still not revived our food. We spoke to the manager who went to the kitchen and found our order. The food was horrible (see pic) the pork was under cooked, gravy was weak with the consistency of water the carrot and roast potato were cold and raw in the middle an absolute disgrace. Avoid much better places to eat on commercial street looking for a Sunday roast go to the Water Poet round the corner much better for a lower price.", "date_of_review": "2 October 2016"}
{"review_id": 229, "restaurant_id": -11, "username": "lisahamp2n", "date_of_visit": " October 2016", "rating": "2", "title": "Average and overpriced", "comment": "We popped in for a Sunday roast the menu was limited no roast Chicken, Lamb, Beef or veg option just pork, poorly executed, small portion of red cabbage and a whole carrot no other veg very average food for your money, drinks are ok and service is attentive. Would avoid try the Well and Bucket or Galvins same price and never fails.", "date_of_review": "4 October 2016"}
{"review_id": 230, "restaurant_id": -11, "username": "DoraA415", "date_of_visit": " October 2016", "rating": "1", "title": "Extremely overpriced and disappointing food", "comment": "Awful experience - Only couple of choices. Chose the Roast Beef. The waitress was telling me that the smallest portion is 300g but missed to inform me that they charge £11/100g beef!!! No price on menu. There might have been small print but who reads small prints on a menu for prices - roasts are not normally priced this way in pubs and you would expect them to be around £15-20 in pubs. We actually got the bill before getting the food because we got there late and the rest of our party was finishing up. So I saw £33 on the bill - went and complained and asked if I could get a smaller portion than 300g as I was shocked by the price in a pub like this. Its a simple pub after all. They did nothing about my request and served the food anyways 20 minutes later. I was also not asked how I liked my beef - and was served quite rare that I do not like. I did not send it back because by then I was starving. In addition I was asking the waitress when I was ordering what the side is and if it was Yorkshire pudding and I was telling her that I can not eat gluten. She said it was a kind of roast potato - I said that is fine. However, she still served up a Yorkshire pudding with my meal. The meal was blend on top of everything. I paid a high price for a less than average meal. On top of everything, after expressing that I was not happy the waitress kept staring at me with a sarcastic smile on her face the whole time I spent there. She also asked whether I liked the meal - I answered honestly that no I did not like it at all - she did absolutely nothing about it. The worst experience I ever had in any establishment where I left my money and was supposed to get a service for it! I could rate 0 if I could.", "date_of_review": "9 October 2016"}
{"review_id": 231, "restaurant_id": -11, "username": "Gizmo2005", "date_of_visit": " September 2016", "rating": "4", "title": "Posh nosh", "comment": "Nice and friendly pub style. But don't expect pub food or prices. It's a little expensive but the food is very good and I definitely go back. My only gripe would be the menu is a little short on choice. ", "date_of_review": "17 September 2016"}
{"review_id": 232, "restaurant_id": -11, "username": "PalmersLondon", "date_of_visit": " August 2016", "rating": "5", "title": "Great Sunday roast. ", "comment": "Must try sunday roast there. It was great, I'm not a big fan of roast potato but they've done their potato in a very special way and it was delicious. Very attentive service, but there was no pressure of taking order and some annoying 1.5/2 hours table policy which a lot of restaurants do these days. Our friends brought their 15 months baby. The waiter serve us was very patient and did not rush us while we eating, chatting and trying to feed baby and tidy up baby's mess. He did not harass us in anyway or annoyed by the food the baby dropped on the floor. It's a great pub to hang out with friends/families in the weekend. Pretty roof garden to enjoy the sunshine too.", "date_of_review": "14 August 2016"}
{"review_id": 233, "restaurant_id": -11, "username": "Stay469807", "date_of_visit": " July 2016", "rating": "5", "title": "highly recommend ", "comment": "This place is always packed on a weekend and there is indeed a reason for this. This pub is an authentic London/Shoreditch experience. Great variety of drinks. The coffee is amazing as well. Perfect for a lazy Sunday afternoon chill. ", "date_of_review": "8 August 2016"}
{"review_id": 234, "restaurant_id": -11, "username": "Melody N", "date_of_visit": " August 2016", "rating": "5", "title": "Sardines in the sunshine", "comment": "Our friends had chosen the Culpeper as a base for a birthday celebration weekend and what a fabulous experience it turned out to be. Starting with lunch on the roof top terrace, to a delicious evening meal in the main restaurant, lovely room with the shabby chic décor, bar with a tremendous range of beers, wines and cocktails, excellent breakfast on the Sunday morning and exceptional customer service from our host Lauren. Made for a superb experience, highly recommended.", "date_of_review": "11 August 2016"}
{"review_id": 235, "restaurant_id": -11, "username": "MarkP1858", "date_of_visit": " August 2016", "rating": "5", "title": "E1's best Sunday lunch", "comment": "I never thought anyone could beat my husband's gargantuan Yorkshire puddings until now.  Well done Culpeper chef you delivered on all levels to an extremely picky crowd. You even prepared a full pescetarian roast dinner.  Thank you so much for giving that extra effort, it is so appreciated. We had a fantastic time: fabulous food, easy atmosphere topped off with cocktails on your beautiful, fully functional allotment roof top over looking E1's most famous sights.  Whatever you're doing - keep doing it; it works We left feeling very happy.", "date_of_review": "21 August 2016"}
{"review_id": 236, "restaurant_id": -11, "username": "mozart21", "date_of_visit": " August 2016", "rating": "4", "title": "Almost as good as it gets", "comment": "This is a restaurant above an amazing London pub. It represents everything I miss about living in London: vibrancy, choice, quality and eager and enthusiastic, diverse staff. And that's just the pub on the ground floor. Restaurant busy and also a great atmosphere. Alas, we didn't have a table on the roof garden which would have been even better on a fine summer evening.  Short but varied menu, decent and unusual wine list. Service lacklustre was the only disappointment and the large plaice for two served on the bone did not come with an offer to filet it before serving. Prices fair for London.", "date_of_review": "18 August 2016"}
{"review_id": 237, "restaurant_id": -11, "username": "JLW27", "date_of_visit": " September 2016", "rating": "5", "title": "London weekend", "comment": "Visited here for Sunday lunch , quirky decor, relaxed atmosphere excellent food and service . Would highly recommend ", "date_of_review": "11 September 2016"}
{"review_id": 238, "restaurant_id": -11, "username": "piotrh1982", "date_of_visit": " September 2016", "rating": "4", "title": "Great", "comment": "Nice place. Open till very late hours also during workdays. Very kind service. Lots of different alcohols - strong and good beer of course", "date_of_review": "6 September 2016"}
{"review_id": 239, "restaurant_id": -11, "username": "Fizz100", "date_of_visit": " August 2016", "rating": "4", "title": "Exceeded Expectations!", "comment": "Four of us just spent a birthday week end based around The Culpeper! We wanted a base to explore Shoreditch and chose The Culpeper as it seemed to tick all the boxes. The bedrooms although not huge were spotlessly clean and comfortable. The bathrooms although small had a walk in shower and again spotlessly clean. Of course, there is traffic noise from the road but that is what we expected when we chose to stay on Commercial Road! The staff were all friendly, helpful and professional. We had drinks and tapas on the rooftop terrace for lunch. The space isn't huge but it has been well thought out and is a very relaxing area. The pub is a great base for exploring Spitalfields Market, the various bars around Shoreditch and the vintage shops. Not to mention Colombia Road market.  We had dinner in the restaurant. Although only 3 choices for each with lemon sole and steak to share as extra dishes there was plenty of choice for everyone. The waiting staff were helpful and gave us great recommendations for the food and wine. All which were spot on. The food was beautifully cooked and we all enjoyed our meal not one gripe!  The bar downstairs although busy wasn't too loud for a Saturday night. Plus there were plenty of seats. Drinks were all very reasonably priced. Breakfast was included in the price of the room and was delicious, lovely ingredients and all very well cooked.  The staff went out of their way to be helpful with lots of extra touches, nothing was too much trouble for them. The whole stay was excellent and this was in part to the staff and the venue as a whole. I cannot recommend it enough for a stay in London. It ticks all the boxes, trendy vibe but comfortable and relaxed. It exceeded all our expectations.", "date_of_review": "7 August 2016"}
{"review_id": 240, "restaurant_id": -11, "username": "Caroline C", "date_of_visit": " September 2016", "rating": "4", "title": "English Sunday Dinner required !!", "comment": "Friendly hostess; we had to book as it was busy; so strolled around for an hour; not a problem. The beef was excellent !!! I would've preferred more vegetables, &, as we shared the beef we had the 'pomme Anna chips' :- I would've preferred the roasties that came with the pork option :- The Ribiera del Duero red wine was excellent.  I resent a 12.5 % service charge :- I always reward good service, but don't like this 'system' :- It would definitely put me off returning.", "date_of_review": "11 September 2016"}
{"review_id": 241, "restaurant_id": -11, "username": "ukjono", "date_of_visit": " August 2016", "rating": "3", "title": "Busy", "comment": "Designers idea of an \"Old London Pub\". Its ok just but very overpriced beers and when we went extremely busy.Didn't stay for food, although what I saw of the menu it looked ok but again overpriced.", "date_of_review": "12 September 2016"}
{"review_id": 242, "restaurant_id": -11, "username": "SusanaTeix", "date_of_visit": " June 2016", "rating": "5", "title": "Nice view and green space", "comment": "You can get a really nice overview around the city, very nice garden and the drinks menu looks attractive, the only \" negative\" point is that they don't have any non alcoholic drinks in the menu but they created something for us without any trouble!!! Thanks for that guys. ", "date_of_review": "14 July 2016"}
{"review_id": 243, "restaurant_id": -11, "username": "David E", "date_of_visit": " July 2016", "rating": "5", "title": "Delicious", "comment": "First floor restaurant not the roof top. Absolutely excellent. Chopped raw beef starter sublime, tender, delicious and perfectly seasoned and spiced with a hint of anchovy to lift it to that special level. Cod for mains with the most amazing Mediterranean fennel side and mash beautifully smooth and just the right amount of buttery creaminess. The cod was succulent, moist with the skin spot on crispy. Friends had desserts which were awesome too. Great light and airy space with plenty of room so you don't feel cramped. Service very attentive and personal. Good timing between courses so no hesitation giving it the 5/5 ", "date_of_review": "21 July 2016"}
{"review_id": 244, "restaurant_id": -11, "username": "Stephan R", "date_of_visit": " July 2016", "rating": "4", "title": "Mediterranean brunch", "comment": "Went to the Culpeper to try out the rooftop garden but unfortunately it was full which isn't surprising go en the weather. Downstairs in the pub was nice and we ordered the house cured salmon and some olives. The salmon was great however the olives tasted a bit funny. We asked the waiter to try and he didn't seem to think it was unusual. Wouldn't recommend them. The Culpeper juice was quite nice orange and grapefruit blend. Overall very nice pub. ", "date_of_review": "23 July 2016"}
{"review_id": 245, "restaurant_id": -11, "username": "Travelista9876", "date_of_visit": " July 2016", "rating": "1", "title": "Overrated", "comment": "No idea why people rave about this place. It's an average pub. That's it. Just putting 'gastro' in front of the word 'pub' does not make a place special. Went there for Sunday lunch - half the menu was off by 4pm. Enough said.", "date_of_review": "19 July 2016"}
{"review_id": 246, "restaurant_id": -11, "username": "Q1033RVdanm", "date_of_visit": " July 2016", "rating": "4", "title": "Not bad at all", "comment": "Nice little pub, good selection of beers, cocktails and wine, food is very good just a little over priced in comparison to other local pubs, always busy with a fun atmosphere ", "date_of_review": "25 July 2016"}
{"review_id": 247, "restaurant_id": -11, "username": "Shaun M", "date_of_visit": " July 2016", "rating": "5", "title": "Brilliant pub with bedrooms", "comment": "Very much an old East End London pub but with a modern slant. Culpeper incorporates great atmosphere , good ales and excellent food .We stayed over two nights and it was faultless. Comfortable bed small but spotless bathroom, helpful very friendly staff , nothing was too much trouble. Breakfast was a joy , taken on the sunlit herb filled roof garden . Best full English my partner had ever eaten and my perfectly scrambled eggs and home cured salmon was delicious. Yes its a busy traffic junction but earplugs make it possible to sleep with the window open. We would thoroughly recommend and its only a few minutes walk from Aldgate east tube. or, walk the surrounding streets and discover many wonderful sights.", "date_of_review": "24 July 2016"}
{"review_id": 248, "restaurant_id": -11, "username": "David and Marga... A", "date_of_visit": " July 2016", "rating": "5", "title": "Unique and memorable", "comment": "We spent three nights here whilst visiting London. The location is excellent for easy access to whatever you choose to do/places to visit, and has easy access to the underground (Aldgate East)  This is a unique place to stay, not your standard chain hotel, the rooms are comfortable, looking as though a coat of paint wouldn’t hurt in a shabby-sometimes-chic style. Our room (No.3) had a super comfortable bed, well equipped bathroom with high quality power shower. The downside in the room was that the top quality coffee maker, made a lousy cup of tea – a kettle would have been a more adaptable addition. Having read about noise from the busy streets, we used our well-travelled ear plugs and had 3 really good nights sleep, leaving the windows open. This is a busy and vibrant property, and again having read some negative reviews about the cost of drinks and food, let’s get it into perspective. First of all, this is London. Once you’ve got that, the choice of drinks was good, the food in the bar was high quality and not like your average gastro/pub grub.  The food in the restaurant was at an entirely different level, delicious and memorable, and credit has to go to the Head Chef and his staff for high quality produce, a lot from the roof garden, and has a wonderful ambience, with excellent service throughout. You need to book to get a table. To give you an idea of costs, on our last evening there were four of us for a meal in the restaurant. We all had starters, mains, desserts. We had two bottles of wine, coffee and liqueurs and our bill equated to £45 a head. That was good value for money anywhere. If want to visit Culpeper, just note that this is mobility accessible at bar level, but not in the restaurant or bedrooms.", "date_of_review": "29 July 2016"}
{"review_id": 249, "restaurant_id": -11, "username": "natstrat", "date_of_visit": " July 2016", "rating": "4", "title": "Roof Garden is Tops!", "comment": "Roof Garden is a great end to any day in London. They have a great menu and their staff is friendly.", "date_of_review": "4 August 2016"}
{"review_id": 250, "restaurant_id": -11, "username": "typographer", "date_of_visit": " June 2016", "rating": "5", "title": "Great food, great place - try it!", "comment": "Birthday dinner for four - we covered the menu between us, as it has a short range of choices (which I think is usually a good indicator of quality). I had ray wings, which was a first for me, and they were beautiful. My wife had the vegetarian option and my daughter and her partner had the pork. All (extremely) good. Top notch puds, top notch wines, top notch service and it is simply a very nice place to eat. We had a couple of drinks downstairs in the pub first, which was really buzzing. The restaurant is fairly small, so make sure you book ahead - it's worth it.", "date_of_review": "19 June 2016"}
{"review_id": 251, "restaurant_id": -11, "username": "Annabel M", "date_of_visit": " July 2016", "rating": "3", "title": "Expensive beer, kitchen closed, no smoking", "comment": "This pub is gorgeous to look at, great decor with lots of plants, as well as interesting windows and lights. The beer was expensive downstairs... £12 for two pints - umm .... It's just beer. The food I'm sure is also amazing, though we didn't get that far because the kitchen closes at 6 ... The rooftop is gorgeous, although you have to put your name on a list as it has a tendency to \"fill up\" - that said, after we had waited and enjoyed a delicious but superoverpriced beer we went upstairs only to realise there were many tables free and they still weren't letting people up. Also note you cannot smoke upstairs on the roof which was a bummer.  But hey if you have a taste for the finer things this might be your perfect local. ", "date_of_review": "11 July 2016"}
{"review_id": 252, "restaurant_id": -11, "username": "nakiboys", "date_of_visit": " July 2016", "rating": "5", "title": "Wonderful fusion of flavours", "comment": "This was a restaurant above a pub I found in the Guardian newspaper review. The place was noisy and jam packed but the restaurant an oasis of calm. The service was impeccable and the menu imaginative. Would highly recommend a visit here. Close to Spitalfields market. Reservations a must for this popular restaurant.", "date_of_review": "25 July 2016"}
{"review_id": 253, "restaurant_id": -11, "username": "ElenaDemetriou", "date_of_visit": " June 2016", "rating": "5", "title": "Great place & delicious food!", "comment": "Three of us went there on a Friday evening, had some drinks at the ground floor bar and then moved up to the first floor for dinner. The atmosphere at the bar downstairs is great, buzzing but not too loud so we have a conversation without having to shout. The food upstairs was very tasty and we got served this lovely, fresh bread and butter that both felt homemade. We had an excellent bottle of wine to go with our food. The service was very good and the staff friendly. Will definitely return.", "date_of_review": "20 June 2016"}
{"review_id": 254, "restaurant_id": -11, "username": "normant645", "date_of_visit": " June 2016", "rating": "5", "title": "Beyond expectations", "comment": "We discovered this little gem while following Ottolengi on Instagram where he recommended it. As you can imagine we set off for lunch with high expectations. We were not disappointed.  The food, all natural with plenty of ingredients from the roof top garden, was innovative and absolutely delicious. The combinations of flavours, colours and textures were a sheer delight to all the senses especially the taste buds.  The service was also outstanding. Energetic people with a clear passion for food. They we very friendly, efficient and knowledgeable about the food. This enhanced the whole experience from the moment we entered the door.  The venue is interesting combining the best of an old pub with the latest trends in contemporary dining trends.  The selection of natural wines and beer and the way they were presented rounded of the whole experience of the most delightful Sunday lunch. ", "date_of_review": "27 June 2016"}
{"review_id": 255, "restaurant_id": -11, "username": "hewylewydewy", "date_of_visit": " July 2016", "rating": "5", "title": "Perfect location for a lazy summer lunch", "comment": "Great food, great service and an eye for detail severely lacking in most city establishments. Started with the steak tartare as recommended by my host and although I have always believed I wouldn't like it, it was an absolute dream! The staff were friendly, knowledgeable about the menu and the wines on offer, and extremely professional. Let's hope more of our forgotten drinking establishments receive a similar makeover.", "date_of_review": "1 July 2016"}
{"review_id": 256, "restaurant_id": -11, "username": "LAG2378", "date_of_visit": " June 2016", "rating": "4", "title": "Good Food but Stingy on the Roast", "comment": "There were four of us that went for Sunday roast. While the food was very tasty they brought it all out on a sharing plate which was annoying, but that is just a personal preference. They also didn't bring near enough of the actual veggies etc for the roast. They brought 3 roast potatoes for four people to share, not even close to enough veg for all of us. We had to ask for more potatoes and veg. I just think it's a lack of common sense that if there are four people each person should at least get their own potato. Not sure I would go back because I just didn't like how they presented it all but the food was good, can't fault them on that!", "date_of_review": "30 June 2016"}
{"review_id": 257, "restaurant_id": -11, "username": "CJLJa", "date_of_visit": " June 2016", "rating": "1", "title": "How do you mess up a full English breakfast?", "comment": "The staff, service and decor are all fabulous, it's just a shame the food is disgusting. I had the full English breakfast. The bacon looked anaemic and was more fat that meat. The sausage was pink and so overly flavoured it was horrible. The mushrooms were *so* salty my throat hurt after eating them. The toast was more like French toast - completely dry and crumbly, and pretty useless for mopping up fried tomatoes and scrambled eggs (the only two things on my plate that were actually nice). Even the butter was overly salted. They need to scrap the entire dish and go back to the drawing board with new ingredients and new recipes. I don't like complaining, and I reiterate the staff were brilliant - it's an incredibly friendly and laid back place, but the food massively lets it down.", "date_of_review": "25 June 2016"}
{"review_id": 258, "restaurant_id": -11, "username": "Karen C", "date_of_visit": " June 2016", "rating": "5", "title": "Great bar with food", "comment": "I took my dad here for an early Fathers Day brunch. The staff were friendly and looked after me and my lovely old dad well.  We were in the ground floor bar which was lovely and light and airy due to the full length windows and high ceilings. There was a great ambience. It was pretty quiet when we were there so it was easy to chat - don't know how the acoustics would be on a busier time.  I would definately want to try out the first floor restaurant and the roof terrace at some point too. The brunch we had was great - tasty, nicely cooked and some rather delicious bread too. Next time it'll be the lunch or dinner menu and a cocktail or two!", "date_of_review": "28 June 2016"}
{"review_id": 259, "restaurant_id": -11, "username": "Lynsey M", "date_of_visit": " May 2016", "rating": "4", "title": "Good quality meal in comfortable setting", "comment": "This restaurant is a nice blend of fine dining in a pub setting. Mid-range prices with a good selection of french wines and a very knowledgeable waiter. We ordered the steak sharer meal, which had very impressive flavouring. Highly recommended.", "date_of_review": "10 July 2016"}
{"review_id": 260, "restaurant_id": -11, "username": "KevinCoaker", "date_of_visit": " June 2016", "rating": "5", "title": "9 hour lunch", "comment": "Fabulous E1 spot. Lovely summer lunch. Great that you get 3-4 options, and that they cook them perfectly. Plus loved the seafood bias, great service and quirky wine list.  Stayed on first in the rooftop garden - tranquil and cool. Then rest of the evening in the buzzing pub. A new favourite. ", "date_of_review": "18 June 2016"}
{"review_id": 261, "restaurant_id": -11, "username": "Spitalfielddiner", "date_of_visit": " May 2016", "rating": "4", "title": "Great for cocktails as well as beer...", "comment": "I live down the road from this place so have been visiting it since I moved in. Sometimes, I feel it such a shame to use a typical East End vibe to describe that place and in many ways this has it. But with a little more class hence the glowing review :) I like a nice boozer and this ticks the boxes but I love the quirks and charms of this place, the exposed walls, the distressed decor, the rustic charm and tid bits of the way they serve their bites and drinks. It actually makes the place 'sticky' in the sense that it's very comfortable. I prefer it when it's quieter than it's busy, but that's me being selfish as I quite like to have a drink here and work on Fridays just before the after work party arrives. A little off the beaten track, but only slightly and absolutely worth the effort to find!", "date_of_review": "24 May 2016"}
{"review_id": 262, "restaurant_id": -11, "username": "TwoSheds57", "date_of_visit": " July 2016", "rating": "4", "title": "Impressive", "comment": "Impressive gastro pub. The food is nicely done here. I had clams and mussels for a starter, and extremely tasty it was too. I had the Ray for main. Bit of a speculative choice on my part. It was ok but short of excellent. I wished I'd ordered the pork which looked very nice indeed (confirmed as excellent by my companions). The mess for dessert was lovely. I found the wine list short on new world options, but I would say that. Service was good. Very pleasant, although the food was a tad slow to come out. Prices were fine. All in all, we like it, most satisfactory.", "date_of_review": "9 July 2016"}
{"review_id": 263, "restaurant_id": -11, "username": "Mon59", "date_of_visit": " May 2016", "rating": "4", "title": "Modern twist on pub food", "comment": "Thoroughly enjoyed our Sunday Roast here. My daughter had the beef and I had the chicken. Well presented and tasty. A tad expensive. Do try if you are in the area. Well patronised place and in an interesting neighbourhood which all visitors to London should come to for a look-see.", "date_of_review": "28 May 2016"}
{"review_id": 264, "restaurant_id": -11, "username": "Sarah C", "date_of_visit": " May 2016", "rating": "5", "title": "In a league of its own", "comment": "We came here after checking in at the hotel down the road on Tuesday 24 May 2016 for some lunch and a drink (or 5). For a Tuesday this place had a great vibe. It definitely filled up with the after work crowd, and when we returned on Friday and Saturday night, it was equally busy. That being said, the bar staff are very attentive so you will not struggle to get to the bar and get a drink. This place could hold its own in Melbourne, Australia.  The Culpeper is four levels. The ground floor is a pub vibe with lots of natural light from the full length windows. On this level they serve a good but short selection of food (some of which is on the menu upstairs in the restaurant). From this menu, we had the gnocchi and the pork pie. Both will not disappoint and you will not walk away hungry or breaking the bank!  The first floor is the restaurant. It's limited seating, at least from where we could see, so I'd say bookings would be essential. The food was outstanding. They have a great selection of seafood and it has a great Italian flavor to it. We had the meat platter for starters and there was a special of whole sole for a main. We ended up skipping dessert as we were full. My partner is still raving about the meal!  The second floor has rooms you can book to stay in. And then there is the rooftop which has its own separate grill based menu. The views are amazing, but we didn't get a chance to eat here.  The staff were amazingly attentive, friendly, and were more than happy to tell us about the area and point us in the direction of the Spitalfields Markets, Brick lane.  In all honesty, if we had known about this place when we were booking a hotel, we'd have stayed here as the rooms look amazing and come with breakfast. Next time we venture from Australia to London we will definitely be staying at the Culpeper. ", "date_of_review": "30 May 2016"}
{"review_id": 265, "restaurant_id": -11, "username": "Helen5065", "date_of_visit": " May 2016", "rating": "5", "title": "Fantastic staff, good food, good atmosphere", "comment": "I wanted to thank the staff of The Culpeper for their excellent response to the disaster wreaked by the idiot next to me. We had just finished delicious starters (pork rillettes and cornichons, hummus salad and flatbreads) and were looking forward to our main courses, when a bloke wearing a backpack tried to sit at the table next to us. The spaces between tables is small, as in most London restaurants - unfortunately we didn't notice him until he had knocked both of our glasses of red wine and the rest of the bottle into my lap. His response was \"sorry\" and sat down fully intending to eat at the table next to me. He seemed to think it unreasonable of me not to want him to sit next to me and enjoy the meal he had prevented me from eating. It wasn't possible to stay - I was literally sitting in a whole bottle of red wine.  The staff were superb, calm, reassuring, brought me wet cloths and even wine stain remover to clean up (which had no chance of working given the amount spilt, but a thoughtful response).  What I hadn't realised until later as I went back to our hotel nearby and left my husband to pay was that they had waived our bill - not necessary, as it wasn't their fault, but a nice gesture.  And to the idiot who ruined both our evening and my clothes, if you must wear a back pack in London, even if you are one of those people who doesn't take them down in the tube, at least do so when you are squeezing into a restaurant table. And there are some \"mistakes\" as you called it, that \"sorry\" really isn't an adequate response for. ", "date_of_review": "31 May 2016"}
{"review_id": 266, "restaurant_id": -11, "username": "WinM21", "date_of_visit": " May 2016", "rating": "5", "title": "Dinner date with a friend", "comment": "Great catch up, buzzing atmosphere and attentive bar staff (even during peak time 5-8) followed by an amazing 3 corse meal upstairs. Very happy and will definitely be going again soon! Manager (Josh) was a supper friendly guy to talk to! Good man!!", "date_of_review": "24 May 2016"}
{"review_id": 267, "restaurant_id": -11, "username": "2020hall", "date_of_visit": " June 2016", "rating": "2", "title": "The culpepper ", "comment": "A very lively restaurant in a youthful area of London. Upstairs is quite nice but the decor needs an update. The food while pricey is average and the service was quite good. I had the fish and roast combination and it did not raise the bar for prices charged. I would probably not make this a choice spot on a return visit. I think the bar downstairs is a better choice for a drop in visit. ", "date_of_review": "1 June 2016"}
{"review_id": 268, "restaurant_id": -11, "username": "vinniechase2", "date_of_visit": " March 2016", "rating": "5", "title": "fun", "comment": "this bar is great! absolutely fun. The best restaurant/bar to go to when in the area by far. its fairly close to Aldgate East station and a reasonable walk to the city and brick lane. its in the city without really being IN the city, or not being too far out. I always got on well with the staff and quite enjoyed the friendliness of two of the bartenders, Timoté, the French bartender and Ruta the Lithuanian bartender. its always a pleasure to visit this place and i would 100% recommend it to anyone looking for good food and chilled drinks in the area. if you arrive in the area and are looking for good lunch or dinner with a great vibe and friendly service then i dont recommend looking further than the Culpeper.", "date_of_review": "1 June 2016"}
{"review_id": 269, "restaurant_id": -11, "username": "Monique N", "date_of_visit": " May 2016", "rating": "5", "title": "Wonderfully presented Sunday roast😆", "comment": "I've always wanted to visit The Culpeper and when I finally had the opportunity I wasn't disappointed. We had Sunday roasts both a sharing beef and a sharing pork. The presentation was impressive and really showed off britsh cuisine for our American guests we were taking round london. The quality was really good and so was flavour. If you do go on a Sunday don't pick something else on the menu because you will have food envy if you don't have a roast. Service was extremely good also. I'd definitely recommend as a dinner venue and i'm sure I'll go back as we were all very satisfied and smug after eating our dinners.", "date_of_review": "2 June 2016"}
{"review_id": 270, "restaurant_id": -11, "username": "MonicaR808", "date_of_visit": " May 2016", "rating": "5", "title": "Explosion of flavors", "comment": "We had dinner in the dining room (situated on the second floor). The first floor is reserved for tapas and drinks. The menu was small but adequate. Dishes were delicious and super tasteful. Service was impeccable. The price is on the higher side for the portion size. ", "date_of_review": "11 May 2016"}
{"review_id": 271, "restaurant_id": -11, "username": "kevklo", "date_of_visit": " May 2016", "rating": "5", "title": "Local beers", "comment": "Walked in here for a drink after a Sunday night dinner in the neighbourhood. We were impressed both by the looks and the space of the place (it was of course Sunday night, so not too busy). Also happy with the large amount of locally brewed beers we could choose from, in addition to draughts. The staff was very friendly. The food menu looked great too, although we obviously did not try it out.", "date_of_review": "16 May 2016"}
{"review_id": 272, "restaurant_id": -11, "username": "BenA704", "date_of_visit": " May 2016", "rating": "5", "title": "Something quite special", "comment": "Great food, great service, great vibe. 3 of us booked a table here last minute and ended up eating one of the best meals we've had in a gastro-pub. I'd call it more french bistro than pub. The sharing mains are awesome - we shared 750g of rump steak which was tender and perfectly cooked, which came with bbq'd cabbage, and potato fried blocks (see pic), gravy, mushroom and blue cheese. Absolutely delicious. Fantastic selection of craft beers, and great wine list (Ciu Ciu, £24) The front of house was great, and make sure you try the freshly baked gooey cookies at the end.", "date_of_review": "16 May 2016"}
{"review_id": 273, "restaurant_id": -11, "username": "T7133EXlaurens", "date_of_visit": " May 2016", "rating": "2", "title": "Disappointing", "comment": "We planned to come here for a Sunday roast and sit on the rooftop which we had heard about before. Unfortunately the rooftop has a different menu, more like a BBQ and you are not able to get a roast. This was fine though, we decided we would try it out up there anyway. We gave a phone number to the waitress who said she would text us when a table became available; that it would be up to an hour's wait.  Eventually over 80minutes later and starving we got a text message so headed back and up to the rooftop. We had to put together a table with the right amount of chairs for us ourselves which wouldn't normally be a problem but when you've already waited for so long you kind of expect them to have a table ready for you. We sat down and looked at the chalkboard menu next to our table. On the menu was about 4 different meats and then a vegetable section with choices of asparagus, potato salad, peppers, salads and then a choice of sauces too. The waiter came to take our order and pretty much everything we wanted, they had run out of. He said that we should be looking at the other menu at the other end of the roof because there was more available from that one. I normally expect to be told what is unavailable before it gets to the stage where you are ordering. In the end we all found some things to order.  In the meantime our drinks arrived and two of them were not what we had ordered. Then the food came. Between us, 4 of us had ordered the peppers. 4 halves of 2 peppers arrived with anchovies on them (this should said on the menu because one of our group was a vegetarian so then couldn't eat them). The waiter said that this plate was 2 portions. We waited another few minutes and then asked a different waiter if any more food was coming because we were still waiting for two peppers. He said he was sorry he had forgotten to tell us that they ran out of peppers halfway through cooking. My friend's sauce that she ordered also never turned up. I later went to use the toilet and there was no toilet rolls in any of the stalls (again this is not something that would normally bother me too much at all but alongside everything else it was just the icing on the cake)  The food that we had was tasty but portions were small and in my opinion not worth the price. We didn't pay our service charge and someone who I assume was a manager understood this and apologised but I don't think I will be heading back to the rooftop anytime soon.", "date_of_review": "17 May 2016"}
{"review_id": 274, "restaurant_id": -11, "username": "6Tara79", "date_of_visit": " May 2016", "rating": "1", "title": "Almost ruined our Saturday afternoon", "comment": "By one employee. We came to the pub after 12pm and unfortunately all tables on the roof bar were taken. The hostess that was in charge of the roof bar seating said she will take our phone number and gives us a call when there is a free table. We waited about 30 min in downstairs’ bar and then became suspicious because even people that came after us were called for a table at the roof bar. I went upstairs and asked the hostess what is happening. She said she sent us a text but we didn’t turn up. Of course she noted my phone number incorrectly so I asked her to update it (repeated it) and she said she will give us a priority now. I also asked her to come downstairs to give us a shout just in case a text doesn’t work again. There was no apology for taking the number wrong. Waited another 20 min and nothing. Went upstairs again, and hostess said that she sent us a text again (which neither of time I received). She then told me to go upstairs and check if any table is free which I did and luckily there was a table. Again, no apology whatsoever. Her attitude was almost like, oh well, it happened, so what. She also said she came downstairs to look for us which was a lie.  By the time we got to our lunch, they had only 2 main courses available out of 5. After we questioned the hostess what has happened the second time, she said she can’t see our details on the system anymore and can’t say what happened. Only at this point she said sorry which was in our opinion too late. We will definitely not be going back and we won’t recommend the place as she nearly spoiled our Saturday afternoon and it could have been so simple to resolve. The waiter at the roof bar was very good and attentive and the food was good as well.", "date_of_review": "16 May 2016"}
{"review_id": 275, "restaurant_id": -11, "username": "Kelly F", "date_of_visit": " May 2016", "rating": "1", "title": "Terrified experience, the worst food I have ever had in the world! definitely never go again!", "comment": "Terrified experience, the worst food I have ever had in the world! definitely never go again!  We waited for 2 hour for the roof top garden ,  I have ordered a bottle of cider , it comes with two glass of diluted cider with full of iced.  The food were the most terrified things  We ordered 3 main dishes, one lamp chop and one pork and one gilled fish - they were all come with really sightly cooked , extremely small portion in a big empty plate , no source , no veggi, no french fried , nothing . We were very dispointed as the food are completely different for the photos shown on the wedsite with fully dressing.  The fish smelled bad , all the living organs were still stuff inside the fish.  We have ordered a Cabbage, they gilled it badly which turned into black and hard and dry which cant even put into mouth! I would really not recommend anyone to go there and wont never come back again!", "date_of_review": "20 May 2016"}
{"review_id": 276, "restaurant_id": -11, "username": "fsae9", "date_of_visit": " May 2016", "rating": "4", "title": "Good value and convenient ", "comment": "This is a typical pub that one can find in London. I was able to secure a a room for the night. The room was quite nice and included breakfast in the morning. I also had dinner. Dinner had several dining options. The bar, a restaurant on the second floor or a rooftop restaurant that is only open in nice weather. Quite reasonable for London. All staff were friendly and helpful. ", "date_of_review": "21 May 2016"}
{"review_id": 277, "restaurant_id": -11, "username": "Julian P", "date_of_visit": " May 2016", "rating": "4", "title": "Great food on a rooftop terrace", "comment": "Although the menu was simple the food was really good and great value, probably the best asparagus I've ever had. Our visit was slightly spoiled by the receptionist who messed up (twice) getting us a table. Also, they'd run out of a lot of the menu early in the afternoon. Still, it was the first hot day so maybe they needed the practice. ", "date_of_review": "22 May 2016"}
{"review_id": 278, "restaurant_id": -11, "username": "982melissaj", "date_of_visit": " May 2016", "rating": "5", "title": "Delicious, charming", "comment": "My husband and I both loved this place, the food and the staff were wonderful! We had late reservations after a tour, and were originally confused when we entered and there were so many people in the main floor lounge area, and we didn't see a hostess or any signs to direct us, but we asked the bartender and were directed up the stairs to the restaurant area. It was quaint, adorable, and cozy. Prices were very reasonable, especially given the quality of food.", "date_of_review": "20 May 2016"}
{"review_id": 279, "restaurant_id": -11, "username": "BryanIce", "date_of_visit": " March 2016", "rating": "3", "title": "Nice twist on a pub lunch", "comment": "Great service from friendly, helpful and accommodating staff. (We were a big group with grandparents, babies and lots of friends and they didn't blink / falter once in the level of service they provided us with. Nice chilled out atmosphere too. The only negatives are that the portions are too small and the prices a little too steep.", "date_of_review": "19 March 2016"}
{"review_id": 280, "restaurant_id": -11, "username": "Jackie W", "date_of_visit": " April 2016", "rating": "4", "title": "Great Pub", "comment": "The pub has a lovely atmosphere and wide selection of ales, it does get very busy and noisy in an evening.", "date_of_review": "14 April 2016"}
{"review_id": 281, "restaurant_id": -11, "username": "Puttmans", "date_of_visit": " April 2016", "rating": "5", "title": "Cheeky", "comment": "A lunchtime visit...my second to the Culpepper and slightly more formal this time. The first time its was beers and light snacks, this time we sampled a fuller set from the menu. Bread served with Anchovy Butter...may sound hmmmm, but really really nice. I sampled a beef cheek pudding with cabbage...absolutely first class. My dining partner went for the pollack, chips and peas and was suitably impressed. A walnut brownie and ice cream was small in stature, but heavy in body...had to share it...as totally stuffed. Good range of beers...Harvey's was particularly tasty and well kept. Service was just right and cost likewise.", "date_of_review": "22 April 2016"}
{"review_id": 282, "restaurant_id": -11, "username": "philipclough", "date_of_visit": " March 2016", "rating": "5", "title": "Great food and attentive staff", "comment": "Whether you want a semi-formal dining area(on the first floor) or a relaxed lunch or even snack this is the perfect place. The staff are really friendly and attentive. They also know the menu fully. The food is excellent and you know it's fres and freshly prepared as they do not have a huge menu. They offer some superb wines at not over the top prices. I have visited 4 times over the last 4 weeks both evenings and lunchtimes and cannot fault the Culpeper.", "date_of_review": "11 April 2016"}
{"review_id": 283, "restaurant_id": -11, "username": "lukeicthomson", "date_of_visit": " April 2016", "rating": "5", "title": "Amazing rooms - don't go home, fall asleep in their new rooms!", "comment": "We stayed in their rooms recently (as their first ever guests), and it was awesome. Very cool rooms, with everything you need (comfy bed, great coffee machine, mini-stereo, huge shower), with great decor (we loved the light in our room!). It is a total joy to just go upstairs to bed after a wonderful dinner (the shared rump steak was immmmmense and perfect).  The breakfast was also great - home cured smoked salmon, loads of great coffee, croissants, fruit salad etc. And everyone is super friendly, and seemed happy to be there and to help. If you want a lazy weekend in London, you can't do much wrong by having dinner at Culpeper and then taking one of their rooms. Totally recommend this place. Thank you guys!", "date_of_review": "15 April 2016"}
{"review_id": 284, "restaurant_id": -11, "username": "Iain S", "date_of_visit": " March 2016", "rating": "4", "title": "Good Pub Good Food", "comment": "The Culpeper has a downstairs pub with a great atmosphere and a decent selection of malt whisky. It serves bar meals also. Upstairs is a very pleasant restaurant with helpful staff. The menu is limited but the quality of food is excellent. I would recommend the asparagus with duck egg and the hake.", "date_of_review": "1 April 2016"}
{"review_id": 285, "restaurant_id": -11, "username": "FoodieK1978", "date_of_visit": " April 2016", "rating": "4", "title": "Very good pub", "comment": "Very good pub, nicely decorated. They also have a restaurant and a roof terrace which we didn't try due to weather conditions. We tried some food at pub and the fries are to die for! A bit noisy but so is every pub. Well done!", "date_of_review": "23 April 2016"}
{"review_id": 286, "restaurant_id": -11, "username": "geeman42jones", "date_of_visit": " April 2016", "rating": "3", "title": "Disappointing!", "comment": "Our Sunday afternoon visit stated well as we were greeted by very friendly staff in a trendy looking pub/restaurant. The fairly basic menu and for me average food was a disappointment. ", "date_of_review": "24 April 2016"}
{"review_id": 287, "restaurant_id": -11, "username": "Emma h", "date_of_visit": " April 2016", "rating": "4", "title": "A lovely place for a quick drink after work", "comment": "Quite limited seating available and perhaps not the best use of space. Lovely drinks menu, friendly staff. we will certainly return for a quick drink after work but would struggle to base ourselves there for a few hours", "date_of_review": "26 April 2016"}
{"review_id": 288, "restaurant_id": -11, "username": "Harvey S", "date_of_visit": " May 2016", "rating": "5", "title": "Damn good", "comment": "Highly polished, well run, efficient bar in trendy part of London. Good beer, loved it. Staff impeccable, friendly atmosphere. Will return soon.", "date_of_review": "2 May 2016"}
{"review_id": 289, "restaurant_id": -11, "username": "HelandeH", "date_of_visit": " May 2016", "rating": "4", "title": "Friendly service", "comment": "Great little spot and very friendly and helpful staff. We made a small pit stop here during a Street Art walking tour in London and enjoyed brunch and a beer.  The menu was not extensive but had very interesting combinations and the staff were very friendly. These is lots of room in this pub and it has quirky features and fixtures with a roof garden. I'll be back.", "date_of_review": "22 May 2016"}
{"review_id": 290, "restaurant_id": -11, "username": "malvernian", "date_of_visit": " January 2016", "rating": "5", "title": "Felt like a local pub, despite its location", "comment": "Thoroughly enjoyed visiting this city pub. It had friendly and knowledgeable staff, good beer, and it generally felt like a local pub (despite the fact that it is clearly located in a business district). Couldn't really fault it. Would love to visit again, given the chance. That said, I'm glad I didn't eat dinner here - at first glance at least, the prices seemed quite steep.", "date_of_review": "2 February 2016"}
{"review_id": 291, "restaurant_id": -11, "username": "chantellew_13", "date_of_visit": " February 2016", "rating": "4", "title": "Great pub", "comment": "Had the most amazing beef pie and chips. The pie had loads of filling. Would highly recommend this pub. Service was pretty good, food is reasonably priced. Will definitely be returning. ", "date_of_review": "10 February 2016"}
{"review_id": 292, "restaurant_id": -11, "username": "Rivvel", "date_of_visit": " November 2015", "rating": "4", "title": "My favourite pub/bar so far!", "comment": "Been there many times with friends and few times with my girlfriend. Amazing, warm and stylish place, very good drinks and proffessional, helpful staff. Perfect place to come back to, surrounded with lovely, calming lights and general atmosphere. Particularly good for evening meetings. Recommended.", "date_of_review": "31 January 2016"}
{"review_id": 293, "restaurant_id": -11, "username": "paulspod", "date_of_visit": " January 2016", "rating": "4", "title": "Recommended", "comment": "Very nice pub/restaurant. Had a great Sunday lunch here (there aren't many places near here that do Sunday lunch, so you need to book in advance). Great beer choices too. They were very helpful and looked after our 88 year old father really well. Much appreciated. Recommended", "date_of_review": "31 January 2016"}
{"review_id": 294, "restaurant_id": -11, "username": "Arthur Z", "date_of_visit": " September 2015", "rating": "5", "title": "Impressive Pub", "comment": "This place looks great from the outside, even better once you are in but - even that - does not prepare you to such a delight. Food is impressive, the service is of a very high standard and particularly friendly. This is one of the very top pubs in London. ", "date_of_review": "17 February 2016"}
{"review_id": 295, "restaurant_id": -11, "username": "Houli2", "date_of_visit": " December 2015", "rating": "5", "title": "Great!", "comment": "We've been to Culpeper for meals a couple of times now and have never been disappointed. Fabulous food, wide variety of beer and wine - of which the staff are knowledgable. The staff are amazing, attentive, polite. Would recommend!", "date_of_review": "25 February 2016"}
{"review_id": 296, "restaurant_id": -11, "username": "Tom S", "date_of_visit": " February 2016", "rating": "5", "title": "Lovely, lively pub with great service.", "comment": "Great little pub with a lively atmosphere. What made our visit memorable however was the service we received.  The hallmark of great customer service is the swift correction of your mistakes. A simple hearing error on the part of the waiter when ordering our food (because the room was so loud and my friend is very softly spoken) resulted in us getting two portions of just chips rather than two portions of fish and chips . The staff quickly corrected the error, brought us a complementary starter and came to check everything was ok during the meal - over and above what you'd normally expect in a busy Saturday night pub.  The food was lovely too. Will definitely return ", "date_of_review": "21 February 2016"}
{"review_id": 297, "restaurant_id": -11, "username": "Mark S", "date_of_visit": " February 2016", "rating": "5", "title": "Excellent Quality Food & Atmosphere In A London Pub", "comment": "This place was recommended but I was sceptical that it could be as good as all that. It's a pub after all. But my scepticism was misplaced. Firstly the decor - from the moment we walked in we were impressed. A well judged and tasteful refurb' of what was once a grotty East End street corner boozer with sticky carpets. This place looks stunning but is still homely and is still very much a pub - albeit a top quality establishment. A look at the ales on offer had me smiling right off. The understated and professional manager (Josh) knows his beer. He helped me to choose a Purity Ales IPA which was superb and well kept. Later he filled me in on the brewer and on the history of the pub. It's run by deeply impressive people - not just a bunch of wealthy show-offs. Upstairs is a quality restaurant with a tempting fine dining menu. If the food is only as good as what they serve in the bar it will be great. Our BLT and fries provided us with a delicious and well presented lunch that stopped short of being pretentious. The olives were also excellent. This, for me, is how to run a gastro-pub. Keep the gastro bit upstairs or in the background and retain a real English pub atmosphere in the bar. Even my non-beer drinking wife agreed. We will be back.", "date_of_review": "26 February 2016"}
{"review_id": 298, "restaurant_id": -11, "username": "jpsaffon", "date_of_visit": " February 2016", "rating": "3", "title": "Bad bear... Tastes like flowers", "comment": "The place is nice, regular service but very bad bear, tried another one and its similar so I guess you get nothing better.", "date_of_review": "28 February 2016"}
{"review_id": 299, "restaurant_id": -11, "username": "bb20152016", "date_of_visit": " May 2016", "rating": "5", "title": "Lovely place", "comment": "Very lovely pub that serve great selection of comfortable dishes on the first floor. the bonus is the rooftop terrace when it is sunny. ", "date_of_review": "9 June 2016"}
{"review_id": 300, "restaurant_id": -11, "username": "hobbsy_t", "date_of_visit": " February 2016", "rating": "4", "title": "Great lunch for a special occasion", "comment": "Really enjoyed my trip here as a birthday treat for lunch three weeks ago. Great food and service, really pleasant staff and a relaxed atmosphere. Love the neighbourhood too. Highly recommended.", "date_of_review": "13 March 2016"}
{"review_id": 301, "restaurant_id": -11, "username": "60pennyc", "date_of_visit": " January 2016", "rating": "3", "title": "Great bar but need more bar staff on a Saturday night", "comment": "A great bar, lovely venue, nice atmosphere to meet up with friends. My only suggestion is to employ more bar staff on a Saturday night.", "date_of_review": "24 January 2016"}
{"review_id": 302, "restaurant_id": -11, "username": "briantM6752QD", "date_of_visit": " January 2016", "rating": "5", "title": "Saturday afternoon with Friends", "comment": "This is a great pub, it's been restored sensitively to retain its charm. I love this place, great atmosphere great friendly staff. Next time we will definitely eat, the menu looks great. Definitely need to book.", "date_of_review": "10 January 2016"}
{"review_id": 303, "restaurant_id": -11, "username": "DONNA F", "date_of_visit": " January 2016", "rating": "5", "title": "New Years Eve", "comment": "What a great night! The Culpeper dos it again and showcased another great friendly evening of fun and festivities. Great warm welcome always from the managers and the bar staff are always happy and great fun. The atmosphere was great and everyone had fun. The only downer was the disco not doing a countdown for midnight but that didn't stop us revellers doing it for them. The free glass of fizz went down very well too! Thank you so much for another amazing night. Worth every penny and more of the £15 ! ", "date_of_review": "2 January 2016"}
{"review_id": 304, "restaurant_id": -11, "username": "Andrea S", "date_of_visit": " January 2016", "rating": "5", "title": "Great in every way", "comment": "I've been here a few times now and felt compelled to write a review after my last visit. This is such a great pub, a real gem in the area. Good work on the hiring of very friendly, helpful staff - it makes such a difference. The food and atmosphere is great.", "date_of_review": "11 January 2016"}
{"review_id": 305, "restaurant_id": -11, "username": "sc7162015", "date_of_visit": " January 2016", "rating": "5", "title": "Great atmosphere and great Sunday Roast", "comment": "This pub has a great vibe, very lively but cosy. The décor is nice and they have a rooftop that grows vegetables, the view of the city isn't great but you can still see bits and pieces of all the tall buildings. I haven't had any of the other food but the Sunday Roast is divine. Great place to come with friends.", "date_of_review": "14 January 2016"}
{"review_id": 306, "restaurant_id": -11, "username": "thoughtfuldiner", "date_of_visit": " January 2016", "rating": "4", "title": "Heartty and good", "comment": "Not a cuisine for the faint-hearted, in terms of seasoning, condiments and general flavours. This is straight and muscular cuisine. But all was pleasant, cooked with dexterity and using good produce. The menu is short, clever and (for me) immensely appealing, with a section of plates for two to share. I was tempted by a starter of burrata with orange and Treviso radicchio but I went instead for duck hearts with Puy lentils. Lovely lentils, perfectly cooked, as was the meat. Very satisfying earthy dish. For main, I went vegetarian, with an interesting cauliflower based dish, slightly salty, but good. A pannacotta to finish was the star of the show: it was just perfect, wobbly and creamy and rightly sweet, the rhubarb and some shortbreads lovely accompaniments. This place reminds me of Brawn in terms of type and level of cuisine: if you like one you're likely to like the other. The room is large and cool. Service by our waitress was smiley, sweet and informed, and there was a similarly pleasant attitude by every other member of the team. Prices are right. A place to return to.", "date_of_review": "14 January 2016"}
{"review_id": 307, "restaurant_id": -11, "username": "jarmwr40", "date_of_visit": " September 2015", "rating": "4", "title": "neat stop for a beer.", "comment": "we had been wandering around the interesting and fun shoreditch area. stopped along the way for coffee and croissants. a take way samosa. chocolate. admired the street art. lovely sunny day! stopped here for a beer. filled up quickly for lunch after we arrived. great decor. fun to watch people go by. a popular spot!", "date_of_review": "15 November 2015"}
{"review_id": 308, "restaurant_id": -11, "username": "larag136", "date_of_visit": " November 2015", "rating": "5", "title": "Afternoon Lunch", "comment": "Was very impressed with the service and food here. My friend and I came in for a late lunch. We were greeted by very energetic staff, and were helpful in their food and drink choices. We both chose to have the special of the day which was a marmalade bacon sandwich with chips. So tasty. Will definently be back.", "date_of_review": "19 November 2015"}
{"review_id": 309, "restaurant_id": -11, "username": "choongsuyin", "date_of_visit": " November 2015", "rating": "4", "title": "Great place to hang out ", "comment": "Nice people, good selection of drinks, and a relaxed atmosphere on the weekend. Overall a great place to stop in for a drink or hang out for an evening... ", "date_of_review": "23 November 2015"}
{"review_id": 310, "restaurant_id": -11, "username": "mireilletoyn", "date_of_visit": " November 2015", "rating": "4", "title": "great atmosphere, good food and friendly staff", "comment": "Really great place - Lots of people there and good food. Ideal for a reunion with friends or business meeting.", "date_of_review": "25 November 2015"}
{"review_id": 311, "restaurant_id": -11, "username": "David A", "date_of_visit": " October 2015", "rating": "2", "title": "Right in your face bar staff.", "comment": "I had great expectations upon entering this pub /restaurant during a recent lunchtime break from work. As it was fairly empty apart from a few trendy bearded gents on their laptops I expected prompt service ,but the bar staff didn`t even let me settle before thrusting menus and wine lists under my nostrils. Not cheap for beverages and the toilets are a hike.Felt like I was climbing everest as I`d consumed a Brick Lane madras moments before. My old mate Stan Jacksonville certainly struggled with the stairs but then again he is 76. Strictly for those who are young and want to be seen.", "date_of_review": "24 November 2015"}
{"review_id": 312, "restaurant_id": -11, "username": "FabienRomero", "date_of_visit": " November 2015", "rating": "4", "title": "Cool Aldgate pub", "comment": "We just had a sunday roast at the Culpeper. We had a semi private area for the 12 of us. The pub interior is just great. The owners did a great job keeping the restored old bricks wall and brought a touch of modern shabby chic : candles on the walls, simple scandinavian looking wooden furniture, greenery hanging over the table... The pub is just 5 min walk from Aldgate station and was packed on a sunday afternoon. I really liked it and will go again !", "date_of_review": "30 November 2015"}
{"review_id": 313, "restaurant_id": -11, "username": "Andreannacoley", "date_of_visit": " November 2015", "rating": "5", "title": "Sunday roast ", "comment": "Two friends had a fabulous Sunday roast lunch at the Culpeper. Not only are the staff so welcoming and helpful but the food is awesome. They have a rotating menu that changes week to week, as you can see we were on chicken week!  I especially loved the honey glazed carrots :) if you are looking at going to this restaurant make sure you book in advance as this is fully booked out each Sunday! ", "date_of_review": "29 November 2015"}
{"review_id": 314, "restaurant_id": -11, "username": "Jessica25852", "date_of_visit": " November 2015", "rating": "4", "title": "Brilliant Birthday dinner for a large group!", "comment": "I booked The Culpeper for my boyfriends 30th birthday, there were 16 of us having a three course dinner on a Saturday night. The food & wine were great, and the staff were really friendly and helpful (also when I made the enquiries and booked it).  We stayed and had drinks in the bar downstairs afterwards. It's an impressive looking building too, great for special occasion.", "date_of_review": "12 January 2016"}
{"review_id": 315, "restaurant_id": -11, "username": "stevetP5862WT", "date_of_visit": " December 2015", "rating": "4", "title": "It could be excellent... let's see next time...", "comment": "This is an old East London 'boozer' that's shifted with the times. Right on our doorstep and we've walked past it a few thousand times. Right next to Smithfield market. But it got a good review in The Times. Being pre-Christmas, we couldn't get a booking in the small restaurant on the first floor. So we went along 'on spec' and ate in the Bar. Table service was great. But the bar menu is a bit random and there was really only one 'proper' full meal but as it was battered cod and chips, we were more than happy. The rest of the items were really only bar snacks although you could make your own Culpeper version of Tapas I guess. Will try the restaurant next time and hopefully send out an Excellent review. Quite a few of the clientèle managed to occupy Bar and table space all evening on just one drink but maybe the management is happy with that. Perhaps serving drinks at the table might improve takings?", "date_of_review": "17 December 2015"}
{"review_id": 316, "restaurant_id": -11, "username": "Terelli81", "date_of_visit": " December 2015", "rating": "4", "title": "Really nice refurbed old fashioned pub", "comment": "I haven't eaten here but drank on a few occasions. It's a proper old pub that has been restored lovingly and tastefully. A very good selection of real ales on offer along with a decent wine list. It's not a cheap pint but it is a lovely venue. It also gets heaving with people so get there early Monday to Friday to nab a table or the after work crowd will beat you to it.", "date_of_review": "30 December 2015"}
{"review_id": 317, "restaurant_id": -11, "username": "SimeoneSergio", "date_of_visit": " January 2016", "rating": "4", "title": "Fantastic Pub & Restaurant", "comment": "The kind of people you might meet here is a mix of people that usually work in Shoreditch and Bank... All in their 30s and some 40s. In short words: the kind of people i like to be surrounded when i'm at a Pub. The noise level ever went too high, interior is very modern but not gorgeous: it's somehow minimalistic, but i really liked it. Selection of beer is \"ok\", but i was really attracted by the wine one: that is really good! After a quick drink we went upstairs at the restaurant: you'd better book as they don't have many tables and it appears to be always full, also during weekdays (and it was on a thursday evening). I'm not surprised: food here is awesome! And the service is courteous, extremely courteous. I'd really recommend to try the \"Burrata\" as starter. Seems like their chef mixes tastes and ingredients from everywhere in the world (they also have some \"Lardo di Colonnata\", a rare italian salumi) in quite a delicious way. It's not extremely cheap but you can't pretend their service and the best ingredients to come at a bargain price, honestly. I think i the value for money is good. Last but not least: they are open until late. I'll surely be back to try their sunday roast that i've heard is absolutely delicious.", "date_of_review": "16 January 2016"}
{"review_id": 318, "restaurant_id": -11, "username": "badm00nr", "date_of_visit": " September 2015", "rating": "4", "title": "A bar with something about it....", "comment": "I stopped off here after some food and I'm glad I did. It had a lovely bustling vibe about it, lots of different kinds of people of all shapes and sizes.  An ok beer selection and really friendly staff. Worth a punt* *or Pint ;-) ", "date_of_review": "16 September 2015"}
{"review_id": 319, "restaurant_id": -11, "username": "R4713ABdavidb", "date_of_visit": " December 2015", "rating": "5", "title": "Straight up flavour, like 'Terroirs'", "comment": "Victorian corner-turning pub - loads of glass - converted to roomy restaurant. For a restaurant atmosphere with attentive waiters go upstairs, for a bar with canteen tables go down. Dishes are mostly a novel or classic mix of 3 to 4 things on a plate, so amazingly tender moist lamb shoulder with beetroot and leaves and capers, or perfect veg with marvellous cheese and great oil. For the first time in a year I went for a vegetarian main, so clearly one for the carnevales. Knowledgeable waiters introduce you to the wines, many of which you won't have seen (often). 10 years ago the guy in the kitchen ran THE cult restaurant in London, Terroirs. This follows on nicely. ", "date_of_review": "28 December 2015"}
{"review_id": 320, "restaurant_id": -11, "username": "Review111977", "date_of_visit": " January 2016", "rating": "5", "title": "Great pub/bar attentive staff, good choices", "comment": "I went here with a girlfriend. We came here previous for a nice Sunday Roast in the pub. They have a restaurant aswell with a different menu. We came for Saturday lunch, it wasn't too busy, it has a nice feel to it, high ceilings, good spec, clean and a nice clientele. We had a very tasty bread & butter, black pudding, pork pie & relish, and soup. Reasonable price and great staff!", "date_of_review": "17 January 2016"}
{"review_id": 321, "restaurant_id": -11, "username": "Barbie21144", "date_of_visit": " September 2015", "rating": "3", "title": "Don't go here if you expect pub food", "comment": "We went there hoping for an upscale (or gastropub) experience. On a Friday, the downstairs was packed with people drinking, but apparently no food was being served there. The restaurant upstairs had a very, very limited menu, and though we are foodies, we weren't thrilled with the choices. The food was excellent, but the choices so limited that I would return. The cocktails (particularly the Culpeper 75) were excellent. ", "date_of_review": "23 September 2015"}
{"review_id": 322, "restaurant_id": -11, "username": "Gieusahaggis", "date_of_visit": " September 2015", "rating": "3", "title": "I'm too sexy for my food, too sexy for my food....", "comment": "Very cool gastro-pub full of mainly bright young 30-somethings. Food was very good but menu is limited for the non-adventurous. Whatever happened to high quality ingredients being prepared in a simple way? Have we become so bored that we now have to push the envelope in every direction of experimentation and mingling of flavours? Personally I could do without sardines in my butter, for example. Service was excellent and the wine was good and reasonably priced. But if you are a fussy eater, you might want to check the menu before you book. ", "date_of_review": "18 September 2015"}
{"review_id": 323, "restaurant_id": -11, "username": "Suzywuzy22", "date_of_visit": " September 2015", "rating": "3", "title": "Lovely chips!", "comment": "Dropped in here on Friday afternoon last for bit of lunch with my boyfriend - we were just after checking into ibis hotel up the street! Had a cheddar cheese and pickle sandwich with chips. Toppings on sandwich was a bit scarce but the chips were lovely! Boyfriend found it hard to pick anything from the small and random menu but eventually chanced some sort of pudding balls with chips. Service was good and friendly but can't say I'd be rushing back for food! Nice place for a chill out drink though!!!", "date_of_review": "28 September 2015"}
{"review_id": 324, "restaurant_id": -11, "username": "ddiddo", "date_of_visit": " October 2015", "rating": "4", "title": "Trendy British Pub", "comment": "This is a pub done right. Nice decor, good food including healthy options - was looking for a light snack, and their artichokes hit the spot just right! Was there on a Thursday evening and it was packed - nice place if you're in the neighborhood.", "date_of_review": "2 October 2015"}
{"review_id": 325, "restaurant_id": -11, "username": "trinhyv", "date_of_visit": " January 2016", "rating": "5", "title": "Lunch stop", "comment": "We stopped here randomly to find some tasty food and were initially unsure about the menu items. Luckily, the waiter was very helpful and recommended some dishes. We opted for the pig's head, soup and crab toast. They were all amazingly delicious. We were blown away by the flavours. Coffee was great here too and the anchovies butter with the bread... Another great surprise!", "date_of_review": "16 January 2016"}
{"review_id": 326, "restaurant_id": -11, "username": "Christina R", "date_of_visit": " August 2015", "rating": "5", "title": "Immense", "comment": "So damn good I can barely stand it. Really excellent food and professional friendly service. Also nice selection of beers and pleasant interior. On the pricey side so probably one for a special occasion ", "date_of_review": "23 August 2015"}
{"review_id": 327, "restaurant_id": -11, "username": "frogimo", "date_of_visit": " August 2015", "rating": "5", "title": "Love this pub", "comment": "Lovely staff, lovely food, great roof terrace (although it is a shame that we can't smoke up there). The Culpepper definitely ranks amongst my favourite pubs in London", "date_of_review": "14 August 2015"}
{"review_id": 328, "restaurant_id": -11, "username": "Hclapham123", "date_of_visit": " August 2015", "rating": "2", "title": "Disappointing for vegetarians ", "comment": "The Sunday roast looked fantastic but there was a really poor selection for vegetarians which was surprising given their \"grow you own\" ethos. I had a vegetarian tart which has great ingredients but was just boring and overpriced. The drinks and bar staff were excellent though, and the service was brilliant (v attentive waiters). The roof garden gets very booked up and there is no communication between staff on different floors. We waited nearly two hours for a table upstairs, only to be told on arrival of the garden that there wasn't space (they put you in a virtual queue and text when to come up). After a bit of arguing with a slightly rude member of staff, they let us upstairs. There were at least 4 free tables, but we were told there was wasn't any space. Quite frustrating but the service when we finally got upstairs was excellent- just a shame the experience was so complicated at times. We were happy to wait for a table but it's annoying to get there, be spoken to rudely and discover there were so many tables available!", "date_of_review": "9 August 2015"}
{"review_id": 329, "restaurant_id": -11, "username": "gavinmaze1", "date_of_visit": " August 2015", "rating": "4", "title": "Disappointment turned to delight!", "comment": "I'd be tempted to start off the review by saying avoid going on a Sunday whilst they're serving roasts. Better communication and clarity on their cluttered website would indicate that the roast isn't served all day and that if you come closer to 6 (when they stop serving the roast) then your options are likely to be limited if a roast is what you had your heart set on.  Sadly this happened to our party of four when we turned up and were told only one choice of roast was available. I think they could see that we were quite annoyed at this as our waitress had summoned the manager who took the blame for the poor communication and then went out of his way to accommodate is food wise.  I must say that despite the food being decent, our visit was made by our amazing waitress Nadia, who kept us laughing the whole way through and also showed off some of her wine knowledge letting us taste different ones until we found one we liked. We ended up having a good meal with a mish mash of different things from the roast menu and the rooftop menu all of which was very tasty.  I'd definitely visit again if I could make sure Nadia would be our waitress and I'll definitely be avoiding a Sunday next time! ", "date_of_review": "24 August 2015"}
{"review_id": 330, "restaurant_id": -11, "username": "TWP64", "date_of_visit": " August 2015", "rating": "4", "title": "So reliable", "comment": "This local is brilliant. We've ate on the recently opened roof terrace, and were in the ground floor bar for lunch last Sunday. Service is brilliant - nothing is a problem, they remember you from your last visit, and are completely attentive without hovering. It's clearly popular as there was a stream of people coming in the whole time we were there desperate for a table. The quality of the food is really high. I love the place.", "date_of_review": "25 August 2015"}
{"review_id": 331, "restaurant_id": -11, "username": "dvora77", "date_of_visit": " August 2015", "rating": "5", "title": "Quick beer on the way", "comment": "Great location, just beautiful inside, nice staff, unique interior. Relaxed people and atmosphere. We will come back!", "date_of_review": "29 August 2015"}
{"review_id": 332, "restaurant_id": -11, "username": "m0nikazet", "date_of_visit": " September 2015", "rating": "5", "title": "Absolutely amazing roof experience :)", "comment": "We went there just for a quick drink and bite, did not realised that there is a roof level too, luckily for us it was too busy downstairs we we kept walking up! Absolutely amazing to sit up there,quieter as no traffic, lovely view too! Friendly staff and great service! I already want to be back!!", "date_of_review": "10 September 2015"}
{"review_id": 333, "restaurant_id": -11, "username": "Shaytana968", "date_of_visit": " September 2015", "rating": "5", "title": "The best Monkfish Wellington i've ever had", "comment": "The food was astounding. Random concept, Monkfish Wellington, but it was GORGEOUS.....I'm so tempted to go back there for dinner again tonight. The staff were very attentive (but not over-bearing) and we had a fantastic evening. The gin cocktails are pretty good too! All in, well worth a visit - but then did I really say that? I need to be able to book in future so don't all book at once!", "date_of_review": "3 September 2015"}
{"review_id": 334, "restaurant_id": -11, "username": "ElaineHHiggins", "date_of_visit": " September 2015", "rating": "4", "title": "Last days of summer", "comment": "London is great in the sunshine Even better when atop a restaurant garden overlooking the Gherkin Yes a restaurant garden - in Commercial Street - wow I took friends one of which is a chef over from Oz to sit outside on probably one of the last days of this year that could be called summer We had the BBQ menu from the outside grill with salad freshly picked from behind our tables Wonderful  Even the unfiltered wine that once we'ed established was not frozen but lemon squash like when poured was the perfect accompaniment to the French chicken  This is a lovely place and all I hope is the refurbishment of the floors below remain as near to the state they are currently in so that for once the character of the venue matches the food and staff", "date_of_review": "12 September 2015"}
{"review_id": 335, "restaurant_id": -11, "username": "7wanders", "date_of_visit": " June 2015", "rating": "4", "title": "Bright and friendly", "comment": "Great bar. On the edge of the city and whitechapel, a great contemporary take on a traditional east London boozer. Busy and bright with decent selection of beers. They have a new roof terrace which I would have tried had I not been so knackered after pounding the streets looking for a decent pub not crammed with city types. Only downside is the staff like to let you know it's their pub by finishing off their conversations before serving you.", "date_of_review": "7 July 2015"}
{"review_id": 336, "restaurant_id": -11, "username": "Jannim1966", "date_of_visit": " September 2015", "rating": "4", "title": "Trendy", "comment": "Trendy young restaurant, nice interior and very friendly staff. Good quality of food, bit small portions and they might add some more vegetables as they use the roof garden as an attraction.", "date_of_review": "13 September 2015"}
{"review_id": 337, "restaurant_id": -11, "username": "Penny K", "date_of_visit": " July 2015", "rating": "3", "title": "Not half bad..... :-)", "comment": "My husband and I chose this on pure speculation and location. Our son and his girlfriend live 5mins away and it was a case of \"how about The Culpepper?\" to meet up with Fran after she finished work. None of us had been here before. The overall impression is Trendy. With a capital T. Exposed brick and plaster, exposed pipework, rough sterling board, old school chairs, mix and match furniture, etc. The typical pub tiles have been restored on the outside, which is a nice touch. Good choice of beers and wines. Friendly staff. Clean. The menu is small and we all chose the same of a tuna salad with some chips to share. We also had a meat plate and a cheesy-anchovy slice of bread. Reasonable value for London, but the area is becoming more popular and so prices are going up accordingly. Quite happy to drop in again - not only for a drink, but also to see if anyone handed my sunglasses in!!", "date_of_review": "8 July 2015"}
{"review_id": 338, "restaurant_id": -11, "username": "AliceShaw94", "date_of_visit": " July 2015", "rating": "4", "title": "Great atmosphere and roof terrace", "comment": "Came here with a friend as we'd heard about the roof terrace - would recommend booking as we had to wait over and hour to get up there. The view is good, but I haven't been to many terraces so can't compare too much! The terraces is nicely decorated and the grilled food is great - especially the peppers. A bit pricey, but you're on a roof terrace in central London!", "date_of_review": "9 July 2015"}
{"review_id": 339, "restaurant_id": -11, "username": "DONNA F", "date_of_visit": " July 2015", "rating": "4", "title": "The Roof Terrace", "comment": "The Culpepper doesn't cease to surprise on all levels. The roof terrace has only just opened and what a lovely little joyful place it is to relax. A few teething issues but nothing that can't be ironed out along the way. They managed to get us a nice table even though we hadn't booked and we ordered our food. It took a while to come but when it did the starters were worth it. Chunks of lovely sourdough with a rich garlicky tomato topping and some lovely green olives that were fragrant and rich. All washed down with an amazing Italian wine.  The mains came however didn't meet to my expectations. The corn fed chicken was a large portion but could have done with another 10 minutes I feel on the bbq and the potato salad whilst fresh was slightly undercooked also. The hero of the night was the roasted peppers and the sausage which was fab but the sausage was slightly cold.  All in all we still had a great time and enjoyed the experience and I am sure when we visit again the food will reflect The Culpepers other levels as I am sure it's just a few teething issues on the teams newness to this option of eating. But please do visit, it's well worth it. ", "date_of_review": "12 July 2015"}
{"review_id": 340, "restaurant_id": -11, "username": "RYK_67", "date_of_visit": " July 2015", "rating": "4", "title": "Very happy to have stumbled across this place.", "comment": "This saturday just gone, myself and a few friends were out and just happened to pass this place. I'm very happy with did. It's decked out really well, probably recently refurbished or something, the roof top bar was a lovely surprise and the bar staff were very friendly and willing to have a chat. If you are in the area, be sure to pop in. The only reason I wouldn't give it a full rating is the drinks were a little pricey.", "date_of_review": "15 July 2015"}
{"review_id": 341, "restaurant_id": -11, "username": "nicol_c45", "date_of_visit": " July 2015", "rating": "1", "title": "ridiculous Sunday Roast", "comment": "I went to this place with 14 friends,so we decided to order the prime rib of beef for 3\\4 people,we ordered 2 of those,the size was different,the reason of the difference they said was because on portion was for 3 end the other portion was for 4 but for the same price(75 pound) vegetables were very poor ( just potato and caponata) also it's the first time i see the Sunday roast served with Sicilian caponata!! I tried to order a starter but it arrived with main course, very poor service,12,5% SERVICE CHARGE ON TOP our bill is definitely money stealing to as ,IN THE END during the payment I asked to the waiter to show me the receipt just to check the amount already paid but the waitress said no you cannot check your balance so I spoke with manager which showed me the remaining balance to pay.We are totally unsatisfied of the service and the quality of food .We will never go back to this place.", "date_of_review": "19 July 2015"}
{"review_id": 342, "restaurant_id": -11, "username": "996juner", "date_of_visit": " July 2015", "rating": "5", "title": "Love The Culpeper", "comment": "What an amazing place. There is a pub on the ground floor selling pub food. A more luxurious restaurant on the first floor, where the menu changes weekly. Bedrooms on the third floor and a roof garden at the top. We went to the rooftop. There are fresh vegetables growing all around you. There is a bbq type grill and all the food is fresh. The staff were friendly and the service was good. A lovely atmosphere and delicious food at a reasonable price. What more could you want! ", "date_of_review": "21 July 2015"}
{"review_id": 343, "restaurant_id": -11, "username": "VATman", "date_of_visit": " April 2015", "rating": "5", "title": "Exceeding Expectations...", "comment": "Booked a table last Saturday night in the first floor \"Kitchen\" after reading various positive reviews. Was our first time here. We prefer more casual restaurants and loved this place. The French food was excellent - we shared mozzarella starter, monkfish wellington and Paris Brest dessert. The people there were attentive and genuinely passionate about their food. It shone through and made for a truly enjoyable evening.", "date_of_review": "28 April 2015"}
{"review_id": 344, "restaurant_id": -11, "username": "AlanLondon_UK", "date_of_visit": " May 2015", "rating": "5", "title": "Fantastic - go there!", "comment": "Came across this place by accident while staying in a nearby hotel. The first floor dining room is bright and welcoming and the fresh peach and basil Bellini went down well. Great bread with salty anchovy butter was served quickly. The menu changes every day. The snail, wild garlic and smoked bacon pastry was delicious. The roast lamb rump was outdone by its accompanying petit pois a la Francais - best I've ever had. The French waitress gently steered me towards a carafe of an obscure Organic red wine from Veneto - and I was so pleased she did, as it was superb. Highly recommended. ", "date_of_review": "14 May 2015"}
{"review_id": 345, "restaurant_id": -11, "username": "Smauraha", "date_of_visit": " May 2015", "rating": "5", "title": "Super food and grat atmosphere!", "comment": "Decor is amazing, restaurant food is great and really diverse bar is super cool and has a good atmosphere! Perfect for dinner and drinks!", "date_of_review": "8 May 2015"}
{"review_id": 346, "restaurant_id": -11, "username": "Clotilde L", "date_of_visit": " May 2015", "rating": "4", "title": "Great pub!", "comment": "Culpeper is a really nice place to hang out with friends! Great place and very friendly atmosphere. And the house wine is surprisingly very good. I only had snacks there, they were quite tasty.", "date_of_review": "8 May 2015"}
{"review_id": 347, "restaurant_id": -11, "username": "Nuala G", "date_of_visit": " May 2015", "rating": "1", "title": "Do not visit if you are hungry", "comment": "Very disappointed with the portions, considering the cost was so high (£16 for a TERRIBLE ROAST) you would think you wouldn't leave feeling hungry. But we did.  If you're looking for over priced bad food in a dreadful East london haunt, the do go but I'd recommend heading to leon for a salad & then any good boozers in the area (which there are plenty) and save yourself the bother!", "date_of_review": "4 June 2015"}
{"review_id": 348, "restaurant_id": -11, "username": "David-R-Blackburn", "date_of_visit": " May 2015", "rating": "4", "title": "Fantastic Friday afternoon long lunch!", "comment": "I've been to the Culpeper a few times now as it is a short walk from my office but this is the first time that I have been for lunch. I went with a big group of colleagues, about 10 of us, we had phoned and ordered ahead so that we could have a late lunch at 2.30 and the service and food were great. I already knew that it was a good space that had been lovingly restored in a distressed bare brick style but the food was a good surprise - freshly prepared, an interesting selection of dishes - I liked the pork pie, duck salad and the fish and chips - plus some awesome desserts: Eton Mess and the Panna Cotta are my top tips (the cookies that come with the Panna Cotta are incredible - I could have eaten just a plate of them!). Combine this with a good wine list meant that lunch finished at about 7.30pm - and I left some people still going!", "date_of_review": "30 May 2015"}
{"review_id": 349, "restaurant_id": -11, "username": "GoodHonestAdvice", "date_of_visit": " May 2015", "rating": "4", "title": "Trendy", "comment": "I use the term \"trendy\" in the good sense and in the bad sense. This place is at the extreme end of gastropubbery as the food is cleverly prepared, well presented and very tasty. The wine list is interesting (beware the cloudy, unfiltered \"Pinot Grigio\" that isn't really like the Pinot Grigio that ever other establishment serves) and the prices seem reasonable and the craft beers are \"on trend\" with some interesting flavours. The refurbishment is tasteful and the place has an open and airy feel and a pleasant buz and the staff were all friendly, efficient and clearly enjoying themselves. However... I do think they are just a little bit \"trendy\" (in the not-so-good sense) in that they seem to have lost sight of the fact that in order to survive they are going to have to give customers what they want rather than what they would like to serve. Offering Sunday lunch without a beef option (other than a £75 for 3-4 people) is probably not going to work in the long term in my opinion. So, this place deserves to succeed and I really hope they do as they are clearly passionate about what they do. We will try the more formal restaurant on the first floor some time an look forward to the roof terrace opening in June.", "date_of_review": "17 May 2015"}
{"review_id": 350, "restaurant_id": -11, "username": "Kers_soush", "date_of_visit": " June 2015", "rating": "5", "title": "Boozy lunch with the boss", "comment": "Ended up here as there were no pool tables available in the other pubs we visited. This doesn't have pool tables either but we'd given up by this time and decided to just have some drinks. We were served straight away and although we weren't eating, we were shown to a table in the dining area anyway. While there we decided to have some food and we both opted for the sandwich of the day - egg mayo, with chips. These arrived in good time and were just right - not too big and heavy and with proper chips, not fries. My white wine spritzers were lovely too! We're having a department lunch in a few weeks so I've booked the rooftop for this. I have clicked \"not good for families with children\" because I wouldn't want them in there. I don't actually know if they cater for families with children. I also don't know if it was good value for money because my boss paid!", "date_of_review": "19 June 2015"}
{"review_id": 351, "restaurant_id": -11, "username": "brussell1984", "date_of_visit": " July 2015", "rating": "4", "title": "Beef was sublime", "comment": "Went to the Culpeper last night with a group of work friends and had a really good time. The Beef with the sautee potatoes was absolutely amazing and great for sharing. Atmosphere was really nice and staff were very helpful. The only reason this is not a 5 is because had a bottle of Red there that didnt smell or taste very nice and it was recommended by the staff. Apart form that it was faultless, great night and would go again.", "date_of_review": "24 July 2015"}
{"review_id": 352, "restaurant_id": -11, "username": "RJK010", "date_of_visit": " June 2015", "rating": "4", "title": "Friendly Pub with a nice buzz", "comment": "Went here with my wife and son to kill an hour before moving on to a nearby restaurant. It was a Saturday night early so it was busy but not manic. Nice friendly staff and not over priced. First impressions were very positive and I will surely come back to eat as the menu looked very interesting and reasonably priced. I should add that the toilets which are upstairs are very clean and modern as this is often a fair indicator of how an establishment like this is run and maintained.", "date_of_review": "24 June 2015"}
{"review_id": 353, "restaurant_id": -11, "username": "Jenny P", "date_of_visit": " May 2015", "rating": "4", "title": "Lovely after curry couple of pints", "comment": "We went to the pub after a curry on brick lane. Totally hipster with the wooden chairs from school the distressed brick walls and cracked plaster. However the beer was great service good and good atmosphere will be back", "date_of_review": "17 May 2015"}
{"review_id": 354, "restaurant_id": -11, "username": "AnnMo83", "date_of_visit": " August 2015", "rating": "5", "title": "Amazing roof garden in the middle of London ", "comment": "We had a lovely time. Fresh menu with vegs straight from their garden, all cooked from the terrace. Excellent service. I highly recommend! ", "date_of_review": "2 August 2015"}
{"review_id": 355, "restaurant_id": -11, "username": "Neilkent100", "date_of_visit": " July 2015", "rating": "4", "title": "Friendly welcome", "comment": "Great for drinks. friendly staff. Though much inconstancy with the food menu, no-one sure what was available.", "date_of_review": "8 August 2015"}
{"review_id": 356, "restaurant_id": -11, "username": "elzeleanor", "date_of_visit": " March 2015", "rating": "3", "title": "disappointing", "comment": "We read the reviews on TA & Jay Rayner & chose to go for Sat lunch. Staff were very cheerful & accommodating but unfortunately disorganised. Food mix ups due to wrong table receiving wrong food resulted in half our party getting lunch way before before the rest of us so they had almost finished by the time we got ours. No apology offered. Menu very limited on Sat lunch with a choice of only 2 puds. Portions on the fish & chips were small. Lovely pub with good atmosphere but all in all disappointing.", "date_of_review": "31 March 2015"}
{"review_id": 357, "restaurant_id": -11, "username": "olivehoover", "date_of_visit": " March 2015", "rating": "3", "title": "Brilliant environment", "comment": "Culpeper has a nice atmosphere, good music and cute furniture.  I just took a glass of wine and the quality was pretty good. I will try asap their brunchs.", "date_of_review": "29 March 2015"}
{"review_id": 358, "restaurant_id": -11, "username": "eric w", "date_of_visit": " March 2015", "rating": "3", "title": "Slightly disappointing", "comment": "Having read a number of very positive reviews of this converted old east end pub I was keen to try the menu.I used this Pub in the 90,s when it had a thriving darts team so it was a pleasant surprise to see how tastefully the old interior had been changed.There are plenty of windows so people outside can see the mass of people inside enjoying themselves.We decided to have a bottle of wine downstairs before eating on the first floor.I was surprised to find a number of fruit flies trying to dive into my wine which really is a no no.We skipped starters and had a main and a dessert.The bread with Anchovy butter was lovely,crunchy and tangy.My piece of lamb was perfectly cooked and the broccoli with salsa verde was the star of the show.Beautifully cooked,crunchy with a great taste from the mint in the verde.However,the lamb was a small portion of a cheap cut and for the price of £15 I would have liked and expected a bit more on my plate.Perhaps I am out of sync with the modern trend? I chose the 3 pieces of cheese for my dessert and was very disappointed.The blue cheese was nice and creamy with a sharp taste but the others tasted as if they had been standing out for far too long as they were sweaty and a bit dry.The accompanying chutney was delicious.3 Small pieces of cheese for £10 is I think over priced.I had cheese at Iberica the other week which knocked spots off this.The sea bass at £20 looked good as did the rhubarb eaten by my friend who enjoyed both..The red wine at £20 a bottle,Gassac Rouge was good value.So overall I think the food is skillfully prepared,well presented in a pleasant setting but in my view over priced.", "date_of_review": "1 April 2015"}
{"review_id": 359, "restaurant_id": -11, "username": "LordH64", "date_of_visit": " March 2015", "rating": "3", "title": "Good pub grub at fine dining prices", "comment": "having tried this pub for drinking ( very good) we thought we would book for dinner. the reservations seem disorganised in that they say they are fully booked at times they are not and then take walk ins. service well meaning but amateurish. main course of monk fish Wellington for two was wonderful but the trendy purple potatoes unimaginatively boiled and very dry. several diners commented on the potatoes but staff didn't seem bothered. Competition is on the increase in this area and this place will need to up its game or revise prices if they are to attract repeat local business", "date_of_review": "1 April 2015"}
{"review_id": 360, "restaurant_id": -11, "username": "mengjiaow", "date_of_visit": " April 2015", "rating": "4", "title": "Tasty food", "comment": "I was impressed with the food at Culpeper. I had the Jacob's ladder as main and the rhubarb dessert. They were both delicious. The atmosphere in the restaurant is quite nice. It's a small, quiet area very different from the loud pub downstairs. The food is not cheap but I think it is definitely worth a try. I would visit again in the summer when the rooftop garden is open.", "date_of_review": "2 April 2015"}
{"review_id": 361, "restaurant_id": -11, "username": "JoolsG2008", "date_of_visit": " April 2015", "rating": "4", "title": "Pleasantly surprised", "comment": "Found this place while wandering about East London on a lovely sunny day. Outside, men in suits were quaffing their pints whilst inside is a large, impressive bar area with plenty of tables, most of them occupied. Luckily there was room at the stools looking out over Commercial Rd. Menus were brought swiftly by happy, smiley staff. Lunch menu small but that didn't bother us - don't like to have to wade through pages of dishes. Settled for some sharing plates; a very flavoursome portion of potted shrimps on toast, mussels and bacon in cider, marrowbones, a bowl of deliciously crunchy chips and some home made bread with anchovy butter. Glass of unfiltered white wine looked odd being so cloudy but looks were deceptive as it was very very good. My (adult) son had a beer from a pretty large selection. Looking forward to a return visit to have dinner in the upstairs dining room, probably in the summer when the roof garden is open. ", "date_of_review": "11 April 2015"}
{"review_id": 362, "restaurant_id": -11, "username": "Jon F", "date_of_visit": " April 2015", "rating": "5", "title": "A fabulous meal, beautifully served!", "comment": "This is beautifully renovated pub/ restaurant. Fantastic food, great service and relaxed ambiance - a delightful surprise - highly recommended!", "date_of_review": "11 April 2015"}
{"review_id": 363, "restaurant_id": -11, "username": "DONNA F", "date_of_visit": " December 2014", "rating": "5", "title": "Fabulous New Years Eve", "comment": "What a lovely friendly pub and had such a good New Years Eve ever. The duck meal was lovely and we would like to thank all the staff there that made our night so much fun. Great prices and a hidden gem in the depths of Commercial Road.", "date_of_review": "1 January 2015"}
{"review_id": 364, "restaurant_id": -11, "username": "emm686", "date_of_visit": " January 2015", "rating": "1", "title": "disappointingly no more than an average pub food", "comment": "it's better to only have 4 main course on offer and to do it well rather than a lot of choices and failing to deliver because of a complicated menu. Unfortunately, this pub does only 4 choices for main and does not even do it well. I had the Sunday roast pork and I did not enjoy it. The slices of roast pork were not cut properly, i ended up with pieces of fat and very little meat. The gravy had the consistency of water. I was offered the dessert menu but by the time I had finished my main, I had lost confidence in this business. I asked for the bill and got dessert somewhere else", "date_of_review": "25 January 2015"}
{"review_id": 365, "restaurant_id": -11, "username": "910leahm", "date_of_visit": " February 2015", "rating": "5", "title": "Best meal and service I've had in East London in a while...", "comment": "The staff are amazing - so helpful. We didn't have a booking and the restaurant was full. After a drink at the bar a table become available and we were given the table. Food was amazing. The homemade bread and anchovy butter is so so good! The cauliflour soup was amazing and should definately be tried! Best roast I've had in London. (Maybe joint with People on the Park Tavern, Victoria Park). The atmosphere is amazing. Perfect for date / chilling with friends and family. The desserts sounded incredible but I was too full for one. Nothing is too much for the staff... I like to ask lots of questions and they are passionate about food and drink so was never a problem :-) loveee love love thankssss", "date_of_review": "2 February 2015"}
{"review_id": 366, "restaurant_id": -11, "username": "Dinah S", "date_of_visit": " January 2015", "rating": "4", "title": "A great find.", "comment": "A good lunch today with friendly, efficient service. Risotto was excellent and a good choice on the menu. Good value.", "date_of_review": "23 January 2015"}
{"review_id": 367, "restaurant_id": -11, "username": "Pubgoer03", "date_of_visit": " March 2015", "rating": "4", "title": "Lovely service and tasty food.", "comment": "We booked a table at the Culpeper for lunch/brunch one Saturday afternoon and were really pleasantly suprised. The staff were lovely and looked after us really well - our server was particularly chatty and even knew the history behind the unique name of the place.  My only point would be the menu - it wasn't huge (which is fine) but because it wasn't specifically a lunch or brunch menu there wasnt a huge amount to choose from if you'd decided to have one of the others.  We were all after brunch food, which meant we had a lot less to choose from - so all ended up having a cooked breakfast (which wasn't really what everyone wanted).  However the food was of a great quality and cooked really well. And I know baked beans aren't exactly fancy, but they were missed from the breakfasts!  Oh also, the cocktails were incredible. The Florodora was just... amazing!", "date_of_review": "9 March 2015"}
{"review_id": 368, "restaurant_id": -11, "username": "HesterPlumridge", "date_of_visit": " January 2015", "rating": "5", "title": "Amazing food, great service, beautiful old boozer", "comment": "Thank you to all at the Culpeper - we had an amazing meal last night. The food is incredible, and great value for such well-thought out, well-cooked dishes. Can especially recommend the deep-fried pigs head and the lamb stew. Mmmmm. The staff are really friendly, the atmosphere is fantastic, and all in all a great place for a meal with good friends.", "date_of_review": "17 January 2015"}
{"review_id": 369, "restaurant_id": -11, "username": "Anniken F", "date_of_visit": " February 2015", "rating": "4", "title": "Very nice place and good beer", "comment": "verry nice place with. Boring beer on tap, but good microbrewed beer om bottles. Didn`t try the Food but it looked very nice", "date_of_review": "17 February 2015"}
{"review_id": 370, "restaurant_id": -11, "username": "Donna F", "date_of_visit": " March 2015", "rating": "5", "title": "Fabulous food and service", "comment": "We went back to the Culpeper to see the recent changes to the building and my what a change. Lovely restaurant area upstairs and a really great welcome from the team who recognized us from NYE. Now that's great customer service!  Our food was again fabulous and the waiter was brilliant. We didn't get his name but very talented with the choice of wine and very passionate. He recommended a great wine which was amazing and still makes my mouth water remembering it. Great find in a busy commercial road and worth every penny for two of us , a three course meal and a decent bottle of wine was just £120.  We would come back just for the great hospitality here but the food and wine is amazing too so win win for us! Thanks for a great night.", "date_of_review": "13 March 2015"}
{"review_id": 371, "restaurant_id": -11, "username": "emiravasi", "date_of_visit": " March 2015", "rating": "4", "title": "Really good Sunday roast in a bright and nice environment", "comment": "If you plan to spend your Sunday at Spitalfields Market, this is definitely a good spot for having lunch. The Sunday roast (constantly updated) is really tasty and well presented, especially the garnish. We appreciated the bright and open concept of this gastropub, we'll sure come back when visiting London.", "date_of_review": "14 March 2015"}
{"review_id": 372, "restaurant_id": -11, "username": "Abigail S", "date_of_visit": " March 2015", "rating": "3", "title": "Nice but not as nice as previously?", "comment": "A friend was keen to return as she'd loved it 6 months or so ago, however since then the drinks options have changed and we weren't that impressed by the sugary insipid grapefruit gin cocktail we had or the refusal of the waiter to create a requested drink off the menu despite all the ingredients being available at the bar. The food was nice but small portions so poor value. I like the decor and atmosphere but its a bit drafty and the disappointment on the food and drink front drove us elsewhere for the evening.", "date_of_review": "14 April 2015"}
{"review_id": 373, "restaurant_id": -11, "username": "Steven S", "date_of_visit": " March 2015", "rating": "4", "title": "now with a new restaurant", "comment": "Ate here just after they opened, now they have a restaurant on the first floor. The food is much better than anything I have previously eaten in a pub, and the quality of the cooking is up there with some of the best restaurants. Mains of monk fish and lamb were tasty and full of flavour. The jus served with the lamb was rich and meaty and the shrimp sauce with the monk fish was delicious. Desserts were divine. Menu changes daily, which is great. Will definitely be returning (oh and some excellent beers too", "date_of_review": "19 March 2015"}
{"review_id": 374, "restaurant_id": -11, "username": "CatherineB646", "date_of_visit": " November 2014", "rating": "5", "title": "Gorgeous roast dinner and pub", "comment": "We had a Sunday lunch there today and it was so tasty. We booked in advance and there weren't many unreserved tables left. It was £16 each which we thought was reasonable and it was well worth it. They are very generous portions and I couldn't decide what to leave when I was full as it was all so nice. The staff are fantastic and welcoming. The pub itself is very nice and clean. We can't wait to come again thank you ", "date_of_review": "9 November 2014"}
{"review_id": 375, "restaurant_id": -11, "username": "GeoffreyR300", "date_of_visit": " April 2015", "rating": "5", "title": "Best fish & chips ever", "comment": "Called in for lunch at 1.30 pm on a Thursday and it was very busy with lots of people eating and drinking. I ordered fish and chips at £11 which turned out to be the best I'd ever had. The chips were perfect and the fish really fresh. There was something in the mushy peas that made them very special. I followed the meal with a very nice latte, by which time the place had emptied out and was quiet and relaxing. There's obviously a lot of renovation working being carried out which gives the place a somewhat unfinished look, but if quality of food and service is what you're after, then you won't be disappointed. I'd really like to return one evening for a meal in the restaruant upstairs.", "date_of_review": "16 April 2015"}
{"review_id": 376, "restaurant_id": -11, "username": "queens2727", "date_of_visit": " October 2014", "rating": "5", "title": "fush and chups", "comment": "I had previously visited the same venue when it was previously the Princess Alice.....what an incredible transformation! Not only was I highly impressed with the décor and atmosphere but the cocktails, food and service were great as well. I am really surprised to read other reviews which were negative about the fish and chips. I ordered it and would put it down as one of the best I've had in recent memory! Overall I would highly recommend.", "date_of_review": "7 November 2014"}
{"review_id": 377, "restaurant_id": -11, "username": "sairrjane", "date_of_visit": " November 2014", "rating": "5", "title": "Best Roast I've had in London", "comment": "So I live in the area and read a few of the reviews of The Culpeper prior to visiting and was preparing myself for it to be average (previous reviewers had said it was bland, dry and portions were small for the price etc.) I would disagree 100%. We went there with a group of 8, they brought the roast out platter style which not only looked fantastic but made the whole experience a whole lot more fun. The portions were NOT small. We had at least a whole chicken left over after we'd all stuffed ourselves stupid. The food was fantastic. Absolutely fantastic. I've been underwhelmed by a lot of supposedly fantastic roasts in London and this was nothing short of exceptional. I didn't have one of the bloody marys but everyone on the table said they were great. No one spent over £25 (we were drinking also) either to those who said it wasn't good value for money - I disagree.  We had the table for well over two hours and weren't shuffled out by staff which is always refreshing for a Sunday roast in London. Would highly recommend you try The Culpeper on Sunday.", "date_of_review": "10 November 2014"}
{"review_id": 378, "restaurant_id": -11, "username": "jonaaa1", "date_of_visit": " November 2014", "rating": "5", "title": "Sunday roast", "comment": "Great venue Great food  AMAZING drinks and great staff! Thank you Antonio for taking me to your place,it was a pleasant surprise.", "date_of_review": "12 November 2014"}
{"review_id": 379, "restaurant_id": -11, "username": "fmj21", "date_of_visit": " November 2014", "rating": "4", "title": "Great Sunday lunch", "comment": "Went for Sunday lunch and was pleasantly surprised: lots of food and great flavour and very reasonable price. Nice atmosphere, not TOO trendy - look forward to the garden being open - maybe soon?", "date_of_review": "13 November 2014"}
{"review_id": 380, "restaurant_id": -11, "username": "Barbarapsantos", "date_of_visit": " November 2014", "rating": "5", "title": "Amazing sunday roast", "comment": "So I came to the culpeper last Sunday with a group of 5 friends for Sunday roast and I was really positively impressed. I had the braised lamb with old fashion traditional dumplings and it was just great, super tasty, juicy, real comfort food. My friends had the roast chicken, it was served in a huge platter, family stile enough to feed an army. By the end of the roast we were so stuffed we couldn't even try to eat dessert. Cocktails were absolutely fantastic. We asked the barman Max, to make us some digestive for after the meal and he presented us with the best negronis we ever had, simply AMAZING!  Over all it was a great experience, and we didn't even paid that much, total of 25£ per person, with at least 2 cocktails each!  Highly recommend! ", "date_of_review": "14 November 2014"}
{"review_id": 381, "restaurant_id": -11, "username": "Eastofend", "date_of_visit": " November 2014", "rating": "4", "title": "Great for a drink near spitalfields", "comment": "Went here after wandering around market - relaxed not too loud - nice beers and wine - didn't eat the food but it smelt good! Recommend ", "date_of_review": "16 November 2014"}
{"review_id": 382, "restaurant_id": -11, "username": "travellernick121", "date_of_visit": " November 2014", "rating": "4", "title": "Very good roast!", "comment": "Went here today for Sunday lunch - they select one type of meat for roast, so you don't know what you'll get until you go. When I saw it was chicken, I admit I was slightly disappointed but when it came, those doubts went. For starter we chose the pigs head croquettes (pictured) which came with a kohlrabi salad - these were very tasty. For main, we both selected the roast chicken which came with roast potatoes, glazed carrots, Yorkshire pudding, and red cabbage. A jug of chicken gravy and a pot of bread sauce accompanied it. Now, it sounds like a normal roast, but the quality here is key. Everything was very rich, tasty, and filling. We had a pint of Meantime Yakima each alongside, and were too full to contemplate dessert.  For a roast dinner it was one of the best I've had - but I'm sure you would get more inventive food if you decided to go on a weekday. Bill came to £27 each including tip, so not that bad at all.", "date_of_review": "30 November 2014"}
{"review_id": 383, "restaurant_id": -11, "username": "EmanuelaManu81", "date_of_visit": " November 2014", "rating": "4", "title": "Nice pub and good food", "comment": "I have spent a lovely night with a group of friends: noice athmosphere, good food and quite good choice of wines and cocktails. not the cheepest place in the area, but it worths a visit!", "date_of_review": "3 December 2014"}
{"review_id": 384, "restaurant_id": -11, "username": "ianianianiania", "date_of_visit": " April 2015", "rating": "3", "title": "Food average, prices not so", "comment": "Visited for roast. The beer and wine were very good but food not so. I would normally choose roast beef but the only beef on the menu was £75 for a joint to share between 3 or 4 - not an option when just with my vegetarian girlfriend, so had no choice but to have pork. Which is fine but would rather have some choice. Complimentary bread with anchovy butter was an excellent free appetiser. My girlfriend obviously ordered the vegetarian roast, which when came was not a roast at all. Instead, it was a plate of new potatoes and burnt kale. She enjoyed the new potatoes but it wasn't what she was hoping for. See @ellaflo_xo for 4 tweet rant. My roast pork was fine - meat tender, roast potatoes crispy, Yorkshire pudding homemade, cauliflower cheese creamy but portions small and no other veg.  Overall, it was an average meal for above average price. Nice decor in the pub and decent service but for the price I'd expect more. Won't be going back. ", "date_of_review": "19 April 2015"}
{"review_id": 385, "restaurant_id": -11, "username": "DavidL68", "date_of_visit": " September 2014", "rating": "4", "title": "City v Hipster", "comment": "Just on the fringes of the Eastern end of the City revamped pub showing good skiils in the kitchen. Pork Scratching popcorn is a winner. You don't need a beard to be welcomed, but it might help....", "date_of_review": "19 October 2014"}
{"review_id": 386, "restaurant_id": -11, "username": "Vacations161", "date_of_visit": " December 2014", "rating": "1", "title": "Rude staff who keep making you move tables", "comment": "After spending some time here we were moved from our table by rude staff who said it was reserved. Nobody came to the table, its just a ploy to make the bar area look busy. This bar had great promise, sadly the attitude of staff has ruined that, there are plenty of better pubs in the area", "date_of_review": "15 December 2014"}
{"review_id": 387, "restaurant_id": -11, "username": "lenie1969", "date_of_visit": " October 2014", "rating": "1", "title": "All looks but no substance with rude and poorly trained staff", "comment": "I booked a table at the Culpeper because of reviews online and because I needed somewhere close to home, it was for a birthday party. The menu just looked really unexciting and everyone on the table (5) ordered the same dish...the other dishes just didn't speak at all...so fish and chips it was...well and that was disappointing..it was like eating a bag of crisps...the fish was just not appetising and the portions were small, it was like the fish was battered yesterday and heated up in the microwave the service was sketchy, we stayed on for drinks and then one of the bar staff was just so rude (the baldy one)..the whole place just reeks of 'look how trendy we are'...I've lived in that area for over 10 years and seen all this happening time and time again, the decor looks amazing but the rest is just a damp squib...", "date_of_review": "26 October 2014"}
{"review_id": 388, "restaurant_id": -11, "username": "Cathy6604", "date_of_visit": " October 2014", "rating": "4", "title": "Nice trendy bar/restaurant", "comment": "Nice trendy bar/restaurant, have been a few times recently but only ever for drinks. Gets very busy (on a Friday evening any way). Haven't tried the food there yet but looks great.", "date_of_review": "19 October 2014"}
{"review_id": 389, "restaurant_id": -11, "username": "cooltravelling", "date_of_visit": " October 2014", "rating": "2", "title": "Average good, small portions", "comment": "Very disappointing. Bills itself as a gastropub but it's one of those gastropubs that charges restaurant prices for mediocre food and small portions... in other words, the worst kind of pub. Went for Sunday lunch and ordered a roast chicken because it's the only roast they have - they pride themselves in doing only one roast each Sunday. But when the single roast is mediocre, the concept is laughable. This roast dish consist of one small chicken leg, a bit of red cabbage, a small Yorkshire (best part of the dish) and a good portion of roast potatoes. A couple of big problems with this dish 1) the chicken portion is tiny and is dwarfed by everything else on the plate - when the dish is called \"roast chicken\", one expects there to be a fair bit of chicken! 2) the chicken is just ok. The skin is not crispy but rather just dry. The meat is fairly juicy but not juicy enough.  the roast potatoes are a bit dry - I've had far better at other pubs. The final disappointment of this dish is it cost £16. In order to get full, you have to order a starter and maybe a \"nibble\". Oh, and you can order a side of greens (where it is normally included in other Sunday lunches). We ordered \"pork popcorn\" and out came a measly portion of popcorn with a hint of pork scratching (needs more than a hint to make it worth the small portion that it is.- frankly, popcorn is not something to be measly about (it was less than a handful - and I have small hands).  An order of a \"large\" glass of wine is really a small in my book.  To sum up, when you are a pub serving Sunday lunch, you can't charge £16 for a plate of roast chicken that leaves diners hungry after consuming the whole plate. That's just a crime.", "date_of_review": "19 October 2014"}
{"review_id": 390, "restaurant_id": -11, "username": "angelikip", "date_of_visit": " October 2014", "rating": "4", "title": "Cool place!", "comment": "I enjoyed a lot my drinks and the brownie with salted caramel!! I liked a lot the atmosphere, the decoration and the location! For dessert and drinks highly recommended. Haven't tried rest of the menu.", "date_of_review": "22 October 2014"}
{"review_id": 391, "restaurant_id": -11, "username": "Sam M", "date_of_visit": " October 2014", "rating": "2", "title": "Good roast, shame about the inconsistent serving size.", "comment": "We ate there this afternoon having heard quite good things on this site.  The starters were quite tasty, but simple and small. Our pork roast (they currently rotate the meats from week to week) meal was also quite tasty, however both my girlfriend and I both remarked that it was a bit too small (mainly the pork) and was seriously lacking some veg servings (veg was red cabbage and potatoes only, surely veg is the cheapest part of the meal - and what is a roast without some veg options?)... We assumed this was how they come, and as we aren't in the habit of complaining unless it's something more pressing we didn't let it bother us.  However, I was soon displeased when the table next to us had their pork roasts brought to them, containing noticeably larger portions of pork, and with each an additional extra-large potato. At the risk of sounding like a potato-counter, their meal was perhaps a third bigger than ours. A sunday pork-roast is my favourite meal of the week, so I was not impressed...However I didn't find an appropriate time or way to mention it without causing a scene (or coming across as a moany git). On this experience I probably won't go there again, which is a shame as the service was fair and the decor is quite interesting.", "date_of_review": "26 October 2014"}
{"review_id": 392, "restaurant_id": -11, "username": "Irene R", "date_of_visit": " October 2014", "rating": "4", "title": "lovely lunch!", "comment": "I had lunch with my son here on 29th October. We both had fish and chips with squashed peas and rye bread with anchovy butter. The meal was lovely and cooked to perfection,I was a little sceptical about the anchovy butter,but it really complimented the rye bread. The waiter was very welcoming and I felt really comfortable. I would definitely dine here again when I visit my son again in London! Incidentally, my son dines here regularly and says the Sunday Lunch is superb!!!", "date_of_review": "2 November 2014"}
{"review_id": 393, "restaurant_id": -11, "username": "673bw", "date_of_visit": " November 2014", "rating": "4", "title": "Great sunday roast", "comment": "The place is airy and the staff is really friendly, you do like the wine list. The sunday roast is great, but some of starters have too much going on the plate, overall you should really go there, maybe try the duck", "date_of_review": "4 November 2014"}
{"review_id": 394, "restaurant_id": -11, "username": "AVS2305", "date_of_visit": " October 2014", "rating": "4", "title": "Local pub with a difference", "comment": "A great atmosphere, friendly & accommodating staff, fantastic and original cocktail menu full of interesting drinks and some great twists on the classics. The food and service are great too. Love the décor (big windows, plants everywhere, exposed brick, interesting without being pretentious). Good place to meet friends & catch up over a local beer or a refreshingly unusual cocktail.", "date_of_review": "5 November 2014"}
{"review_id": 395, "restaurant_id": -11, "username": "asquill", "date_of_visit": " October 2014", "rating": "4", "title": "City Vibes", "comment": "Conversion ongoing in this huge old house in the City, a bit weird and wonderful [used to be a brothel!] must go up on the roof to see the view. Inside busy, buzzing and mixtures of different food e.g. [popcorn with pork scratchings]. Service friendly and helpful but a bit overwhelmed? Good beer & wine selections. Go, I feel sure this place will become really hot!", "date_of_review": "10 October 2014"}
{"review_id": 396, "restaurant_id": -11, "username": "DRG45", "date_of_visit": " August 2014", "rating": "4", "title": "Uber cool spot", "comment": "Noticed that this pub, which has also been a brothel and darts room evidently, had re-opened about 3 months ago and tried it out at breakfast, which is all very laid-back and friendly. Loved the roof-top herb garden which supplied the ingredients for the top notch food and where you can have picnics, complete with blankets after the sun goes down behind The Gherkin. Excellent roasts on Sunday with yummy yorkshire puddings. Great interior and although light and airy it does give some of the history a chance to shine through - you can book tables for groups. I understand that there is a restaurant opening soon on the first floor, so a return visit needs to be made for sure.", "date_of_review": "18 August 2014"}
{"review_id": 397, "restaurant_id": -11, "username": "4871lucy", "date_of_visit": " October 2014", "rating": "5", "title": "Amazing food and in relaxed setting with really great staff", "comment": "We ate at The Culpeper on a Wednesday night for dinner. The location is ideal and the interior of the restaurant is incredible, it has a really nice layed back atmosphere even though they were packed with customers. The layout means that you can come in just for a drink, or for a meal, and both drinks and food menus are amazing. The drinks menu is really different with lots of delicious cocktails with herbs and the food was genuinley amazing!  We eat out quite alot in London and like really good food but hate stuffy atmospheres - so this place was perfect. To nibble on at first we had the Porkcorn (marriage made in heaven of pork scratchings blended and mixed in with salt popcorn) and then to start I had a really fresh but flavoursome poached troat and beetroot salad. For main I had the pork which I would not normally choose in a restaurant but I knew it was going to be perfectly cooked. It was really delicious and the portions sizes were generous but not overwhelmingly so - totally ideal. Service was great, the staff were really friendly and laid back and we will definitely be returning. One of the best places in London which I have eaten at.", "date_of_review": "30 October 2014"}
{"review_id": 398, "restaurant_id": -11, "username": "100_Kay_100", "date_of_visit": " August 2014", "rating": "5", "title": "A lot of character", "comment": "Staff is extremly helpful and flexible, managed to accomodate us on the fantastic roof top although we did not book in advance.  Food is presented in a very nice way and tastes really delicious. Roof top is also the kitchen's herbal garden which gives everything a nice touch.", "date_of_review": "21 August 2014"}
{"review_id": 399, "restaurant_id": -11, "username": "HughH985", "date_of_visit": " August 2014", "rating": "4", "title": "Great Pub/Restaurant", "comment": "Only opened in the last year, this place has a great range of real beers and serves delicious and reasonably priced food. The setting is really pleasant and the staff service is first class.", "date_of_review": "2 September 2014"}
{"review_id": 400, "restaurant_id": -11, "username": "Anna S", "date_of_visit": " August 2014", "rating": "3", "title": "nice pub but no snacks available", "comment": "Popped in for a quick pint and a snack but there weren't any which was a shame! Nicely refurbished pub.", "date_of_review": "4 September 2014"}
{"review_id": 401, "restaurant_id": -11, "username": "Annemarie M", "date_of_visit": " August 2014", "rating": "4", "title": "Good pub dinner", "comment": "Read some excellent reviews of this newish place, so while in London had a look, for an evening meal. Weather not great so stayed inside as opposed to roof top garden. Liked the atmosphere in the bar. All in all good place. Service was a bit disjointed and slow but think they are still learning. Food very good value and not a huge menu which is always a good sign I think. Everything made fresh. Would go back again.", "date_of_review": "4 September 2014"}
{"review_id": 402, "restaurant_id": -11, "username": "Mitz_85", "date_of_visit": " August 2014", "rating": "5", "title": "Great twist on Sunday Roast and local beer selection", "comment": "I had heard about the new restaurant so was keen to give it a try.  I came to the Culpepper twice during a visit to London and the first was just for a quick beer where the staff greeted us and had a good little conversation about the place as it had just recently opened.  The next day we went back for the Sunday roast which was served with Kale as the veggies on the side. The pork was succulent and the Yorkshires were amazing. The food wasn't greasy at all and you could tell fresh ingredients were used. The staff member from behind the bar remembered us from the day before and the servers were very friendly. I would recommend a visit just to check the place out as it has some kitsch decor and the selection of beers from London itself was a nice touch.", "date_of_review": "8 September 2014"}
{"review_id": 403, "restaurant_id": -11, "username": "383amandar", "date_of_visit": " September 2014", "rating": "5", "title": "Go here immediately!", "comment": "I stayed above the Culpeper for a week and was excited to try the food but didn't have much expectation. It was AMAZING! I tried pretty much everything on the menu. Chef Sandy is wonderful! He has taken traditional English food and given it such exquisite uniqueness and taste. Not only can you try new things but if you fancy a pie, or just chips you are in luck because they are both some of the best you will ever have. The bar staff is knowledgeable, friendly, and attractive so really what more could you want! The cocktails were both familiar but with a unique twist. Great wine list, wonderful beer both on tap and in the bottle. Their rooftop urban farm provides fresher than fresh vegetables and herbs for the menu, which in my mind is always a plus. And finally, what really topped it off for me is that you got all of this without being pretentious. So whether you are new to the foodie scene or an avid eater and drinker such as myself you can get the exact experience you are looking for. Enjoy!", "date_of_review": "22 September 2014"}
{"review_id": 404, "restaurant_id": -11, "username": "Sharonie514", "date_of_visit": " August 2014", "rating": "5", "title": "Great place for brunch as well as Happy Hour", "comment": "We went for Sunday brunch and everything was delicious. Staff is very friendly, and save room for the Brownie dessert.", "date_of_review": "3 September 2014"}
{"review_id": 405, "restaurant_id": -11, "username": "Babybear28", "date_of_visit": " August 2014", "rating": "3", "title": "they need to sort lunchtime service ..\nstaff lack leadership", "comment": "I've been here a few times so the food is good. Was disappointed today - lunchtime with the service to order at the bar. It needs sorting out.. leadership is lacking and management skills..", "date_of_review": "22 August 2014"}
{"review_id": 406, "restaurant_id": -11, "username": "Steven S", "date_of_visit": " July 2014", "rating": "4", "title": "Great food and excellent Beer", "comment": "I have eaten here a couple of times. Fish and chips are fresh and very tasty (£10) and oysters were fresh and a bargain during the happy hour (2 for 1); although I would prefer then to be served on ice rather than salt. The bread served with the meal is fresh and delicious served with anchovy butter. The atmosphere in the pub is fairly laid back and relaxed and the interior is very light and airy. The beers I've tried are also excellent. Great place for lunch - i will go back and try out the Sunday Roast.", "date_of_review": "20 July 2014"}
{"review_id": 407, "restaurant_id": -11, "username": "Robert-John v", "date_of_visit": " July 2014", "rating": "4", "title": "Amazing Food, Airy & Light with Warm Staff", "comment": "I visited this pub on a warm Tuesday and from entering this light and airy pub I knew I would be returning. We started with the freshest olives and made in house herbaceous crisps. I had the homemade juice, which was simply delightful, very refreshing with a touch of ginger.  We opted for the picnic on the rooftop and I'm so glad we did. The green jungle hidden upstairs was a green treat! The welcome chase gin and tonic was a happy addition to the boxed delights of bacon cous cous, bread with anchovy butter and the most moresome duck rillet with pork pie and cauliflower. To finish the most scrumptious brownie with creme faiche, all for £15. Can't wait to return and try the menu downstairs.", "date_of_review": "8 August 2014"}
{"review_id": 408, "restaurant_id": -11, "username": "Tom O", "date_of_visit": " October 2015", "rating": "2", "title": "very poor service", "comment": "We came to the Culpeper on a Sunday as a group of five people celebrating the birthdays of a couple of our friends.  There were several problems that made this a really disappointing experience, which was a real shame as we had heard good things and we were really looking forward to going.  We had booked as a table of five and were clearly squeezed in on a much smaller table. That was after waiting 15 minutes to be seated. When we were eventually sat down, it took a further 15 minutes before we had to ask for menus.  It took well over an hour for our food to come out, it came out cold and it took a further ten minutes for them to provide us with gravy to go with our roast dinner. After already waiting an hour this was incredibly frustrating. As a table of five celebrating I felt that we were there for the overall experience as much as for the food, but this was totally ruined for us. There was no real sincere apology and no real service; we may as well have served ourselves.  The worst part was the woman working at the front, whose job title I can only assume is ‘mindless wanderer’. She seemed completely oblivious to the situation and showed no real urgency to any of our requests. It was such a shame as we were expecting so much more. I can’t imagine we will go again or recommend this place to any of our friends.", "date_of_review": "19 October 2015"}
{"review_id": 409, "restaurant_id": -11, "username": "FlyingScotsmanCP", "date_of_visit": " October 2015", "rating": "3", "title": "Complacency Rules", "comment": "Came in here for food and drink and it was promising. Took quite a while to get served as one barman was busy washing glasses, another was collecting glasses and delivering to the washer!!! Guys, your job is to sell beer and food not cleaners!!! Tidy is good but service is better. They were not that busy but I see a good bar undermined by complaceny that they are doing alright. The manager of the bar needs a rocket!! The beer was excellent but when I asked for beer list ............!!! All their fonts are engraved with invisible wording!!! Good beer but I decided not to eat here due to the service ethic!!! ", "date_of_review": "20 October 2015"}
{"review_id": 410, "restaurant_id": -11, "username": "GetThereQuicker", "date_of_visit": " September 2015", "rating": "4", "title": "Good Sunday lunch", "comment": "Handy for a Sunday lunch after going round the markets and Spitalfields.Ambience is a little on the spit n' sawdust side but seems to work well.Reasonably priced for the City.  Menu can seem to be a bit restricted, but the food is good!", "date_of_review": "7 October 2015"}
{"review_id": 411, "restaurant_id": -11, "username": "DONNA F", "date_of_visit": " November 2015", "rating": "5", "title": "Another great night", "comment": "What an amazing place this is and never disappoints me! Fabulous atmosphere and drinks and really great staff who are really friendly and helpful. Always makes me smile coming here for a drink or dinner! Keep up the great work guys! ", "date_of_review": "2 November 2015"}
{"review_id": 412, "restaurant_id": -11, "username": "laurawheeler129", "date_of_visit": " October 2015", "rating": "5", "title": "Unexpectedly good cocktails", "comment": "Having visited a couple times due to the lovely interior, atmosphere and pleasant staff it is definitely somewhere I shall often frequent. The pub feels intimate and relaxed as well as being a trendier spot.  I would highly recommend the roof terrace which feels like you are in someone's garden it's very quaint!  This weekend I had their winter julep cocktail a warm cocktail served in a tea pot, a lovely surprise!  Will be back very soon!", "date_of_review": "6 November 2015"}
