{"review_id": 1, "restaurant_id": -13, "username": "Richyburn", "date_of_visit": " October 2020", "rating": "5", "title": "Lovely Experince!", "comment": "I enjoyed my time at The Rooftop. Nice food, Great Ambience and an Excellent Service. The team treated my friend and I so well, they have suggested some food and drinks to try, took their time to explain the menu and even offered to help with the pictures. I will be visiting soon again.", "date_of_review": "4 October 2020"}
{"review_id": 2, "restaurant_id": -13, "username": "GDRyan", "date_of_visit": " October 2020", "rating": "5", "title": "Thank you so much!!!", "comment": "Myself and my partner had such a good time. Great views with nice ambience and fantastic service. Food and drinks where also very nice. Thank you so much Brian for looking after us.", "date_of_review": "24 October 2020"}
{"review_id": 3, "restaurant_id": -13, "username": "PNet83", "date_of_visit": " October 2020", "rating": "5", "title": "Fantastic Rooftop", "comment": "I went for Saturday brunch for the first time in Rooftop St James and as soon we were seated The waiter wished me happy birthday. He gave the best service ever seen, I do highly recommend it to visit!", "date_of_review": "2 November 2020"}
{"review_id": 4, "restaurant_id": -13, "username": "jmarcus511", "date_of_visit": " October 2020", "rating": "1", "title": "They cancelled the booking when we arrived", "comment": "Booked for a friends birthday 5 days in advance to be outdoors, as we were in a group not all part of the same household. Got there and we were turned away as it was raining and their outdoors is not covered. In the current circumstances they shouldn’t give the option to book outdoors (or at least give some kind of warning) if they don’t have covering, it’s winter in London so obviously the weather isn’t going to be great.", "date_of_review": "30 October 2020"}
{"review_id": 5, "restaurant_id": -13, "username": "C6912XCsophief", "date_of_visit": " October 2020", "rating": "4", "title": "Lovely food and drinks just disappointing service", "comment": "Lovely salmon with fluffy rice! So tasty and filling.  Had some prawns for starters which were very complementary with the main dish.  Drink menu is lovely and drinks are strong.  Only negative is booked for dinner and drinks (specifically drinks on the roof) was told we would be moved to the rooftop, waited over an hour to be moved and then saw staff move a group of 4 out to the roof while we were made to stay inside which dampened the vibe.  Clesrly moved the group of 4 out as they thought they would make more money from them. Overall lovely food and drinks the service was just a little disappointing", "date_of_review": "23 November 2020"}
{"review_id": 6, "restaurant_id": -13, "username": "Yuliya R", "date_of_visit": " October 2020", "rating": "5", "title": "Stunning view,incredible food, excellent service", "comment": "We were having a little celebration with my husband and we chose this restaurant. We never regretted it. The view from roof top was absolutely gorgeous. Service was exceptional from beginning until the end and made us feel so welcome.  We had 3 course meal and each dish was well presented and delicious.  Also we were impressed with amazing cocktails from the bar - beautiful and tasty.  We highly recommend this restaurant and definitely coming back.", "date_of_review": "18 October 2020"}
{"review_id": 7, "restaurant_id": -13, "username": "Garald1987", "date_of_visit": " October 2020", "rating": "5", "title": "Great Place", "comment": "We tried here just for cocktails just before dinner. It was amazing, especially when we sat outside, seeing London from above. Service was amazing, great atmosphere and tasty drinks. It's well worth a visit for the experience alone. Would go again in a heartbeat.", "date_of_review": "11 October 2020"}
{"review_id": 8, "restaurant_id": -13, "username": "HRoseG1992", "date_of_visit": " December 2020", "rating": "2", "title": "Not advisable during current Covid regulations", "comment": "I do not advise visiting here whilst the current government guidelines to have a substantial meal with your drink is in place. Given most people come to here for a drink before a meal, 3 small plates each as a minimum is a bit much! 3 small plates between a couple would be plenty to be considered a substantial meal. Hate to think it’s just a money making opportunity!", "date_of_review": "7 December 2020"}
{"review_id": 9, "restaurant_id": -13, "username": "MKGirlUk", "date_of_visit": " December 2020", "rating": "3", "title": "Views, staff, drinks excellent.", "comment": "Views, staff, drinks excellent. Food unfortunately not great. Broccoli stems too hard and knife not really sharp enough to cut them. Other food seemed generic Asian. Best food was the pulled pork bao bun, but I’d say there was too much sauce in it, and the gyoza. Got for drinks and the view. ", "date_of_review": "14 December 2020"}
{"review_id": 10, "restaurant_id": -13, "username": "Efk_200290", "date_of_visit": " December 2020", "rating": "3", "title": "Lovely setting, good service, food was just OK", "comment": "Went with a friend for drinks and meal - and was just a little bit disappointed in the food. It was all warm rather than hot and as were outside, it got cold very quickly. We’d shared a main but only had small side plates to eat from and a knife that couldn’t cut into the broccoli stalks (which were cold). The waiters were lovely and we enjoyed the view with our drinks. The cocktails were a little disappointing, too, for £15. Stick to the wine and gin and tonic.", "date_of_review": "11 December 2020"}
{"review_id": 11, "restaurant_id": -13, "username": "Andrew C", "date_of_visit": " September 2020", "rating": "4", "title": "Try it yourself", "comment": "The discrepancy in reviews is not surprising. Some people have a fantastic experience, other will be disappointed. First, you're going to pay for a view like this. But many places in central London are pricey. This is high, but not extreme. Second, you need to be on the terrace for the view. Not in the restaurant. Third, the food is actually pretty good. Fourth, the staff... Some are amazing, others seem still to be learning. Fifth, it's generally quite young and fun. Go enjoy yourselves!", "date_of_review": "30 September 2020"}
{"review_id": 12, "restaurant_id": -13, "username": "H1562GHdanielf", "date_of_visit": " September 2020", "rating": "5", "title": "Amazing rooftop drinks", "comment": "The place itself was amazing, great views from the terrace area. The staff was super nice and friendly, very good service, and they were accomodating to move us to better seats once a spot became available. Overall amazing experience, the drinks were also delicious!", "date_of_review": "17 September 2020"}
{"review_id": 13, "restaurant_id": -13, "username": "Lanriec", "date_of_visit": " September 2020", "rating": "3", "title": "Great views, slow service, food nothing special but drinks reasonably priced", "comment": "I booked for 3 people a 6pm seating last night. I find the £25 pp charge on credit card very steep - I understand the need to secure income aganist no-shows, but £10 would be more normal. The maitre d'h was lovely on arrival. Tables for 2 have the best views but I was happy with our table slightly back, and not to be on stools so it's more relaxed. The views are fantastic. Highly recommend. I thought the drinks prices were fine - £6 for a beer, 10 for a double G&T, 12 for cocktails. Food was nothing special but then again you pay for the location. I found the service really slow. At first we didn't mind, as we didn't feel rushed. But when we had to get up for a second cocktail, then to order the food, then to enquire about the wine which hadn't arrived, it felt like there wasn't enough waiters or barmen to serve the clientele. All in all we had a nice evening but I think service should be looked at. The last thing is that waiters didn't wear masks, and I think they should. Customers should also be asked to wear masks going to the toilets. So, more waiters and masked please!", "date_of_review": "16 September 2020"}
{"review_id": 14, "restaurant_id": -13, "username": "patrickk157", "date_of_visit": " September 2020", "rating": "5", "title": "A very Pleasant meal with a Stunning View", "comment": "I've booked a table for 2 for my wife's birthday. The place was very busy with a great atmosphere. Unfortunately we did not get a table outside on arrival but the staff have managed to move us as soon as there was availability. The service, food and the drinks were great so for us it was a very pleasant dinner with a stunning view, and I will return. Thank You for making my wife's birthday so special.", "date_of_review": "24 September 2020"}
{"review_id": 15, "restaurant_id": -13, "username": "petermY7264XF", "date_of_visit": " September 2020", "rating": "5", "title": "Thank you for a great evening!!!", "comment": "We finally returned to one of our favourit spots in Central London!! Superb drinks and great service as always. Management always around to make sure you are having a fantastic time.", "date_of_review": "24 September 2020"}
{"review_id": 16, "restaurant_id": -13, "username": "527gracef", "date_of_visit": " September 2020", "rating": "5", "title": "Stunning views with amazing service", "comment": "We had the best night with amazing cocktails, fab music and delish food. The service was second to none and they even gave us a desert to celebrate our anniversary. We felt absolutely spoilt!", "date_of_review": "17 September 2020"}
{"review_id": 17, "restaurant_id": -13, "username": "Roxanabarbulescu93", "date_of_visit": " September 2020", "rating": "5", "title": "Amazing service from Constantin !!!!!", "comment": "I went at this amazing rooftop with my friends from work . Girls night . We meet Constantin there and honestly I don’t have enough world to recommend him . Beside the fact that he is so funny and full of life , he is super professional and he took care of us all night . It was kinda cold and he close the top part + he have us blankets . It was an amazing experience and I just wanted to give him all the credit for this . For sure we are gonna come back !", "date_of_review": "25 September 2020"}
{"review_id": 18, "restaurant_id": -13, "username": "Valbeex", "date_of_visit": " September 2020", "rating": "2", "title": "No rooftop view!", "comment": "I booked for my partner’s birthday and upon arrival were put inside as the small rooftop area was already busy. We were we told that if a space frees up they would let us know. We asked again a few more times but they seemed to let 4 sets of other guests on to the rooftop who had arrived after us and kept saying there was no room!  Disappointed as we were really looking forward to it!", "date_of_review": "26 September 2020"}
{"review_id": 19, "restaurant_id": -13, "username": "KMM360", "date_of_visit": " September 2020", "rating": "1", "title": "Really disappointing, would not recommend", "comment": "Very unprofessional experience from the moment we arrived- staff arguing in front of us, we had to call the waiter over three times to ask him to take our order as he kept going to other tables on the walk to us and then forgetting about us. Then when we finally got to order, it came out wrong. I didn’t receive any of my order and two of my friends orders were also wrong. Asked the manager who apologised and said mine was on the way. Then the second time things were also missing from the order- it wasn’t in any way complicated I ordered 3 small plates on the menu. Service was very slow in general and then afterwards when looking at the bill we realised they swapped the white wine and were charging us for more expensive bottles than the first two. I have never had a restaurant or bar change the wine without asking us, especially to one more expensive. As it was my friends birthday, it was nice that a dessert was brought out for her but by this point there were far too many negative things to rescue our experience. Definitely would not recommend, especially for a celebration.", "date_of_review": "28 September 2020"}
{"review_id": 20, "restaurant_id": -13, "username": "jeanbO6203QU", "date_of_visit": " March 2020", "rating": "5", "title": "Gorgeous Views", "comment": "A really nice place to have a drink and and enjoy the city skyline. We were lucky we had the place to our selves... NEVER happens.", "date_of_review": "21 March 2020"}
{"review_id": 21, "restaurant_id": -13, "username": "capricecigar", "date_of_visit": " August 2019", "rating": "4", "title": "Beautiful rooftop bar..", "comment": "I have been many a time here over past 4 years , I love the view and have brought many a friend for brunch or drinks. Usually excellent service and food quality although 4 stars as I once was asked to pay the bill before being served ( which I found rather biased considering no one else was asked too and all other times I have paid after..) and on another occasion it would seem my friend and I were completely forgotten about and we had to call the manger over to be served , although he promptly served us on the house. Otherwise I would 100% recommend.", "date_of_review": "31 July 2020"}
{"review_id": 22, "restaurant_id": -13, "username": "E6712VZcarmenc", "date_of_visit": " September 2020", "rating": "5", "title": "Stunning anniversary", "comment": "I visited the Rooftop with my girlfriend to celebrate our anniversary. First day of reopening and Constantin was incredible sweet and attentive. We like the new Asian concept and the views. We will come back.", "date_of_review": "10 September 2020"}
{"review_id": 23, "restaurant_id": -13, "username": "MistyMaidstone", "date_of_visit": " September 2020", "rating": "5", "title": "Mums birthday", "comment": "Went here on the off chance they would fit us in as we didn’t book, the staff were so kind and accommodating! Would highly recommend the food we did a 3 for £25 light bites they were so good! When I’m back up in London will definitely return.", "date_of_review": "11 September 2020"}
{"review_id": 24, "restaurant_id": -13, "username": "nicholak594", "date_of_visit": " September 2020", "rating": "2", "title": "Celebration lost", "comment": "Entrance and greeting great ,but sadly that was the best we had. Shown to our table which was half set, 20 mins to wait for drinks order even though only one of 3 tables full in restaurant. Given one menu for food and then left a further 40 minutes before wine order and food. Other people arrived and yet had drink delivered. We complained as after an hour we had hoped to order ???? Chefs look amazing but food delivered eventually to table warm if that. Watching the suits walk by observing but really guys pay attention to detail and empty glasses . 2 n half hours later and still our cocktail glasses remain on table although finished . Food eaten although cold is still here even though requested to clear. I'm astounded by lack of service and standards below that we are used to in the city of London. Wetherspoons are quicker cleaner and more attentive. sadly this was my friends 50th and my.birthday too and yet being devoted Londoners and city workers we have been let down at a time where any personal experience in dining out has left us dumbfounded and so disappointed.", "date_of_review": "11 September 2020"}
{"review_id": 25, "restaurant_id": -13, "username": "WilliamE01", "date_of_visit": " September 2020", "rating": "5", "title": "Beautiful Night ", "comment": "We have been here for drinks and the experience was delightful. Everything was perfect from the drinks to the service! Recommend it! ", "date_of_review": "13 September 2020"}
{"review_id": 26, "restaurant_id": -13, "username": "877kevinl", "date_of_visit": " September 2020", "rating": "1", "title": "Where do I start. Had a confirmed", "comment": "Where do I start. Had a confirmed reservation through Opentable. On arrival, they couldn’t find my booking. “Are you Helen” I was asked. I’m an elderly male btw!!! Showed them my booking. “Sometimes the technology gets it wrong”. No table reserved for us and despite many empty had to sit side by side, at the shelf overlooking the Square in the burning sun. Drinks ordered, and finally took our food order. 45 minutes later, asked where our food was. Then asked “would you like to order something?”. Apologies later including “I’m sorry, I ended up nattering on the phone and forgot to pass your order on”. Food arrives, 4 small plates, 2 missing. “What did you order?”. Next plate arrives, wrong, a repeat. Finally the last two. By now, 90 minutes has passed since arriving. Food was reasonable quality but poor value. Drinks, 2x 2 G&T around £65. Needed two due to the wait. Service charges and VAT added to bill. Quotations are virtually word for word, I do not lie. I’ve never given a bad review before. Guess there has to be a first. Absolute atrocious service, lack of attention and poor value for money. Recommendation: don’t bother.", "date_of_review": "15 September 2020"}
{"review_id": 27, "restaurant_id": -13, "username": "Ani_London17", "date_of_visit": " September 2020", "rating": "5", "title": "Just breathtaking!! ", "comment": "Me and my friend found this amazing place with a breathtaking view , amazing drinks and food to complete our night. We didn’t have a booking unfortunately but they found us a table in seconds even if it was fully booked all the stuff and owner they was very kind and helpful. I am recommending this place to everyone ❤️", "date_of_review": "13 September 2020"}
{"review_id": 28, "restaurant_id": -13, "username": "Heyimnaggs", "date_of_visit": " September 2020", "rating": "1", "title": "Terrible! Service was so bad", "comment": "Really disappointed with this visit. Was sat at a shelf basically with uncomfortable seats. Asked to move three times and instead was ignored the whole night. Drink menu took 30 mins to come then drinks took another 30 mins. Terrible terrible service... will not be returning", "date_of_review": "16 September 2020"}
{"review_id": 29, "restaurant_id": -13, "username": "Clivey57", "date_of_visit": " November 2019", "rating": "5", "title": "Fantastic Evening", "comment": "Booked a table for 6 of us(Saturday).from the moment we arrived we were treated exceptionally well, over the 3 half hours we were here the service was fantastic with nibbles, the cocktails were great the porn stars with procceco went down well for me the old dark rum was great I also had the caprinas & mohito,at the rooftop bar you have fantastic views of Trafalgar Square and the London eye/ shard.We had a 5* service and many thanks to all your staff for a unforgettable evening.", "date_of_review": "17 November 2019"}
{"review_id": 30, "restaurant_id": -13, "username": "David H", "date_of_visit": " November 2019", "rating": "5", "title": "Behold London", "comment": "The Rooftop is an amazing place for a drink and a bite to eat. I would call it casual up market. The view is astounding, a great place to take visitors to London. Champagne cocktails are their specialty and there is no Malibu, much to the disappointment of a nearby table!", "date_of_review": "8 November 2019"}
{"review_id": 31, "restaurant_id": -13, "username": "Kmf11005", "date_of_visit": " December 2019", "rating": "1", "title": "Hotel guests pre booked shocking service", "comment": "We had pre booked intending to have the Champagne pairing, bottle of Veuve Clicquot yellow label and cheese fondue for 2 £130. We arrived at our booked time and were walked past the covered tables and taken to the uncovered area , I asked if the heater could be lit, but was told it’s not working, do you want a blanket. We were not offered drinks at this point , just left at the table, Due to the cold we decided just to get a drink, as guests of the hotel there is a code for your first glass of Veuve Clicquot for £10. When I enquired about this was told “ we need the code “ which I did not have as we had intended to purchase the full bottle, it felt that they expected me to return to my room to get the code which was clearly generic at this point we decided that the service and ambiance were just not worth the wait,and told them that we intended to leave. As we did so we were asked for our room number , which I provided but questioned as to why they needed it. We were told “ maybe we can send you something” at time of review the “something has not arrived” over all very disappointing.", "date_of_review": "8 December 2019"}
{"review_id": 32, "restaurant_id": -13, "username": "rjf1002014", "date_of_visit": " December 2019", "rating": "4", "title": "Recommended for chilled Champagne in Winter warmth", "comment": "My wife and I spent two enjoyable hours for the bottomless champagne brunch just before Christmas. The food was not elaborate but nice and as expected as the menu was available prior to booking. The starter was a sharing platter. The bar was fairly compact with approximately 7 small tables. Although it rained heavily we were warmed by the electric heaters and dry under the canopy. The champagne flowed freely as one would expect. A lift brought you conveniently to the Rooftop bar, but the nearest toilets were down a flight of stairs and the tables were high and you sat at bar stools so anyone in a wheel chair might want to check in advance access and seating. The staff were polite and attentive. We booked through the Opentable App which within the same confirmation e mail in separate paragraphs said our table was reserved for 90 minutes and 120 minutes which was irritating. In fact our glasses were topped up for the last time at 105 minutes which seemed acceptable for a 120 minute reservation. ", "date_of_review": "31 December 2019"}
{"review_id": 33, "restaurant_id": -13, "username": "Alan B", "date_of_visit": " December 2019", "rating": "3", "title": "Restaurant - Nice atmosphere, fair food and service", "comment": "We were walking around the area and looked for somewhere to eat that wasn't another pub. This looked like a classy establishment. It was mid-afternoon, so it wasn't too busy. We were seated right away, but service was slow. We shared a few dishes: Spiced Nuts, Hummus, Tuna Tartare and a Chopped Chicken Salad. The nuts were good, the other dishes were unimpressive.", "date_of_review": "15 December 2019"}
{"review_id": 34, "restaurant_id": -13, "username": "iva20", "date_of_visit": " January 2020", "rating": "2", "title": "Rooftop Bar Experience", "comment": "Decided to come in for a drink before heading to dinner somewhere else. Overall didn't find the staff that attentive and the drinks took about 20+ mins to arrive. Honestly didn't find the cocktails worth £14-£16 each. Good atmosphere though, but doubt we will visit again.", "date_of_review": "19 January 2020"}
{"review_id": 35, "restaurant_id": -13, "username": "Muriel_Prince2", "date_of_visit": " January 2020", "rating": "5", "title": "New Years Day Parade but on a roof top bar", "comment": "You must try this roof top bar it’s lovely. Lots of heaters and blankets to keep you warm with a lovely bottle of Verve. You can see the parade not brilliantly but you can definitely see it. This suited us as we did not want to stand in the crowds. We enjoyed the ambience and the light snack foods were lovely. They bought out a little plate of birthday treats for my husband as this was a surprise present, such a lovely touch. The staff were very attentive and welcoming. Happy New Year to you all and thank you again, looking forward to returning.", "date_of_review": "3 January 2020"}
{"review_id": 36, "restaurant_id": -13, "username": "DizeyL", "date_of_visit": " February 2020", "rating": "5", "title": "Outstanding views of the city ", "comment": "Great evening spot for a glass of bubbly, we headed up at 5pm just as it opened to get a table near a heater. Fabulous views - one of the better roof top bars in London. Cocktail menu and nibbles are great. Well worth a visit, dress warm but there are heaters and blankets, we were nice and snug.", "date_of_review": "14 February 2020"}
{"review_id": 37, "restaurant_id": -13, "username": "Tetchie R", "date_of_visit": " October 2019", "rating": "4", "title": "Cozy place for drinks and dinner with a fantastic view of central London!", "comment": "Since we were staying at the hotel St. James, my husband and I decided to try their rooftop restaurant. Perfect timing too since we made reservations for the day we were coming back from a tour of the countryside (Stonehenge and Windsor). We figured for convenience after a long day, dinner and drinks here would be best. It sure was perfect because it rained that late afternoon! Been sunny the 2 full days we were exploring the country. Due to the rain we could not have drinks at the outdoor bar (floor is slippery) but it did not stop us from enjoying the view. Dinner was good too. Not too many items to choose from but there's still a good variety of dishes. It wasn't our best meal in London but overall, it was good. Service was superb. Servers were very attentive, checking in on us and not having to chase anyone for anything.", "date_of_review": "14 February 2020"}
{"review_id": 38, "restaurant_id": -13, "username": "willthomas1756", "date_of_visit": " February 2020", "rating": "2", "title": "View was good and nice atmosphere", "comment": "View was good and nice atmosphere however service was shocking. Being a Hilton gold card member I really expected more. Originally was turned away and told would have to book so went back up to the room and phoned reception and was told we could go straight up..... confused.... couple hours later we phoned reception to see if there was room which we were told yes we could go straight up and still got told by rooftop receptionist to wait to see if we were allowed up. More time wasting. After being seated we were waiting some time before being served (I even went to order at the bar and was told to have a seat as it was table service). To top it off, after asking for the bill, 3 people who asked for the bill after myself were served before me. Not impressed. Wouldn’t bother visiting. ", "date_of_review": "15 February 2020"}
{"review_id": 39, "restaurant_id": -13, "username": "Enjoylittlethingz", "date_of_visit": " September 2020", "rating": "1", "title": "Not a high standard place, such a disappointment", "comment": "The customer service was disappointing and fair to say schoking. We waited for drinks to be delivered over 30 minutes each time and it was not exceptable. We have ordered some nibles for the table and the order was not delivered for over 1hour, plus we needed to remind multiple times to waiting staff regarding this and no one could simply bring it.  The rooftop itself is super nice but that's the only good thing I could say about this place, otherwise the place does not meet the high standards.", "date_of_review": "16 September 2020"}
{"review_id": 40, "restaurant_id": -13, "username": "RickyTutt", "date_of_visit": " August 2019", "rating": "5", "title": "Awesome", "comment": "The rooftop as a view over Trafalgar Square which is just a stones throw away from The Trafalgar Hotel of which the Rooftop bar belongs, very nice at anytime of the day, but very nice to come back to after being out & about in London & coming back to the rooftop for a drink.. very relaxing.. ", "date_of_review": "4 September 2019"}
{"review_id": 41, "restaurant_id": -13, "username": "Adventurers049", "date_of_visit": " September 2019", "rating": "5", "title": "Wow", "comment": "hat a stunning location! The bar overlooks Trafalgar Square and it is stunning. They serve great cocktails!", "date_of_review": "3 September 2019"}
{"review_id": 42, "restaurant_id": -13, "username": "mcdad10k", "date_of_visit": " September 2019", "rating": "4", "title": "Breakfast is a must!", "comment": "The service and selection was wonderful. While we did come up in the evenings, the morning was the best! Great views, service, and menu. I loved the Eggs Royale! Looking forward to our next visit. ", "date_of_review": "24 September 2019"}
{"review_id": 43, "restaurant_id": -13, "username": "Vacation734605", "date_of_visit": " September 2019", "rating": "1", "title": "Nightmare", "comment": "The view is great if you are at one of the 4 tables with a view. If not then it’s terrible. Check out the menu before going. Really limited. We visited a day early to request a good table. That didn’t work out.  The service was subpar. Slow. This one is a pass.", "date_of_review": "27 September 2019"}
{"review_id": 44, "restaurant_id": -13, "username": "Tarah2325", "date_of_visit": " August 2019", "rating": "2", "title": "Wouldn't revisit", "comment": "This is the second time I have visited. Both times were not up to expectations. We reserved a table and the view over Trafalgar Square cannot be faulted. We were seated promptly and service was good up until this point. We waited ages for our order to be taken. We had to get off our seat and asked the lady who seated us to take our order. It is not a large area and there was no excuse for not noticing us. We placed the order and asked if we could have the dishes staggered. No problem. However the dishes came altogether. When we mentioned this to the waitress she said the kitchen was too small for us to have a starter first and then a main dish! Food nothing spectacular and not very warm either. As you can imagine this wasn't cheap eats. They lumped on a massive service charge which had I been paying I wouldn't have paid.", "date_of_review": "28 September 2019"}
{"review_id": 45, "restaurant_id": -13, "username": "kalekalekale", "date_of_visit": " October 2019", "rating": "3", "title": "Great view - Terrible Service. Go elsewhere.", "comment": "Stone-faced, unfriendly staff, which was in huge contrast to the hotel staff (where we were staying). Don't expect prompt or helpful service, but the food / drinks were good. View is great, but I wouldn't go out of your way to stop by unless you happen to be in the area. Also, wear layers in the fall / winter. They have heat lamps but it's still quite cold.", "date_of_review": "16 October 2019"}
{"review_id": 46, "restaurant_id": -13, "username": "Btaylorrrr", "date_of_visit": " October 2019", "rating": "3", "title": "Overrated ", "comment": "We visited this bar to celebrate a 30th Birthday, we originally asked to be upstairs on the rooftop as the views are incredible! However, after waiting 15 minutes to be seated outside we settled for sitting inside- the decor was boring and the service incredibly slow.  We decided to head to the bar downstairs where the decor was more suited and the service was more acceptable.  This place was ok, however there are better places to spend your money within London ", "date_of_review": "16 October 2019"}
{"review_id": 47, "restaurant_id": -13, "username": "Antonino C", "date_of_visit": " October 2019", "rating": "2", "title": "amazing view and smart atmosphere but service must improve", "comment": "I visited the venue on Friday night. The view from terrace is amazing (even though the space outside is limited to a very small part of the roofbar). The fact that they have such a valuable asset, guaranteeing a certain number of visitors, maybe did not stir them to invest on service and customer care. My friend had booked over the phone for 10 and left his name and credit card details (!!!) We were quite disappointed when we arrived and we found out that our reservation was not recorded. The guy downstairs was not very helping but fortunately we found a very efficient and kind girl from Sicily upstairs who found a table for us and looked after us with smile and good manners. She is the only reason why I have given 2 stars and not 1. When we sat the waiters forgot an order and were not focused on tables: we had to struggle to call for ordering. This is a pity because the place has a great potential but service is not appropriate for such a beautiful venue and above all does not reflect the high prices we were charged.", "date_of_review": "7 October 2019"}
{"review_id": 48, "restaurant_id": -13, "username": "Bigal57", "date_of_visit": " October 2019", "rating": "5", "title": "Amazing views", "comment": "This is a unique place in London, so you pay premium prices. Some reviewers seem to expect pub prices. We went for dinner, and ate very good tapas, plus a plate of meat. Two rounds of cocktails , plus two bottles of wine, added up to a substantial bill, but no more than I would have paid in a reasonable quality restaurant. The extraordinary view makes it a unique experience. We found the young staff to be enthusiastic and responsive. We would definitely return. This has to be the ultimate London venue for New Year's Eve.", "date_of_review": "30 October 2019"}
{"review_id": 49, "restaurant_id": -13, "username": "ladybaltimore", "date_of_visit": " August 2019", "rating": "1", "title": "Waited for 40 minutes and no one cared?", "comment": "My friend and I stopped here for drinks. Waited about 25 minutes to have our order taken. Then 10 more minutes went by and they came back to take our order again. The table next to us, who were seated after us, then got their drinks delivered and we were still waiting.  This place was not busy. When we mentioned to the server we’d been waiting a long time he didn’t seem concerned so we said we were leaving.  Also mentioned it to the host who just said they’re really busy, but they had lots of open tables so not sure what busy means exactly. Maybe only go when it’s empty. ", "date_of_review": "8 August 2019"}
{"review_id": 50, "restaurant_id": -13, "username": "JulesSeshmet", "date_of_visit": " August 2019", "rating": "1", "title": "Spare space but wouldn't allow anyone else to sit outside", "comment": "Arrived here without a booking mid Saturday afternoon and though there were a good number of free chairs and a couple of tables they wouldn't let us sit outside. We weren't impressed so left.", "date_of_review": "11 August 2019"}
{"review_id": 51, "restaurant_id": -13, "username": "Ian C", "date_of_visit": " August 2019", "rating": "5", "title": "A hidden gem ", "comment": "Hooray, we had sunshine for a few days, so where better to go for lunchtime drinks, with great views across Trafalgar Square and down Whitehall than the Rooftop. We had an enjoyable chilled bottle of Rose along with some olives, in addition to the complimentary nibbles, by the friendly and helpful staff. Wine prices are inevitably a little on the high side, but there also a good range of cocktails and the quality of the wine and service reflected the price.", "date_of_review": "21 August 2019"}
{"review_id": 52, "restaurant_id": -13, "username": "448robertk", "date_of_visit": " August 2019", "rating": "3", "title": "C", "comment": "We had co cocktails here on a chilly day recently service is fine drinks were ok also probably return ", "date_of_review": "20 August 2019"}
{"review_id": 53, "restaurant_id": -13, "username": "DusLon", "date_of_visit": " September 2019", "rating": "5", "title": "City trip date night experience", "comment": "Canadian/German couple from Düsseldorf on a „date night“ during a short city trip to London. Table booked in advance for 19:30, „…a sunset view would be lovely“. After being greeted at the downstairs reception, (and a quick telephone confirmation upstairs), we were in the elevator and on our way. The doors open, and there was the first of many (authentic!) smiles. The employees were all, without exception, very friendly! We were brought out to the terrace and soaked in the 5-star atmosphere. - Many people who have written negative reviews either didn’t reserve a table, or, quite frankly, did not realize that this is a prime London location. If you’re wearing a tshirt and shorts, carrying a backpack after sweating in the tube, I would think you wouldn’t be seated on the terrace next to an ambassador or international business-people. You don’t need a tux, but „dress to impress“! (At least „casual-chic“.) Cocktails: „La Dolce Vita“ = wow, … but a word of warning about the aromatic and delicious „Ciao, Amore!“ Unbeknownst to us, the glass is sprinkled on the outside with a fine dust of chocolate powder. The condensation from the cold glass has a „liquifying“ effect on the outside, leaving melted chocolate on your hands. if your not careful, (which I wasn’t) there will be a happy little accident on your face, or on your clothes. A warning from the staff when serving this piece of art would be very helpful. Food: If you order the yummy „Chicken & Avocado Chopped Salad“, be aware that there are (a lot of) cashews on top. Better yet, just let the staff know about what you’re allergic too before you order. „The Rooftop“ has a wonderful view, an unforgettable vibe, and authentically(!) friendly staff. If you’d like your evening in London to be very special, consider experiencing this romantic bar/restaurant on top of The Trafalgar St.James hotel.", "date_of_review": "7 September 2019"}
{"review_id": 54, "restaurant_id": -13, "username": "wassabiwasa", "date_of_visit": " August 2019", "rating": "3", "title": "Don’t hype up your expectations ", "comment": "The place itself has a great view on London and terrace is modern however we were disappointed with food quality and service. I wouldn’t recommend going there for a meal but maybe for a nice drink only", "date_of_review": "24 August 2019"}
{"review_id": 55, "restaurant_id": -13, "username": "Ben_M1", "date_of_visit": " August 2019", "rating": "1", "title": "Rude staff", "comment": "The host informed us we could not sit in the sun and must sit by the door. 2 minutes later 2 more people were offered a seat any where they wanted and again the next people were offered the same. The service was terrible and took 15 minutes to receive 2 cocktails...we cancelled the order and walked out! Much nicer rooftop bars all over and prices do not jut suit the service. ", "date_of_review": "26 August 2019"}
{"review_id": 56, "restaurant_id": -13, "username": "Scott S", "date_of_visit": " August 2019", "rating": "2", "title": "Rude Staff", "comment": "Incredibly rude front of house staff on the ground floor. Quite a cool venue and the best views are on the first terrace as you come out of the lift. This being said, the impolite staff will stop me coming back again. (It seems to be a common theme with other comments on here!)", "date_of_review": "26 August 2019"}
{"review_id": 57, "restaurant_id": -13, "username": "Jan A", "date_of_visit": " August 2019", "rating": "2", "title": "The place lives from its location, but nothing else.", "comment": "Based on today’s dining experience - Slow service  - Told not allowed to move table by manager despite waiter explicitly agreeing to this - being rebuffed by the waitress “I need to go now, we are very busy” - requires to deposit a credit card despite already providing details via open table  - don’t accept open table dining voucher despite not having opted out of the scheme and using open table for their bookings All in all a very average experience, or sub par to be frank. Food was okay once we got it. It takes a while.  The place lives from its location, but nothing else.", "date_of_review": "26 August 2019"}
{"review_id": 58, "restaurant_id": -13, "username": "Claire B", "date_of_visit": " June 2019", "rating": "5", "title": "Book the front bar to overlook Trafalgar Square", "comment": "Excellent place to go must pre-book though and ensure you have booked the front bar is my top tip. Great service and lovely atmosphere. Went back again recently (this review) and still a great place to go with the views across Trafalgar Square we had a good afternoon with friends here!", "date_of_review": "31 August 2019"}
{"review_id": 59, "restaurant_id": -13, "username": "T W", "date_of_visit": " September 2019", "rating": "5", "title": "Enjoyed our time at the rooftop bar", "comment": "Booked here as part of a day out in London to celebrate our daughters 30th. I was a bit worried about the mixed reviews, but we have always wanted to visit a roof top bar and where better to experience our first one than in London and as part of a family celebration.  We were lucky with the weather and enjoyed our time here, great drinks, great setting and all the staff we dealt with were brilliant, friendly and service with a smile. Loved every minute of the time we spent here, thank you to all those who made our visit, a memory we will look back on with a smile, got some cracking photos, had some lovely drinks in a wonderful setting. So glad we chose to go here", "date_of_review": "2 September 2019"}
{"review_id": 60, "restaurant_id": -13, "username": "nickmer", "date_of_visit": " July 2019", "rating": "4", "title": "Location location location ", "comment": "Fabulous location fabulous small tasting dishes great service but in fairness was a private event. But beautiful place that’s always worth a special occasion. ", "date_of_review": "10 July 2019"}
{"review_id": 61, "restaurant_id": -13, "username": "caremaj", "date_of_visit": " July 2019", "rating": "5", "title": "Great views service and drinks", "comment": "We dropped by with my family: 2 seniors, 2 adults and 2 kids (5 and 3 yrs old). Staff (Max) accommodated all of our needs! They arranged something special for the kids and they loved it!!! Try the Bye Bye Ben with Pork Belly Buns!", "date_of_review": "13 July 2019"}
{"review_id": 62, "restaurant_id": -13, "username": "tomleo77", "date_of_visit": " March 2019", "rating": "5", "title": "Outstanding!!", "comment": "I booked a table here at the very last minute, just a couple of days before actually visiting. As it was March, the weather wasn’t great but with the canopy’s and heaters it didn’t matter at all. The staff are so friendly and can’t do enough for you, even offering us food even though we only had a drinks reservation. Yes, the drinks are on the expensive side but it’s central London, it’s expected. However, the absolute best thing about the place is the view. An amazing cityscape, while you enjoy your drink of choice. You have to visit this place!", "date_of_review": "16 July 2019"}
{"review_id": 63, "restaurant_id": -13, "username": "KennethLay", "date_of_visit": " July 2019", "rating": "5", "title": "Lovely", "comment": "Visited with a friend for a drink on the roof top bar. The staff we encountered throughout the hotel were pleasant and friendly. The rooftop bar is lovely with gorgeous views! Unfortunately we couldn’t stay as it had a private event coming up but the staff were friendly and apologetic. They helped inform us of other roof top bars around. Would have been amazing if we could have stayed but really appreciate the service here, well done and thank you!", "date_of_review": "17 July 2019"}
{"review_id": 64, "restaurant_id": -13, "username": "fmaca76", "date_of_visit": " July 2019", "rating": "4", "title": "Gorgeous Day, Fabulous Views", "comment": "This will be one of the most unique views of Trafalgar Square you will have. You can sip a cocktail looking over the square and the London skyline, away from the hustle and bustle. It is a gorgeous hotel too, and you have to go through the reception to go up to the bar. This is a great place for pre-cocktails, and romantic drink or two.It is not too big so if busy can feel a bit squashed in, but the service is very good, as are the cocktails so a definite must do if in the area. Also NO SMOKING on the terrace.", "date_of_review": "17 July 2019"}
{"review_id": 65, "restaurant_id": -13, "username": "august01", "date_of_visit": " July 2019", "rating": "3", "title": "Very expensive and drinks not great, but pleasant service and views", "comment": "Came here with family for pre-dinner drinks. Service was pleasant although slow at times as the place was constantly busy and they seemed to struggle to cope a little. We ordered a porn star martini (£15) which is the worst one I have ever had (didn't have any passion fruit or any taste of passion fruit, and was an almost entirely clear drink), a pint of Peroni (£8.50) and an amaretto sour (£14). Service of around 12.5% was automatically added. Views were good but were were on one of the tables closest to the interior, and so we had to stand by other people at their tables to see the view. It was a lovely evening weather wise though so a nice place to be if that's the case.", "date_of_review": "17 July 2019"}
{"review_id": 66, "restaurant_id": -13, "username": "John G", "date_of_visit": " July 2019", "rating": "3", "title": "Stunning position.", "comment": "Fabulous views but a little crammed which makes service slightly chaotic. An outdoor seat with a city view to remember. ", "date_of_review": "18 July 2019"}
{"review_id": 67, "restaurant_id": -13, "username": "dc862015", "date_of_visit": " July 2019", "rating": "3", "title": "Ideal Location but let down by staff", "comment": "Had evening food here and whilst you couldn't fault the food, the staff were not up to standard. We were in no rush but ad to find staff to order food and then walked up to the bar to pay the final bill. Then there is the audacity for a service charge when the service was so poor. Will not be visiting again when other options are available nearby", "date_of_review": "22 July 2019"}
{"review_id": 68, "restaurant_id": -13, "username": "jtnicholson", "date_of_visit": " July 2019", "rating": "5", "title": "Amazing view", "comment": "Wow what a bar. Best view of Trafalgar Square and London skyline. Staff very welcoming. Cocktails lovely. Best to pre book as it’s a very popular bar with limited space where the best views are. We will definitely return.", "date_of_review": "28 July 2019"}
{"review_id": 69, "restaurant_id": -13, "username": "natasha1989k", "date_of_visit": " September 2020", "rating": "5", "title": "Blooming Evening with London Views", "comment": "Myself and my partner had a beautiful evening a The Rooftop, sat in there with a stunning London view. The staff were friendly and welcoming, nothing was too much trouble.  we were well and truly spoiled and will return again soon.", "date_of_review": "29 September 2020"}
{"review_id": 70, "restaurant_id": -13, "username": "freddiedoncaster", "date_of_visit": " July 2019", "rating": "3", "title": "A VISIT TO THE ROOFTOP BAR", "comment": "We visited the hotels rooftop bar during the hot spell in July. The three rating is merely for the view and not much else. Firstly the hotel need to train their staff.When asking what tonic do they serve with Hendricks gin,the girl replied fizzy!! Secondly when I am paying £15+ for a gin and tonic I expect it to be served properly,in a g+t “goldfish bowl” glass,with plenty of ice and a garnish,not in a feeble tumbler with hardly any ice and just a slice of lemon. Needless to say I wasn’t impressed,so I suggest the hotel ups it’s game,or they will be receiving more reviews similar to this one.", "date_of_review": "25 July 2019"}
{"review_id": 71, "restaurant_id": -13, "username": "Dmitry S", "date_of_visit": " July 2019", "rating": "2", "title": "Disappointing service", "comment": "Arrogant staff trying to be nice as you enter but could not be less interested in customer service. Overpriced wine served in cheap glassware. It was like paying \"Ritz\" prices for wine but drinking it in a \"Premier Inn\" glass. How the management can get this so wrong? Where is the quality value? The servers were just rushing around without any direction avoiding eye contact from people desperate to order more drinks or ready to pay for their bills. Very disappointing.", "date_of_review": "8 July 2019"}
{"review_id": 72, "restaurant_id": -13, "username": "Eli-R95", "date_of_visit": " May 2019", "rating": "3", "title": "Nice space, slow service", "comment": "The view of Trafalgar Sq (and Whitehall rooftops) is unparalleled, but the outdoor space is not huge and fills quickly. Staff were friendly but service very slow, especially considering how extortionate the drinks were (£16). To be expected but maybe employ another bartender...", "date_of_review": "14 May 2019"}
{"review_id": 73, "restaurant_id": -13, "username": "Suzanne W", "date_of_visit": " May 2019", "rating": "1", "title": "Spend your money elsewhere", "comment": "To accommodate party of 20 without a minimume spend of several hundred pounds, we had to book 3 tables. The bar then contrived to put our tables in 3 different areas. One of which was totally empty. But they then refused to co locate us, accusing us of being aggressive. In light of blatant provocation, we were admirably restrained. We took our money elsewhere. Bear in mind this was a party organised by the mother of the bride. Well behaved, well organised, but the bar were determined to thwart us. Take your money elsewhere.", "date_of_review": "5 May 2019"}
{"review_id": 74, "restaurant_id": -13, "username": "lsuxtremist", "date_of_visit": " May 2019", "rating": "1", "title": "Terrible service, below average food, high prices, got bumped from the terrace", "comment": "My wife and I were taking a trip to celebrate our wedding anniversary. We stayed in London and for our first night there, I reserved a table so that we could eat and have a nice romantic dinner overlooking London. After arriving on the top floor, the host tells us that it is starting to rain so we don't want to be outside and that he could set us up inside. I thought they would have areas inside that also have a view and thought well this will work out even better. It did not. He sat us where we did not have a view of anything in a less than ordinary spot. Not the idea for a romantic dinner date I had in mind. We waited for quite a while before someone finally came to take our order. We looked at the drinks to which we do not find anything that tempts us for the exorbitant prices they have listed. The menu is limited: burger, fish & chips, ribeye steak for $35, or a salad. I got the burger which was OK, but certainly not worth $15. Wife got the fish & chips that she could not continue to eat, and we paid a bunch of money to then leave to go somewhere else to actually get something good to eat for supper. On our way out, we look outside on the terrace which is full of people enjoying the night views on a non-rainy rooftop terrace. The host had even brought some of them blankets to help keep them warm on an otherwise cool night. We were well-dressed for our date night, so I am not sure what was the host's problem. We decided to give the place another shot for breakfast. We were sat for breakfast in the same room - no view - for breakfast. We had opted for the Full English Breakfast which was $25, but included on a' la carte item you could order as well as the buffet offered. After waiting for about 15 minutes trying to flag someone down to come take our order for the a' la carte and coffee we wanted. Finally, I grabbed a waiter walking through the room and asked him to take our order which he did. But he never brought our coffee. I then found one guy that appeared to be the manager and asked him for the coffee which he brought. The buffet offered a pretty good assortment of items but all were OK; nothing special. The a' la carte food was good. Finally, we finished eating a average breakfast for a huge price tag with no view and terrible service. Do yourself a favor and spend your money elsewhere where you can get better food or just as good food for way cheaper. This is a fantastic hotel that's only flaw we found was the Rooftop.", "date_of_review": "13 May 2019"}
{"review_id": 75, "restaurant_id": -13, "username": "HerbieB540", "date_of_visit": " May 2019", "rating": "3", "title": "Sunday drinks", "comment": "We visited the bar for drinks on a Sunday afternoon. The balcony overlooking Trafalgar Square was busy but there were a few spare tables. We asked if we could sit at one but they said they were all booked. So we sat in the part at the back which was ok but nothing special. The service was really slow where we were as it seemed they concentrated on the front part. We eventually got served and had our drinks. As we left we noticed that the tables that were empty when we arrived were still empty and there were even more empty tables overlooking Trafalgar Square. I am sure it would have been good customer service to see if we wanted one of these tables and if people had arrived we would have been more than happy to move. We will not rush back.", "date_of_review": "19 May 2019"}
{"review_id": 76, "restaurant_id": -13, "username": "stilfuld", "date_of_visit": " June 2019", "rating": "1", "title": "Afternoon drinks too much to ask", "comment": "To summarise we were served unbelievably slowly for a near empty bar, charged more than the menu price for our drinks (which are significantly above average - £21 for a white wine spritzer), and rudely treated whilst we were there. Fortunately the view comprises for the shocking service, but still left us feeling very unwelcome. Wouldn’t return. ", "date_of_review": "3 June 2019"}
{"review_id": 77, "restaurant_id": -13, "username": "Maria Eva L", "date_of_visit": " May 2019", "rating": "4", "title": "Great place for drinks before dinner and meeting friends", "comment": "Lovely few from the top to see the Trafalgar Square, great place to drink and relax and have conversation with friends and family. The service was good, the waitstaff are very attentive if you need some drinks. Lastly wonderful atmosphere ", "date_of_review": "11 June 2019"}
{"review_id": 78, "restaurant_id": -13, "username": "Dan G", "date_of_visit": " June 2019", "rating": "5", "title": "Fantastic birthday lunch!", "comment": "Booked in to the Madison roof top restaurant for my wife’s birthday lunch. Staff were amazing, attentive, friendly and very helpful. Food was great (starters followed by lobster roll and duck burger) and wine was nicely chilled. Service was great too. Some nice touches by the staff to make the birthday treat special which was really appreciated. Not the cheapest place to eat/drink but we’ll worth it for the quality of the food and service plus the views. Ambiance was good, buzzing bar. Sunshine added to the experience. Will recommend.", "date_of_review": "14 June 2019"}
{"review_id": 79, "restaurant_id": -13, "username": "Valentinani", "date_of_visit": " June 2019", "rating": "2", "title": "Very poor service ", "comment": "I had a friend visiting from abroad and after lunch nearby we decided to have a drink at the Rooftop.  We were seated at The Deck and then had to wait for over 5 minutes to be acknowledged, then served. And it wasn’t even busy.  We ordered a coffee and a prosecco, after a while I had to signal that we were still waiting, the waitress then came with the prosecco only and asked my friend to remind her what he’d ordered! The coffee turned up a few minutes later.  When we asked for the bill it took so long I had to wave to the waitress to remind her, still no bill. We eventually had to walk to the bar to ask to pay.  As I said, it was not busy. There were a few empty tables.  I paid nearly £20 for a coffee and a prosecco.  Appalling. ", "date_of_review": "24 June 2019"}
{"review_id": 80, "restaurant_id": -13, "username": "CoffeyBean101", "date_of_visit": " June 2019", "rating": "4", "title": "Excellent View of London", "comment": "A lovely spot for a drink or two on a summers day. The bar offers a range of cocktails, wines and a few ciders. Friendly staff and a pleasant trip.", "date_of_review": "27 June 2019"}
{"review_id": 81, "restaurant_id": -13, "username": "JaniLong", "date_of_visit": " May 2019", "rating": "4", "title": "Excellent", "comment": "I have been many times to this rooftop and never disappoints. The location and views are beyond expectations and the stuff very kind, quick and efficient. I would highly recommend this place if you have family over, for a date or just to have a nice drink outside. Great stuff !", "date_of_review": "2 May 2019"}
{"review_id": 82, "restaurant_id": -13, "username": "what-would-1-know", "date_of_visit": " April 2019", "rating": "1", "title": "Shocking", "comment": "Just had a couple of meetings here (2nd April). Prior to meeting I ordered a burger with no cheese. Eventually the meal rocked up but burger had cheese. Not the end of the world and they subsequently took the burger to be re done BUT left the bowl of fries!! After a further 10 minutes my burger arrived and so did my meeting. The waitress apologised and that was that. I put the meal in the next table (untouched) having told the waitress that it doesn’t matter and I will get something later. She decided to simply leave the burger and fries in the table next to me. Failing to clean up during the 50 minute meeting. Once my client had gone she very kindly came over and offered “to re-heat” the burger. I was obviously gobsmacked and simply assumed her pigeon English meant she meant to say she would get another fresh burger. Five minutes later a re-heated burger and a mixed bowl of cold and fresh chips arrived. I was lost for words", "date_of_review": "3 April 2019"}
{"review_id": 83, "restaurant_id": -13, "username": "AcropolisLover", "date_of_visit": " April 2019", "rating": "4", "title": "Cocktails with a different view of Trafalgar Square", "comment": "Came here for pre-dinner cocktails. (eating elsewhere) Not the cheapest, but reasonable for central London with some great and different views.  Spicy Espresso Martini was excellent. Nice, friendly and helpful staff", "date_of_review": "6 April 2019"}
{"review_id": 84, "restaurant_id": -13, "username": "martinbudds", "date_of_visit": " February 2019", "rating": "5", "title": "Great Valentines meal in a fabulous venue", "comment": "The view from the roof top over Trafalgar square and the National Gallery was a fantastic start to the evening. The service and the food was amazing. Overall a great evening.", "date_of_review": "28 February 2019"}
{"review_id": 85, "restaurant_id": -13, "username": "annabelbp88", "date_of_visit": " March 2019", "rating": "5", "title": "Cocktails with a view", "comment": "Having previously turned up hoping for a table with no joy I booked a table online this time.  At the time of booking I was required to input my card details as a ‘no show’ fee would be charged. Probably a bit ott taking a deposit just for a drink but hey ho.  The rooftop is small so this is presumably why a security deposit is taken. Cocktails are pricey and yes, there is a service charge but this is a premium central London bar with a lovely view of the skyline. This certainly isn’t a run of the mill kind of bar. All other London rooftop bars come with a price tag and a service charge, you pay for what you get.  Staff were friendly and provided blankets to keep cosy whilst sat outside.  I had a great time at the rooftop st James taking in the views and having a great cocktail. I actually thought it was good value for money. I would recommend this bar and hope to return soon. ", "date_of_review": "21 March 2019"}
{"review_id": 86, "restaurant_id": -13, "username": "X4983KRmichelled", "date_of_visit": " April 2019", "rating": "3", "title": "Cocktails with a view if you are lucky ", "comment": "This bar has amazing views over London, we booked in advance asking for a table with a view but unfortunately ended up with one in the middle of the bar. Some people left so we managed to move to get a little bit of a view of Trafalgar square but not the best view. Nice cocktails but expensive, this wasn't unexpected, we knew we would be paying for the view but just a shame we didn't get it ", "date_of_review": "27 April 2019"}
{"review_id": 87, "restaurant_id": -13, "username": "Richb61", "date_of_visit": " April 2019", "rating": "1", "title": "Poor service", "comment": "We Had to give CC details to reserve a space at the bar for 4 off us and was told a fee would be taken if we did not turn up, was given the time of 5.15pm on Good Friday. When arriving we was taken to the bar at the back of the rooftop that has very little view of London, was not aware that there was 2 parts to the rooftop bar. One with a view and one without so not a good Start, would have thought that when booking a table that would ensure you had one with a view and this is something that you should be made aware of when booking that you may not get a table with a view. Ordered some drinks Easter special and a Nearly 310. And a bottle of processco , The Easter special looks nice a bit sweet for my taste, the Nearly 310 yet again a bit sweet and I could not taste the Rum in it at all. The worst thing was the bottle of Processco was served warm which in a 5star Hotel is not acceptable,  1. I do not understand why the bottles would be stored in a warm location 2. I do not understand why any Barman would think it’s acceptable to serve a warm bottle. 3. Why the Waitress thought it was acceptable to open and pour 2 glasses out when she must have felt that bottle was not chilled This is very poor service from the bar staff and you wonder how well they have been trained. We complained and another bottle was brought over this was colder still not as cold as I would expect but just about drinkable, we complained about this and the fact we did not have a table in the area that we thought we had booked and after a few minutes we was moved to the nice part of the rooftop terrace and now had a view. Ordered a spiced espresso martini and a Mojito I had the martini had a nice taste of the spiced rum. But the foam on the top had what tastes like ice crystals init not what I would expect at all once these had melted it was quite a nice drink Ordered some food Chicken Karage buns, Salmon Bread, Artichoke Flatbread, Fries. All nice if quite small portions for the money charged. Then had a Bye Bye Ben and Toast Larger, The Cocktail this time we a excellent nicely flavoured the grapefruit bitters working well with the Gin, My Mate really liked the larger so at least we had one good drink. The View from the rooftop section of the bar we ended up in was fantastic, but I felt the service was slow there only seemed to be 2 waiters working which is not enough for the amount of tables in this section , we had to keep asking for the drinks menu as its not left on the table, we also seemed to be the only table that didn’t get any nibbles put out with our drinks. We’d spoke to a lady called Pau ?? Who I believe was the under manager on call this evening and the help from her was amazing it was because of her we did not end up walking out when the warm processco was served up, we brought all these issues up with her nad she was the one who ensured we got moved to the nice part of the bar and ensured the cost of the bottle of processco was taken of the bill, she is a asset to the Hotel was very apologetic about our issues. I have drunk in many of the best cocktail bars in London. The Dandylyan, The Rumpus Room, The Ned, Bar Swift, The American Bar. The Beaufort Bar to name a few and these are all in a different league to the bar here. The View is worth going for but that’s about all I can recommend it for", "date_of_review": "21 April 2019"}
{"review_id": 88, "restaurant_id": -13, "username": "Balex27", "date_of_visit": " February 2018", "rating": "3", "title": "Rooftop bar", "comment": "Cool bar, amazing views and location. Bar food mediocre, I had crispy duck bao bun, tasted like fish and wasn’t crispy. Service terrible. Definitely worthwhile stopping by for one drink, just manage your service expectations.", "date_of_review": "15 February 2019"}
{"review_id": 89, "restaurant_id": -13, "username": "LadyFM", "date_of_visit": " May 2019", "rating": "1", "title": "Woefully lackimg", "comment": "Yes the view was fab and the cocktail prices were as expected but that was as good as it got. Despite booking ahead they originally seated us on a high table right at the entrance to the rooftop. We asked to be moved and they had to clear away dishes from an empty table in the sun. We had to be asked twice to be served drinks and 3 times requested tap water. The toilets ran out of toilet paper and soap - no one replenished and there were plenty of complaints. The plant life needed some care and attention for sure. I wouldn’t return again having spent £130! ", "date_of_review": "1 May 2019"}
{"review_id": 90, "restaurant_id": -13, "username": "Scarlet Andrea G", "date_of_visit": " April 2019", "rating": "4", "title": "Beautiful views", "comment": "Went for drinks and dinner before a theatre trip. Views were stunning. Clean and tidy. Food was great, had fish and chips, limited menu. Staff were fine but not over friendly and busy so had to wait for orders to be taken.", "date_of_review": "2 May 2019"}
{"review_id": 91, "restaurant_id": -13, "username": "Linda J", "date_of_visit": " December 2018", "rating": "2", "title": "Over priced", "comment": "Visited the Roof Top for a birthday treat. Paid a lot of money to make a reservation but couldn't get onto the tables that overlooked the lovely view. We instead had a table at the back of the restaurant and all we viewed was the kitchen and a wall. Couldn't say that the service was that good as we went to the bar ourselves. The actual service charge was astronomical. One good point is the cocktails were lovely but do not think we will be repeating the experience as It was a great let down.", "date_of_review": "2 December 2018"}
{"review_id": 92, "restaurant_id": -13, "username": "giuliomeluccio", "date_of_visit": " February 2018", "rating": "5", "title": "Amazing", "comment": "Bit expensive but really good place to have a drink with friends or partner. The view is amazing and you're in the heart of the town.", "date_of_review": "16 January 2019"}
{"review_id": 93, "restaurant_id": -13, "username": "DebraZebra_9", "date_of_visit": " December 2018", "rating": "4", "title": "Book in advance even just for drinks ", "comment": "Made an online drinks only reservation for 12, which seems to be opening time for this rooftop bar as we had to wait to exact time before taking lift as they were getting things ready. We're shown to bar seats direct edge terrace for great views of all main London sites. Trafalgar square, big Ben, shard, London eye. Definitely great to see this view. Ordered a champagne cocktail and a boozy bye bye Ben short. £15-£18. Waitress didn't know which which even though champagne was served in a flute. A little training in order. A complimentary bowl nuts provided and blankets if a chill. Had some light rain and the awning came over.  I ordered a side of salted edamame beans, never tried before but arrived looking like sure snap or mange tout. However I quickly found out you should not eat the shell. Maybe the waitress should not assume customers know this. Toilets located in basement as you leave were well appointed with individual cloth towels.", "date_of_review": "12 December 2018"}
{"review_id": 94, "restaurant_id": -13, "username": "ChloeDilworth", "date_of_visit": " December 2018", "rating": "5", "title": "Perfect for drinks", "comment": "Visited the rooftop on Saturday evening having previously made an online reservation. On arrival we were seated in the gallery as staff said there were no tables available outside and when we asked about being moved if one came available the waitress appeared surprised that we had made a reservation but were seated inside. After speaking to the person in charge we were shortly moved when a table became available and staff were very apologetic. It was apparent that the tables outside were like gold dust and you had to move quickly to get one. Once settled we had a lovely evening. The view is amazing, especially at night. The heaters made it nice and cosy and we spent the evening enjoying the beautiful skyline at night. Would definitely recommend!", "date_of_review": "9 December 2018"}
{"review_id": 95, "restaurant_id": -13, "username": "Jonny824", "date_of_visit": " December 2018", "rating": "5", "title": "Definitely worth going", "comment": "I went there a week ago, and it was lovely! It was cold but you get blankets an the views of trafalger sq make up for it! It would be lovely if you could get there in summer to get a view of sunset but either way it's worth going. The food is good, service is great and everything is clean and tidy. It can be expensive, so make sure you are going after pay day, but definitely worth visiting and great for a special occasion.", "date_of_review": "13 December 2018"}
{"review_id": 96, "restaurant_id": -13, "username": "Lyra-Will", "date_of_visit": " November 2018", "rating": "5", "title": "Thank You, for making a Special Occasion even more Special.", "comment": "Hi Federico and the team at The Rooftop St James,  Thank You ever so much for making our evening so special. It was a special weekend in London for my wife’s birthday and we had been to the theatre earlier and spent the rest of the evening at The Rooftop.  The weekend was very important to us as we were invited to the 1st world war centenary parade on remembrance day at The Cenotaph by the government. I booked your Rooftop and we were extremely happy with the perfect location and most of all the excellent and friendly service from you and the team.  You all made a perfect weekend even more special. Thank You and a Merry Christmas to you all. We will definitely be back.", "date_of_review": "18 December 2018"}
{"review_id": 97, "restaurant_id": -13, "username": "Sally_Steve_W", "date_of_visit": " December 2018", "rating": "5", "title": "A great rooftop bar", "comment": "We have wanted to visit for a while now. A great place for a drink, with views over Trafalgar square. It was a wet day when we visited but did not spoil the experience. Cannot wait to go back in the summer.", "date_of_review": "19 December 2018"}
{"review_id": 98, "restaurant_id": -13, "username": "lebjames", "date_of_visit": " December 2018", "rating": "5", "title": "check this out!", "comment": "sexy place, fantastic drinks and woow , so many views . Everything is perfect for a memorable night out with friends. great spot and night out, thats for sure.", "date_of_review": "27 December 2018"}
{"review_id": 99, "restaurant_id": -13, "username": "532lloyds", "date_of_visit": " December 2018", "rating": "5", "title": "What a view", "comment": "Roof top adjacent to Trafalgar Square, brilliant views of London. Indoor and out door areas, blankets available and numerous gas heater. Bar food available really enjoyable.", "date_of_review": "15 January 2019"}
{"review_id": 100, "restaurant_id": -13, "username": "Pazza1718", "date_of_visit": " December 2018", "rating": "3", "title": "Roof Top Bars", "comment": "There are many roof top bars in London with far better views. This bar overlooks Trafalgar Square which you only see if you get a table on the perimeter of the wall. The cocktails are quite expensive. I would say its worth visiting once, just to say you've been. ", "date_of_review": "7 January 2019"}
{"review_id": 101, "restaurant_id": -13, "username": "Jackie292929", "date_of_visit": " November 2018", "rating": "5", "title": "Perfect", "comment": "We visited for a cocktail before a meal in the restaurant. It was a great experience - lovely staff, excellent cocktail and a wonderful view.", "date_of_review": "28 November 2018"}
{"review_id": 102, "restaurant_id": -13, "username": "G4494INricharda", "date_of_visit": " November 2018", "rating": "3", "title": "Once only ", "comment": "Visited here last night. Welcoming reception and sent up in the lift. Seated right away with a lovely view over T Square. Waiting staff were friendly and professional. Drinks werent up to scratch for the $$$ bit pricey. I had a martini and only got half a glass full. My next cocktail was also unimpressive given the price. We had a nibble, chicken soft Chinese bun things. Again, expensive for the quality. My bun was wet and claggy. Overall it was a lovely experience, but wouldn't return as the quality of produce for the price is not up to expectations of such a landmark hotel.  Toilet were clean. Well worth a visit for a date night. Four cocktails and a little nibble £85", "date_of_review": "3 November 2018"}
{"review_id": 103, "restaurant_id": -13, "username": "340lakshita", "date_of_visit": " October 2018", "rating": "5", "title": "Fabulous views and great service.", "comment": "It was my first visit. The views were amazing from the rooftop. I was met at the entrance by one of the hosts and shown to the table on the edge of the bar. Once I sat down and order my drinks and food I had a little time to look around and take some pictures. When I was doing this Leanne Trataris noticed me and came over to ask if I need any help. I was happy to had this happen since I was there to see if I can come back another day with a larger group. Leanne then shown me around and explained all the details of the different locations and the dinning options. I was quite happy of the details and by that time have had the opportunity to taste some of the food that I ordered. I booked a venue for a future date and left extremely happy that I have discovered a great location with a fabulous food and superior service experience with a great bunch of staff that's really well tuned to the customer needs.", "date_of_review": "8 November 2018"}
{"review_id": 104, "restaurant_id": -13, "username": "Muffin_St_Patience", "date_of_visit": " November 2018", "rating": "5", "title": "Great view", "comment": "great view, not too expensive and not too full - amazingly. there was a bit of uncertainty about being able to get a table outside but they managed to find one in the end. Nice for dates.", "date_of_review": "6 November 2018"}
{"review_id": 105, "restaurant_id": -13, "username": "gerrym624", "date_of_visit": " November 2018", "rating": "2", "title": "Mortgage needed ", "comment": "I have been here once before and thought it would be nice to return. Weather wasn't great but blankets (when they eventually arrived) were warm. Service Haphazard and two identical drinks (served at different times - my friend arrived after me) were completely different. Difficult to get waiters attention and had to ask a few times to get things. The £60.75 price for 3 G&T's and a soft drink was eye watering! Especially having a £6.00 service charge! What service? I would have argued but it took us all our time to get the bill and we had trains to catch. View was nice but not that nice. ", "date_of_review": "19 November 2018"}
{"review_id": 106, "restaurant_id": -13, "username": "MELANIE N", "date_of_visit": " November 2018", "rating": "5", "title": "Rooftop Gem", "comment": "Lovely Rooftop bar with fantastic views over London. The bar had a nice chilled vibe and I had an amazing Cosmopolitan!", "date_of_review": "13 November 2018"}
{"review_id": 107, "restaurant_id": -13, "username": "sillarssj", "date_of_visit": " November 2018", "rating": "5", "title": "Superb watching dusk fall over Trafalgar Square and beyond.", "comment": "We met friends for a drink, mid November around 4pm. Sipping champagne on the Rooftop, with helpful staff, good service and warm blankets for those of us who feel the cold was excellent. Dusk fell and the views over nighttime London were excellent. We will be back. ", "date_of_review": "19 November 2018"}
{"review_id": 108, "restaurant_id": -13, "username": "Phil W", "date_of_visit": " November 2018", "rating": "5", "title": "Special evening !", "comment": "I proposed to my girlfriend at The Rooftop a couple of weeks ago. It was a perfect setting. The views were stunning as you sit outside on the terrace and there was also heating, so despite it being a chilly evening it was still good to sit outside. The staff were really friendly and helped take some photos of the moment when I proposed. They then bought us out some champagne and deserts on the house. We really did have a special evening . The drinks / cocktails selection is really broad but they also had beers / ciders too. Will definitely be back again soon. Phil", "date_of_review": "22 November 2018"}
{"review_id": 109, "restaurant_id": -13, "username": "jillb789", "date_of_visit": " November 2018", "rating": "5", "title": "Excellent 30th Birthday Celebration", "comment": "The staff were lovely and they surprised us with a delicious birthday treat, which was most unexpected, but they must have noticed that we were having a family celebration. The cocktails were very nice, the heaters were on and we had blankets. With brilliant views, all in all a great experience.", "date_of_review": "26 November 2018"}
{"review_id": 110, "restaurant_id": -13, "username": "Monkey168", "date_of_visit": " October 2018", "rating": "4", "title": "Great view", "comment": "We are staying at the hotel and decided to pop in for a drink. What an amazing view.  Drinks are not cheap but you are in one of the best restaurants in town. Totally amazing view. Gotta visit ", "date_of_review": "31 October 2018"}
{"review_id": 111, "restaurant_id": -13, "username": "C3475IYsallyw", "date_of_visit": " November 2018", "rating": "5", "title": "Lunchtime visit", "comment": "What an excellent lunch we had on Friday.The service was exactly as it should be friendly and attentive but not rushed or hurried. Our 3 courses were throughly enjoyed and we thought the portion sizes were generous. All finished off with a fabulous cocktail on the rooftop. Superb value for money", "date_of_review": "27 November 2018"}
{"review_id": 112, "restaurant_id": -13, "username": "StephS1997", "date_of_visit": " October 2018", "rating": "1", "title": "Disappointing", "comment": "I booked in advance for drinks at the rooftop bar, from the description on the website i was expecting an open rooftop with heaters and blankets provided while you enjoy the view. As my boyfriend and I walked in i was shocked to find there was no open rooftop like in the the pictures on the website,it looked like a standard bar with nothing special to any other in London. I also requested for seats by the edge for the best view of Trafalgar square. As it wasn't very busy i expected a good seat, we then got to our seats and realised the view was terrible. We were facing a building and could see Trafalgar sq out of the corner of my eye,there were sliding glass windows in front of us which made no difference once opened as the view was still of the side of a building.  We were sat there 20 minutes before a very moody waiter walked past and I asked him if we had to go up to the bar to order, he said no and hesitantly took our order. Drinks are also around £15 each which i wouldn't have minded paying if there was a nice view and atmosphere but there wasn't. I also let them know whilst making my booking that it was my boyfriends birthday, having read the previous reviews i expected something nice to come out for him, this never happened and was really disappointing. Overall, it was really disappointing and i would not recommend coming here.", "date_of_review": "9 October 2018"}
{"review_id": 113, "restaurant_id": -13, "username": "lizs436", "date_of_visit": " September 2018", "rating": "5", "title": "Cocktails with a view!", "comment": "We wanted somewhere to take great friends to thank them for a great night out. The Rooftop was the ideal location for this activity, with its great view of Trafalgar Square and surrounding area, attentive service and excellent nibbles - the Tempura broccoli was delicious.", "date_of_review": "10 October 2018"}
{"review_id": 114, "restaurant_id": -13, "username": "BoldlyGO", "date_of_visit": " September 2018", "rating": "5", "title": "Great experience ", "comment": "So near to Trafalgar Square and even on a dull day a great view. Blankets are provided for chilly moments! Staff were very friendly and helpful and both the food and wine were just right. It’s not a cheap venue but well worth it in my opinion. I will be back in December to test out the blankets!", "date_of_review": "11 October 2018"}
{"review_id": 115, "restaurant_id": -13, "username": "stevebF1847TS", "date_of_visit": " September 2018", "rating": "4", "title": "Rooftop drinks", "comment": "Went here for a few sticks on a sunny afternoon and managed to find a spot in the sun, a lot was in the shade of low October sun.  Fantastic views. Drinks ok but nowhere near the likes of some other great hotels like Claridges or The Dorchester.  We were given a table for one hour but the service was slow and the waitresses favoured chatting at the bar over seeing to guests. It cost me about £70 for 4 cocktails and the 12.5% service charge which was expensive but the views and sun made it worthwhile.  However, it's ticked off now and I would not return. If you want good, expensive drinks go to the bar at The Dorchester.", "date_of_review": "12 October 2018"}
{"review_id": 116, "restaurant_id": -13, "username": "3PW", "date_of_visit": " September 2018", "rating": "4", "title": "Fab location for a rooftop bar", "comment": "Very lovely hotel In a brilliant location. Decor looks new and trendy. Breakfast excellent, as was our room. Cool rooftop bar with views of Trafalgar Square. Service attentive. Good value and recommended...", "date_of_review": "14 October 2018"}
{"review_id": 117, "restaurant_id": -13, "username": "AndrewDK83", "date_of_visit": " August 2018", "rating": "5", "title": "Fantastic service with a view", "comment": "My friends and I had a marvellous experience on the rooftop bar. The service was impeccable and the team were able to accommodate our late arrival due to transport issues. We were greeted warmly and felt so welcomed for a few cocktails. I can’t rate the service we received highly enough. I enjoyed it so much I plan to return this weekend. The view is stunning. Especially when day turns into night. London has never looked so beautiful.", "date_of_review": "15 October 2018"}
{"review_id": 118, "restaurant_id": -13, "username": "Nb197", "date_of_visit": " October 2018", "rating": "2", "title": "Could do better", "comment": "Great view and location but waited too long for drinks, Barman not making certain cocktails that day, not being advised of that until after waiting 20 minute fir it and very average drinks in comparison to the very high prices! Won’t be going back", "date_of_review": "21 October 2018"}
{"review_id": 119, "restaurant_id": -13, "username": "JamesSteel", "date_of_visit": " October 2018", "rating": "2", "title": "Beautiful Views, slow service ", "comment": "I love a sky bar and visited many in Asia, this is a stunning view and a very clean bar. The service was extremely slow first order for two cocktails took over 30 mins, The bar was not even busy! I thought when asking for the bill this would have been super quick 20 mins later!  I wish I could come back but since the cocktails are on the higher end of the budget the pace of the service is a huge flaw and though normally happy to pay that price... not so happy when the service is so poor! ", "date_of_review": "19 October 2018"}
{"review_id": 120, "restaurant_id": -13, "username": "Jerry W", "date_of_visit": " October 2018", "rating": "5", "title": "Drinks with a view ", "comment": "What a great place to sip a G&T with my brother in laws at midnight, overlooking Trafalgar Square and the London skyline Excellent service and range of Gins We will be back  JW ", "date_of_review": "25 October 2018"}
{"review_id": 121, "restaurant_id": -13, "username": "Mundia M", "date_of_visit": " October 2018", "rating": "5", "title": "Birthday visit with A friend", "comment": "Came to the Rooftop on Friday with a friend for some drinks as a late birthday celebration. What a fantastic day! the sun was actually shining and the cocktails were amazing. The staff were all so friendly and attentive. (If I remember her name correctly), Leanne was extremely helpful and showed us around the whole Rooftop. She was so friendly and really made us both feel so welcome. Fantastic! Will definitely be back! ", "date_of_review": "9 October 2018"}
{"review_id": 122, "restaurant_id": -13, "username": "weloveaz", "date_of_visit": " September 2018", "rating": "2", "title": "Can't beat the view but we had issues", "comment": "I will first say that when I stayed last year at the Trafalgar the rooftop was being refurbished. With this visit, because it was a last minute trip, the hotel was sold out and we stayed elsewhere.I still wanted to see how the Rooftop turned out after refurbishing and it did not disappoint. (until...) First visit at the rooftop: We dined in Chinatown and then walked by the Rooftop and stopped in on the odd chance that there would be a table. There was! Drinks and nibbles were reasonably priced, and as it got chilly, staff brings around blanket for the guests. (if you have a good waiter/waitress. We did not). If I had to rate this first visit, I would still say it was a FIVE. We enjoyed ourselves so much that we stopped by concierge on our way out so we could make a reservation for our last evening in London to celebrate this trip. Our reservation confirmation arrived by email. Our final evening we checked in with the concierge and were allowed to take the lift upstairs. (yes, you do stop and get permission before riding up). We were then greeted and asked if we could sit on the railing, which is a bar like area with the most direct views over the glass. We were told that not only could we not sit there, but there was no seating at all out on the rooftop. (Huh?!) We explained that we had a reservation and were told that having one did not necessarily guarantee we would be sitting outside. Isn't that the whole point?? We were taken to an inside area with ZERO views and told that we could walk outside and take photos if we liked but had to leave our drinks inside. After expressing our disappointment, there was still no apology, just a reiteration of the fact that a reservation did not guarantee we would be outside. Well...they certainly should tell you that when you make a reservation. When there is a service failure, the mark of good service is how to make it right. They could have offered a little in the way of compensation...perhaps comp one drink or a small nibble. That may or may not have altered our decision to stay. When nothing was forthcoming, we made our decision to leave. Clearly, we expected better from a property of this caliber.", "date_of_review": "15 September 2018"}
{"review_id": 123, "restaurant_id": -13, "username": "SalMTravels", "date_of_visit": " September 2018", "rating": "5", "title": "Great bar", "comment": "This was the bar in our hotel or more accurately on top of our hotel. We enjoyed the views, the excellent wines and company during our visit. ", "date_of_review": "12 September 2018"}
{"review_id": 124, "restaurant_id": -13, "username": "Ariën D", "date_of_visit": " September 2018", "rating": "5", "title": "Snazzy spot for some alternative views of the city", "comment": "Had a very friendly welcome, all the staff are super professional. Great food and drinks matched the impeccable views of the city.", "date_of_review": "16 September 2018"}
{"review_id": 125, "restaurant_id": -13, "username": "HelenS2907", "date_of_visit": " September 2018", "rating": "3", "title": "Good Views But...", "comment": "This was my second visit to the rooftop bar, and the views are amazing. However this time we were disappointed at the lack of bubbles in our prosecco, we were informed they were poured from a new bottle but subsequently our second glasses were obviously freshly poured. I do feel at the price you pay they should have just replaced the first ones. They did a lovely surprise birthday coconut ice cream sweet which was well received. Nice venue, could do with some more shade which was the issue at my previous visit luckily we didn't stay long that time.", "date_of_review": "18 September 2018"}
{"review_id": 126, "restaurant_id": -13, "username": "lorrainelock", "date_of_visit": " September 2018", "rating": "5", "title": "Birthday Lunch", "comment": "Fabulous bar , great views , food was excellent . drinks were lovely in the September sunshine , Will be back L xx", "date_of_review": "18 September 2018"}
{"review_id": 127, "restaurant_id": -13, "username": "tkbtk_london", "date_of_visit": " October 2018", "rating": "1", "title": "Awful experience, wonderful views", "comment": "I never write reviews but my visit to this place left me feeling fuming so I wanted to share it here. I first tried to visit this place with my girlfriend on a summer evening and was told there would be a 2-hour wait so we gave up. I decided to visit again for a second time tonight, 9pm on a Wednesday evening. The bar downstairs was literally empty, so we thought we might have better luck finding some space at the rooftop bar as well.  The reception guy could not reach the bar staff on the phone, so when a couple left while we were waiting, he just prompted us to use the lift to get to the bar. When we arrived upstairs, there was nobody at the (second) reception area, so we went on to sit on one of the available tables outside. Indeed the views looked very nice, with a summery vibe and a partial view of the London Eye.  In about 2 minutes, a young gentleman (can't tell if he was the host or a waiter, most probably the former) asked if he could help us. We asked if we can order and he said yes, so we went on and ordered 2 glasses of wine. Then he paused for a while and asked how many of us would be. I said that a friend might join us, as I was waiting for his response - the table had 4 seats and it was 2 of us so far. And then the magic happened: He just said the table was reserved and we should go either inside (!) or go to another terrace at the back, which many other reviews have described, that was empty and without any character or views. Under different circumstances we might have stayed, but I just didn't understand how we were told this only after we placed our orders? So we left, obviously, as I didn't want to make a scene. Now, reading the rest of the reviews I don't understand how you cannot reserve a specific table outside when you make a booking, and despite that, our table was specifically reserved for someone else, at 9pm, on a Wednesday night.. It kind of sounded lame and made me feel like I was unwanted for some reason. Luckily I have been to many similar establishments in London or New York, so I don't think it was something about me specifically, rather than most probably our choice of drinks which would result to a lower bill than eg. 2 cocktails and dinner. I am completely discouraged to try to visit this place again - not to worry I guess, it's in a very touristy area so there's always going to be demand for it, which is why they can get away with this attitude.  Good luck who those who try it - for the rest, there's plenty of rooftops around (even had a better experience at Radio Rooftop Bar, which I rank very very low in terms of service and attitude).", "date_of_review": "3 October 2018"}
{"review_id": 128, "restaurant_id": -13, "username": "Ozgurturgay", "date_of_visit": " September 2018", "rating": "4", "title": "Amazing View", "comment": "It's a great location to spend some time. I didn't have a chance to try food because of their kitchen was closed for some reason at that day. But the coctails was very good and view was perfect. But you have to make reservation other wise you could send back from the door. Entrance is from hotel entrance.And also as the other London places it's expensive", "date_of_review": "28 September 2018"}
{"review_id": 129, "restaurant_id": -13, "username": "cynthiata", "date_of_visit": " September 2018", "rating": "5", "title": "Views to die for... great cocktails.", "comment": "We stayed at the hotel and we went here for cocktails after a day of sightseeing... really worth it - you have a perfect view of London's trafalgar square, the city and london eye in the distance. ", "date_of_review": "27 September 2018"}
{"review_id": 130, "restaurant_id": -13, "username": "Lesley H", "date_of_visit": " September 2018", "rating": "5", "title": "A fabulous find", "comment": "Went here to celebrate husbands birthday after a lovely day sightseeing. Lovely place. Lovely staff. Well looked after. Fabulous views.", "date_of_review": "23 September 2018"}
{"review_id": 131, "restaurant_id": -13, "username": "Kezzler", "date_of_visit": " September 2018", "rating": "5", "title": "Great view and lovely place", "comment": "We booked a table here as a treat for our 2nd wedding anniversary on our day out in London.  The view is amazing and we were really lucky to have a beautiful weather day.  We ordered a couple of dishes from the menu, its a tapas style menu (around £10-14 a dish).  The food was amazing and really tasty. And really nice to just pick at as you are chatting and looking at the fab view. The staff are brilliant, attentive without being intrusive and friendly.  I am glad we booked as I can imagine it gets quite busy. It was a lovely treat for a special occasion and I would definately go back.", "date_of_review": "10 September 2018"}
{"review_id": 132, "restaurant_id": -13, "username": "29lesleyp", "date_of_visit": " August 2018", "rating": "5", "title": "Drinks with a View!", "comment": "We had a really lovely time! The drinks were delicious, the service was charming, the ambience was delightful and the view was stunning!", "date_of_review": "22 August 2018"}
{"review_id": 133, "restaurant_id": -13, "username": "edith1603", "date_of_visit": " August 2018", "rating": "5", "title": "Great place to catch up with friends. ", "comment": "In spite of some awful rainy weather...we had a lovely time catching up with friends. They even turned on the heating and provided throws to cover up as it was unseasonably chilly...  Good choice of food open flat bread sandwiches and baby ribs. Second time there, would go again.... Thank you! ", "date_of_review": "28 August 2018"}
{"review_id": 134, "restaurant_id": -13, "username": "augustrush", "date_of_visit": " August 2018", "rating": "3", "title": "Very expensive for a bar", "comment": "Visited after a very nice dinner across the road. Got to terrace on the roof, spectacular views but prices prohibitive. Suggest only for very special occasions. Wouldn't want to eat there, would be extra expensive I guess.", "date_of_review": "21 August 2018"}
{"review_id": 135, "restaurant_id": -13, "username": "jsp123Essex", "date_of_visit": " August 2018", "rating": "5", "title": "Central London rooftop garden", "comment": "Booked a table here at short notice for drinks. Amazing views across London from Trafalgar Square. Set-up was excellent with comfy seating areas if you prefer. Choice of cocktails, wine, tea and coffee, etc. Service was spot on and made to feel like a VIP from the moment we arrived outside the restaurant.Cannot recommend enough. Also has coverings if it rains, although we went on a perfect Summer day. People complaining about prices, these are in line with any nice bar in central London.", "date_of_review": "25 August 2018"}
{"review_id": 136, "restaurant_id": -13, "username": "CGriffin01", "date_of_visit": " August 2018", "rating": "3", "title": "Spilt drinks", "comment": "Unfortunately our initial enthusiasm for sitting outside in the sun with a fab view of Nelsons Column was quickly dampened when the waitress spilt 2 drinks over my friend. They took a while to respond properly too.   Nice cocktails but overpriced esp when they add service on top. Not sure I would hurry back. ", "date_of_review": "25 August 2018"}
{"review_id": 137, "restaurant_id": -13, "username": "lloydy444", "date_of_visit": " August 2018", "rating": "4", "title": "Great views & lunch", "comment": "Pleasant friendly welcome It wasn’t busy enabling us to sit earlier than our reservation. Luckily the weather was great which added to a superb location for lunch. The tapas style snacks were delicious  Cocktails a good standard The table service wasn’t great clearing courses and interrupted at inappropriate times. Whilst having to chase table water & drinks", "date_of_review": "31 August 2018"}
{"review_id": 138, "restaurant_id": -13, "username": "Mark K", "date_of_visit": " August 2018", "rating": "5", "title": "50th Birthday Drinks", "comment": "I emailed to see if I needed to book a table for my partners 50th Birthday, they advised this as it does get busy, so i booked a table for two and just after arriving the brought over a plate with happy birthday in chocolate with a sweet in the middle, such a nice treat for a special occasion. The service on the Rooftop was 1st class, would recommend this venue for that special occasion.", "date_of_review": "3 September 2018"}
{"review_id": 139, "restaurant_id": -13, "username": "ChristiBee", "date_of_visit": " September 2018", "rating": "5", "title": "Stunning views", "comment": "A lovely spot for drinks overlooking over the London skyline. Quite pricey but you get what you pay for. Staff were very attentive. Food menu offers light bites and snacks. Drinks menu very extensive.", "date_of_review": "9 September 2018"}
{"review_id": 140, "restaurant_id": -13, "username": "twogirls2018", "date_of_visit": " August 2018", "rating": "1", "title": "Expensive, terrible service", "comment": "I understand this place is opposite Trafalgar Square but the prices here are far too expensive for what you get. I ordered a bottle of Sauvignon Black at £48, which was served in pub-style glasses. Ordered the salmon flatbread and it was tasteless (£10) and grilled aubergine (£8) was tiny and it seemed to have been reheated in a microwave. The staff were just wondering around looking to the floor avoiding eye contact. It did not appear to be someone in charge and waiters just gathered behind the bar chatting to each other and ignoring their customers who were waiting to be served. The table next to us just walked out after waiting long time... The main part of the bar is very nice, overlooking the square but it was fully booked and the back room (where we were) was empty without character or atmosphere with just some random plastic olive tress with Christmas lights (in August).  There are far too many roof top bars in London to try that I don't think I will ever be back.", "date_of_review": "20 August 2018"}
{"review_id": 141, "restaurant_id": -13, "username": "Ronald W", "date_of_visit": " August 2018", "rating": "1", "title": "Avoid", "comment": "On arrival we were told by the concierge that we would need to wait an hour and a half for a table at the roof top bar and suggested we had a drink in the lounge on the ground floor. We decided to do that and ordered a bottle of wine to pass the time. After half hour they said we had a table but we could only have it for 45 minutes. We decided to go with it and were told to settle our bar bill downstairs first which we did for £50. Upon exiting the lift on the top floor we were taken past the terrace with the views over Trafalgar Square (the view we were waiting for!) but we were taken to an empty room at the back by the kitchen! We expressed disappointment and asked (a) why we were told we had to wait 90 minutes and (b) why did we only have a 45 minute slot? Nothing added up. After all we gave it ten minutes and drank up and left but not without quizzing the concierge first (who was busy telling others to have a drink at the bar). It became very clear that what they get you (and possibly hundreds of similarly duped tourists) to do is run up a bill in the lounge bar first because when they take you up stairs nobody wants to stay for a drink given that the area at the back is without character and without a view but for a turnover of many other people scratching their heads expressing disappointment but not before running up a £50 bill in the waiting area down stairs. If this was a bank you could probably sue them for misleading; misrepresentation; breach of faith and probably theft. Regretfully though there is no recourse other than to ponder on how we, and no doubt countless others, are royally ripped off. Disgraceful. Avoid avoid avoid.....", "date_of_review": "12 August 2018"}
{"review_id": 142, "restaurant_id": -13, "username": "MarkR386", "date_of_visit": " August 2018", "rating": "5", "title": "The View (and not the TV show)", "comment": "Nice evening spot to take in the sights and enjoy a cocktail or two. Our family ate late night snacks after traveling, and they were all delicious. It can be crowded as you might expect, but as hotel guests, we never seemed to have a problem getting a spot. ", "date_of_review": "2 September 2018"}
{"review_id": 143, "restaurant_id": -13, "username": "ajN948NJ", "date_of_visit": " August 2018", "rating": "5", "title": "Lovely views and great service", "comment": "Excellent location, great service and very good drinks! We signed up for the Champagne Rooftop Flight and loved the display & quality of the fare on offer.", "date_of_review": "14 August 2018"}
{"review_id": 144, "restaurant_id": -13, "username": "Mikegt79", "date_of_visit": " August 2018", "rating": "5", "title": "Drinks after the Theatre with an amazing view", "comment": "Great venue and great staff. We had drinks after the Theatre and the view across London was incredible. Will definitely be back!", "date_of_review": "14 August 2018"}
{"review_id": 145, "restaurant_id": -13, "username": "bree2173", "date_of_visit": " July 2018", "rating": "5", "title": "Top rooftop bar!", "comment": "Wow, what a find... we also went to the pub next door and luckily saw this place. Views are great, but what makes this place excellent is the service and the food!", "date_of_review": "16 August 2018"}
{"review_id": 146, "restaurant_id": -13, "username": "sillarssj", "date_of_visit": " August 2018", "rating": "5", "title": "Early evening drinks with colleagues -excellent alternative to a regular bar", "comment": "Based at the Trafalgar Hotel, by Trafalgar Square, the superb roof terrace has panoramic views over iconic London sights. We were served by Grace who was first class in terms of service, hospitality and had a great smile. The drinks are expensive but not excessive for the location. The atmosphere was good and what a great place to be on a lovely summer evening. Recommend you book and ask for an outside table. Dress smartly and enjoy the occasion.", "date_of_review": "15 August 2018"}
{"review_id": 147, "restaurant_id": -13, "username": "Matthew K", "date_of_visit": " August 2018", "rating": "5", "title": "Great views, great service and very welcoming staff", "comment": "I must say, the staff were incredibly welcoming from the lady who booked for my reservation, to the lady on the front desk on the ground floor, the ladies that showed us to our reserved seating and the 3 waiters that served us throughout our 2 hour stay on the rooftop. All were impeccably polite and friendly and it was lovely that they allowed our 13 year old daughter in until 7pm – thanks for that. There was a Lithuanian waiter that we really warmed to at the end – didn’t get his name…but he was really lovely to us.", "date_of_review": "17 August 2018"}
{"review_id": 148, "restaurant_id": -13, "username": "Karin K", "date_of_visit": " August 2018", "rating": "4", "title": "Defo has the Wow factor ", "comment": "Went on Friday night with my sister (she is local & booked two weeks in advance) once we got to rooftop bar it was amazing, fab views, was really special. We were lucky enough to sit on front row. The views were better than expected. Very welcoming & loved blankets on chairs if you got cold. Staff were lovely but service was very slow. We had a two hour time slot starting at 7pm. We arrived 10 mins early & were told they had had private function & were setting up. They told us to have drink in bar downstairs while waiting & they would call us. (Very expensive bar downstairs £20 for two wines, which we were not allowed to take to roof top bar) They never did & we had to chase a few times. Went in about half hour late but they said they would extend our slot which they did. Ordered a lamb (belly, £10) snack which took over an hour to arrive but once it did it was amazing. After we wanted to order lamb cutlets (starter) but our allocated time slot was running out. They said it was fine & no time pressure. Just as well as that took another hour to arrive. Had to chase a few times & in the end they did not charge us for it. We ended up staying most of the night & left at 11pm so worked out really well. Staff were very friendly & helpful. Would have got 5 stars if service better. Also asked a waitress about some of the buildings in the views & she had no idea. Think it would be nice if the staff knew what the buildings were from the views. Not cheap but think for what you get with views it is well worth it. Bottle of wine starts around £30. Snacks start around £10 & are lovely. ", "date_of_review": "19 August 2018"}
{"review_id": 149, "restaurant_id": -13, "username": "Peter G", "date_of_visit": " August 2018", "rating": "4", "title": "Saturday afternoon", "comment": "Very friendly and helpful staff. Good cocktail options and nice lunch. Very open space on the rooftop. Very nice 3 hours spent. Certainly would recommend.", "date_of_review": "19 August 2018"}
{"review_id": 150, "restaurant_id": -13, "username": "1974nat", "date_of_visit": " August 2018", "rating": "5", "title": "Anniversary lunch", "comment": "Such a lovely find! A Great bar with lovely attentive staff. Amazing views of the city and gorgeous food. Will definitely return and next time to try the cocktails!", "date_of_review": "11 August 2018"}
{"review_id": 151, "restaurant_id": -13, "username": "gandt587", "date_of_visit": " August 2018", "rating": "5", "title": "What a view", "comment": "This roof top bar is one of the best. Great views over the city, lots of choice of drinks and the cocktails are amazing. Very reasonable priced. We would definitely be returning.", "date_of_review": "20 August 2018"}
{"review_id": 152, "restaurant_id": -13, "username": "Chris B", "date_of_visit": " July 2018", "rating": "5", "title": "Great service and food", "comment": "Looking at somewhere for pre theatre drinks for my daughters 18th and having looked at the other reviews, I was a little worried, but I needn't have been as the rooftop bar was fantastic from the quick drinks service to the excellent food. A great time was had by all and the bill whilst relatively high was not unexpected for the views and location. Many thanks to Reena for sorting the table, we will be back.", "date_of_review": "30 July 2018"}
{"review_id": 153, "restaurant_id": -13, "username": "Alexander D", "date_of_visit": " July 2018", "rating": "4", "title": "Amazing drinks and great view", "comment": "I came here whilst i was staying in the hotel. Hotel guests receive priority seating upstairs which is convenient as most bars are full once the working day is over.  Drinks were moderately priced, and tasted fantastic. The views were beautiful. Food was also delicious and reasonably priced.  Genuinely a lovely experience coming here", "date_of_review": "31 July 2018"}
{"review_id": 154, "restaurant_id": -13, "username": "liz1985_11", "date_of_visit": " August 2018", "rating": "3", "title": "Rooftop bar only", "comment": "We visited the rooftop bar on a day trip to London. We had made reservations online and recommend you do as people who walked in on the day did mostly get turned away as there was no space. A bit of a mixed view on the visit. The view is amazing, right over trafalgar square, London Eye etc. However the menu states that they can make any cocktail on request, but all 3 that we requested we were told they couldn't make. (A daiquiri, mojito and a mocktail so nothing too out of the ordinary) staff told us they'd run out of most ingredients and that also about 6 drinks of the menu were also not available. This was at 6 pm so not the end of the evening. Surely the evening is there most popular time so would ensure they were fully stocked? The drinks we eventually chose were nice enough, pricey, but what you'd expect to pay in London. Staff were friendly and location couldn't be beaten but the lack of drinks did let it down.", "date_of_review": "5 August 2018"}
{"review_id": 155, "restaurant_id": -13, "username": "Javier R", "date_of_visit": " August 2018", "rating": "1", "title": "Disappointed", "comment": "This place is very falsely advertised. There is a beautiful roof terrace with views of Trafalgar Square but most guests are shoved in the back area where you may as well be in a basement.  We booked in advance and the people we spoke on the phone were very accommodating. However when we got there we were told the area with the view could never be guaranteed and that they would let us know if a table became available. We kept reminding them but we weren’t seated there until 2 hours after we arrived.  The waiting staff were friendly but the hostesses were frosty. Our food order was forgotten and it was very hard to catch anyone’s attention. The food and drinks were nice, especially the Lords ladies and commoners cocktail.  When we asked for the bill they undercharged us and we told them and it took around 40 mins to get it sorted.  It was a shame we didn’t have an excellent experience because it was a special occasion for us. Unless promised the views that were advertised we wouldn’t come back.", "date_of_review": "4 August 2018"}
{"review_id": 156, "restaurant_id": -13, "username": "Phil B", "date_of_visit": " July 2018", "rating": "1", "title": "Disgusted", "comment": "I attended a friends birthday at this Venue a few weeks back. The table was booked for 6 people and when they arrived it was only set for 4. Myself and my partner arrived a little later than the time the table was booked for and whilst our friends were enjoying their time on the rooftop, we were stood downstairs in reception for no less than 20 minutes waiting to be let up. When we arrived at the rooftop, we were squeezed through a tiny door to our friends. There was only one spare seat and with two empty tables next to us, we took a stool from there to use. A member of staff approached us and told us we weren't allowed to use that seat as there was a reservation on that table and we were to put it back. We asked for an alternative seat to be found, of which we were told they would go and get one from the other side of the bar... another 20 minutes later, one of us was still standing and so we took the seat from the table that had been 'reserved' anyway. We had bought 4 bottles of wine, a couple rounds of cocktails along with some food which arrived in dribs and drabs (all equating to around £500) when Ashley (manager number one) came over to us and said that they had had a complaint from a guest of noise. Whilst we understood, his tone was completely unacceptable and, we felt, rude and aggressive. Later on, after continual scowls from the staff for having an enjoyable evening, we were told that we were still too loud and that it was unacceptable and that we would be asked to leave without finishing our drinks (that we had paid for) if we continued. This in our eyes was completely out of order and we disputed this with him. He then raised his voice to a member of our party and went off to find Cameron (manager number two). Cameron came over and told us that we had been abusive towards manager number one and that we were being given 5 minutes to finish our drinks and leave (at this point we still had a bottle of wine on the table and a round of cocktails). We finished what we could of our drinks and left the venue, going on to a bar in Soho which was, by far, cheaper, less pretentious and with staff that appreciated the customers opinions. Reading the reviews, it seems like this is a VERY common occurrence and whilst each comment has its own templated response of 'we will look into this' I don't feel that ANYTHING is being done about the abysmal, disgusting attitude of those working/managing this venue. We will never be visiting this bar again and have spoken to two separate parties who were considering booking, advising them not to. I would advise the General Manager to seriously look into and consider this issue as continual bad reviews and situations like this will cause a huge downturn. The spot is stunning with the views over London, but this is not enough to ride on the back of if the value, service and attitude of those working there is not dealt with. Please don't invite us back... you couldn't pay me to.", "date_of_review": "3 August 2018"}
{"review_id": 157, "restaurant_id": -13, "username": "helenL7519DO", "date_of_visit": " August 2018", "rating": "1", "title": "Don’t Bother", "comment": "Booked a table in the ‘Roof Top’ bar. Arrived and were directed to an area with no view at all and frankly could have been anywhere.It would have been nice if it was explained to us that the (the very small area) that does have great views was busy so we are going to seat you here etc... It took 20 minutes to be served and even then that was only because I had to ask someone who was milling around not doing much ‘if they work here and if they were not too busy could we please order’ Meanwhile two ladies who had arrived at the same time as us had already given up and had gone. So we asked for two white wine spritzers to which the lady who was ‘serving’ looked blank and asked us to ‘find it in the menu’ as she had no idea what it was. Another 20 minutes later the worst white wine spritzers we have ever had arrived. Ten further minutes later, some wasabi peas  arrived with a different waitress. Asked why the slow service and was told that that evening there was only one barman (it was Friday).... Very bad vibe in this bar, music was also uninspiring.  We paid our bill (£20 - really?) and gazed at the (then closed pub next door) wishing we had made different plans... Between us we have lucky enough to have stayed and been to many nice hotels, restaurants and bars all over the world... Would we recommend this place - No.", "date_of_review": "4 August 2018"}
{"review_id": 158, "restaurant_id": -13, "username": "letiziacs", "date_of_visit": " August 2018", "rating": "1", "title": "Very disappointing", "comment": "Complete fail. I made a reservation, but no one except for reception asked for it. Communication between reception and rooftop was not existing: although we were told at reception that our table is ready, the waiter at the rooftop was unprepared for us and was not aware of our reservation. We were placed at the back of the restaurant with no view and had to wait over an hour until we were able to move to the nice part. The waitress said that not a single table got free in that period, which is hard to believe for a Friday night between 9 and 10pm (considering the 2hour restriction per table). I understand that there are only limited places on the balcony, but the advertisement is completely misleading. Also, the waitress was not friendly when she explained that we cannot move. Moreover, service was really bad and totally unorganised. There was no clear organisation and no one seemed to know who is in charge of what. Accordingly, there were many complaints and long waiting. We ordered a G&T and a cocktail: The G&T came, but we waited 10 more minutes for the cocktail! Not appropriate in a hotel like that. Drinks are too expensive. Overall not worth the money. We will not come back.", "date_of_review": "5 August 2018"}
{"review_id": 159, "restaurant_id": -13, "username": "Chris D", "date_of_visit": " August 2018", "rating": "5", "title": "First date", "comment": "We had a great evening. The staff were attentive, the food was great, and I felt it was reasonably priced – it’s definitely somewhere I would look to come again", "date_of_review": "9 August 2018"}
{"review_id": 160, "restaurant_id": -13, "username": "SunSeeker82_11", "date_of_visit": " August 2018", "rating": "5", "title": "Amazing place!!", "comment": "This was out 4th visit to this bar, we don't feel like we can visit the city without going here. The view is amazing! You need to arrive when it is light, and wait for the sun to go down!  We had a table booked at 8pm on Saturday night for 4 of us to celebrate a birthday.  We arrived 20 mins early but this was no issue.  We didn't leave until 10.15, you could not fault the service, our waiter was lovely! The food was great, much bigger portions than we were expecting for the menu style, the menu states to get 2-3 dishes each, we had 9 between 4 of us and we couldn't finish, I would order less and you can always get more if you want to, the food came very quickly!  Lovely little touches like blankets when it gets dark.  Price wise, I would say its what you expect to pay for the location - 2 bottles of wine, 2 ciders, 9 dishes and 2 deserts was £200. In my opinion, it's a must when you are in London!", "date_of_review": "6 August 2018"}
{"review_id": 161, "restaurant_id": -13, "username": "Paul K", "date_of_visit": " July 2018", "rating": "1", "title": "Can not recommend", "comment": "I can't believe I had the same poor experience twice. Last time we stayed in the hotel and visited this amazing view of the rooftop bar. They had very short of staff but having said that the tables around us were receiving drinks while our waiter forgot to post our food and drinks into the system. That time they had a half Arabic - Asian manager Azi or Assyz cannot recall the name sorry if I misspell. He promptly sorted out our problem, He apologized and personally looked after us (really professional young man). This type of tiny touch made a Huge difference. We promised him that we will come back and we did come back!! However, in terms of service, nothing changed apart of that the managers are new and they are not friendly. My wife was surprised when none of the managers wanted to speak with us when we ask for it. The place itself is beautiful but having said that you guys need more motivated people like your previous manager or someone who can look after the guests and make them happy!", "date_of_review": "30 July 2018"}
{"review_id": 162, "restaurant_id": -13, "username": "Georgina B", "date_of_visit": " July 2018", "rating": "2", "title": "Good view, appalling service", "comment": "I booked the rooftop for Sunday evening drinks for my boyfriends birthday. When we got there we were shown to a table not next to the side so I asked if we could move for a better view. the guy said no sorry. We ordered drinks and some food and after 5 mins, a spot next to the side became available so I asked if we could move which the waitress said it was fine. After about 3 minutes we were kicked off the table, due to another reservation. We were moved back and our food had still not arrived, meanwhile the table next to us who arrived after, had food arriving constantly and when we asked she said it was coming. 30 mins later the food turns up due to confusion with the table next to us...as I anticipated. When we asked for the bill, she gave us the table next to ours - even she knew it was wrong, not sure why she bothered. When we finally got the right bill I took the service off and said it was appalling. There was no apology. Plenty of other rooftop bars in London, I will not be returning or recommending this.", "date_of_review": "1 July 2018"}
{"review_id": 163, "restaurant_id": -13, "username": "juliesV4116JW", "date_of_visit": " June 2018", "rating": "1", "title": "Disgusted", "comment": "Having made a booking to meet friends over from Australia this was the most dissapointing bar I have ever been to ! We were sat in the back which has no view and you could be anywhere in fact if I'd known there are so many pubs in London with really nice gardens I would have taken them anywhere but here  I asked our waitress 3 or 4 times if she could move us to the front bar but wad just ignored definitely won't go back", "date_of_review": "26 June 2018"}
{"review_id": 164, "restaurant_id": -13, "username": "22alynm", "date_of_visit": " June 2018", "rating": "1", "title": "Disgusted.... ", "comment": "Booked this for me and my girlfriend months in advance for our birthdays, requested a good view, didn’t think the view we would have been given was right at the back, with a view of the next door neighbours fan systems... we requested to be on the balcony to be told it was full and sold out. After 10 mins & a bar bill of £40 in that 10 mins we left. On the way out we WAS DISGUSTED to hear A greeter talking to another greeter saying she had just accepted a walk in who she had sat on the balcony with the views over London.... THIS WAS A BALCONY THAT WAS “SOLD OUT” the place stinks!!! Stay away", "date_of_review": "1 July 2018"}
{"review_id": 165, "restaurant_id": -13, "username": "SunshineBlonde2014", "date_of_visit": " July 2018", "rating": "1", "title": "Can I score it a minus?", "comment": "After checking the website daily for a number of weeks, finally I was able to book the date I wanted in mid july when they were made available in May. I emailed with a couple of requests over the following weeks and received emails back to say that requests had been noted and would be met if possible. I then phoned a couple of weeks ago to make an amendment to the booking, I was told this was fine and confirmed Today I receive a voicemail advising that due to a clash on the booking system, my booking was to be cancelled..... I phoned to check this and was told that the table I required was indeed available, and instantly received an email to confirm my booking. I then immediately receive another call from the bar to advise my booking was to be cancelled? This was within minutes of the confirmation email being received I asked how there could be a booking clash when I booked early morning on the day the tables were released? I was told that a booking of 180 people was already in the system and the date shouldn't have been released How can I book a table in May, exchange several calls and emails with staff all confirming the booking over the following weeks, then a week before we're due to attend be cancelled due to a pre existing booking? A booking that clearly no member of the staff other than this one girl was aware of and she decided to conveniently blame it on the booking system? I spoke to two girls from the same bar in a matter of minutes, one said I have the table yet another insists they're expecting 180 guests...Which I don't believe for a second Don't bother booking. This was to be part of a birthday weekend that had been meticulously planned, only for this unorganised, inept, thoughtless establishment to phone up with lies.  Based on the recent terrible reviews, there's a good chance we've had a near miss to be honest. Londons a big city, find somewhere else", "date_of_review": "2 July 2018"}
{"review_id": 166, "restaurant_id": -13, "username": "lucymuncey", "date_of_visit": " July 2018", "rating": "1", "title": "TERRIBLE SERVICE , arrogant and inept staff", "comment": "Booked a table , but took 10 mins for anyone to offer us a drinks menu , had to ask . Drinks took forever . When we were eventually asked for our food order we were then told the kitchen was busy and food would be at least 25 mins but we could get chips a little quicker . Not what we wanted at all and we were going on to theatre so needed it to be quick . I explained this , they apologised , brought us some nuts to have as apology and said no charge . The bill took forever and when it did come was charged £8 for the \"free\" nuts ?!  It has a great view but they REALLY need to get the service and front of house in order. Will not be going again", "date_of_review": "6 July 2018"}
{"review_id": 167, "restaurant_id": -13, "username": "william_hurtado", "date_of_visit": " July 2018", "rating": "1", "title": "Awful customer service", "comment": "We live in South Africa and were visiting London with family on a special vacation. We had found the Rooftop St. James and were excited about going here. We made the reservation in May for July 6th at 6.30 pm for 5 people including my Mum, wife and two kids. I was especially careful to review the entire website to see if there were restrictions about kids, there were none. We travelled into London for our meal, from Pinner (where my Mum lives - costing nearly 40 pounds on the tube) with great excitement. Upon arrival, we were informed we would not be allowed to take our reservation because no kids were allowed after 6.00 pm. I informed the manager of the fact this is not stated on the website anywhere and that this was a special occasion. Despite being at fault, he was unwilling to honour our booking. I have never been so appalled or disgusted by a company's ineptitude or customer service. I sincerely recommend avoiding this place in order to avoid the disappointment me and my family had to experience!", "date_of_review": "8 July 2018"}
{"review_id": 168, "restaurant_id": -13, "username": "Steveknight47", "date_of_visit": " July 2018", "rating": "5", "title": "Great afternoon with friends", "comment": "We went for pre theatre drinks/nibbles at The Rooftop on a beautiful sunny afternoon with some good friends. The service was friendly and the cocktails and beer were cold! The finger food was tasty, well cooked and delicious. It isn’t cheap, but the time flew past as the afternoon was so enjoyable. The views are brilliant over Trafalgar Square and the atmosphere is relaxed, just remember to fill your wallet!", "date_of_review": "16 July 2018"}
{"review_id": 169, "restaurant_id": -13, "username": "Young4095", "date_of_visit": " July 2018", "rating": "5", "title": "Superb", "comment": "Popped in for some pre theatre drinks. I must confess to being slightly nervous given some of the reviews.  It was excellent, great service, attentive staff and lovely food (although I only had a snack). Great views in a great location.  All you could want in a rooftop bar.  We will go back. ", "date_of_review": "6 July 2018"}
{"review_id": 170, "restaurant_id": -13, "username": "KentishPrincess", "date_of_visit": " June 2018", "rating": "2", "title": "Nice views but shocking service", "comment": "Beautiful views if you manage to get a table out the front and not in the conservatory area. Book in advance for a 2 hour slot and specify you want the views. If it's full when you arrive then ask to be moved once a table becomes free. We turned up early on a Saturday afternoon but were still allowed up and sat in the conservatory for a short while but were soon moved out to the balcony area and left at our allotted time. It was nice we weren't rushed out, however service was unreliable to say the least. We had several offers to take our order as we first arrived but hadn't been given menus, once we had decided what we wanted there was no-one around. When we finally ordered the 7 drinks, they took an eternity to arrive such that we asked twice where they were and then the most straight forward vodka lime and lemonade took a further two asks. At no point were we asked if we wanted more drinks, we always had to accost someone and then wait an age for them to arrive. Probably just as well given the price of them but on a bright sunny day, we definitely would have consumed more. When the bill came up, we had been charged for 4 drinks we never had. Once pointed out, they were removed without issue but I'd be interested how many people just pay without checking. This place is a lovely retreat away from the hustle and bustle but poor service and staff is really letting it down. Its not cheap, our bill came to almost £300, so I'd spend your hard earned money elsewhere.", "date_of_review": "6 July 2018"}
{"review_id": 171, "restaurant_id": -13, "username": "Gareth P", "date_of_visit": " June 2018", "rating": "1", "title": "Dreadful service from beginning to end", "comment": "Be warned, trying to even make a reservation is traumatic.. I am unable to speak any foreign language with any degree of accuracy, or skill. The same can be said for the reservation teams grasp of English. How many times do I have to repeat a date, and a time, and my name, I have many friends of different nationalities, but I would not employ any of them in a London restaurant if they cannot understand ‘ may I reserve a table for 2 please’. The comms were so bad, they even failed to send my email confirmation, so a day later I called and just to check they had the details, they didn’t know if they had ( what ? ) and promised a grown up would call me back, of course no one called. I emailed the reservation team, they ignored this also. Haha, possibly worst organised establishment I have ever dealt with.", "date_of_review": "24 June 2018"}
{"review_id": 172, "restaurant_id": -13, "username": "JoysAZ", "date_of_visit": " June 2018", "rating": "5", "title": "Fun place for tapas and wine !", "comment": "Great views of London and Trafalgar Square. All the choices for tapas were delicious. Music was great too.", "date_of_review": "6 June 2018"}
{"review_id": 173, "restaurant_id": -13, "username": "bruceabaillie", "date_of_visit": " June 2018", "rating": "2", "title": "Roof top bar", "comment": "Good food but shockingly poor waiters. Really no idea so drinks take a long time and amateur service from what should be a top end hotel based on location and price.  Numerous people left due to lack of service at all and we managed to get served but it took some effort. Manageress intervened and apologised then deducted service charge.", "date_of_review": "10 June 2018"}
{"review_id": 174, "restaurant_id": -13, "username": "benjyk", "date_of_visit": " June 2018", "rating": "4", "title": "Great views", "comment": "We visited mid week around 330 in the afternoon and went straight up to the bar. I have been before but was seated at the back bar not knowing the front bar existed. If you can manage to get a seat at the front of he building you get great views of Trafalgar Square ; Nelsons column and the London Eye. The views from he back bar are less impressive . I had two of the cheaper glasses of wine at £9 a glass. It was decent enough. At the end of the day -you are paying for the view. Very enjoyable ", "date_of_review": "7 June 2018"}
{"review_id": 175, "restaurant_id": -13, "username": "iain c", "date_of_visit": " June 2018", "rating": "2", "title": "Great venue undermined by arrogance and some really poor service", "comment": "So what a stunning location. But Hilton Corporation perhaps you need to remind yourself that you are a global hotel brand and NOT a deeply boutique bar.  I get that you need to restrict access to reservations only. But don't then have a check in desk where you have to wait whilst the receptionist spends 5 minutes on a work call unrelated to the rooftop bar. All she had to do was check a name and reservation for heavens sake ( and this performance was repeated 3 times across our party of 4). Next up - if you are going to close half of the outdoor section to make a Hilton promotional video ( in this case with \"Bastille\" on 9 June) then at least have the courtesy to warn of this both at the time of booking AND on arrival. Had we known in advance we'd have gone elsewhere - but nothing. That said watching some overwrought and over important \"luvvies\" stressing over camera angles was rather amusing. And to be fair to the film crew, they had the courtesy to apologise for the disruption they were causing to us, unprompted. Not a word came from Hilton staff until I complained. Unfortunately our waitress from the bar had presumably spent the morning sucking on lemons and pulling out her own fingernails judging by her face and manner. But let's also call out some positives that suggest how good this location could be. The food, whilst expensive, was very good. The waitress who served the food ( whose name sadly I didn't get) was charming. To aid in positive identification for very positive service, she was of Afro-Carribean heritage - and delightful.  When I complained to \" the lemon sucker\" about the constant interruptions to our lunch, she offered to knock the DISCRETIONERY service charge off the bill. Wow - customer service hits a new low! So step in - at my insistence - duty manager Aziz, who was extremely apologetic, very understanding and generally very impressive. We quickly reached an accommodation over a reasonable reduction to the bill, for which I thank him. So what a great location let down by poor business practice on arrival; corporate arrogance; and one very miserable staff member. That really is somewhat pathetic for a brand like Hilton. Clone Aziz and our food waitress - re-engineer a customer friendly check-in proceed - and put your customers first rather than treat them as an afterthought - and this can be a great venue.", "date_of_review": "11 June 2018"}
{"review_id": 176, "restaurant_id": -13, "username": "Gary S", "date_of_visit": " June 2018", "rating": "4", "title": "Views are a must but.......", "comment": "So thought would try this little rooftop as was in the area. The views are amazing here and this is a great selling point for the bar. Was welcomed by friendly staff and shown to a perfect position over looking Trafalgar Square and shown menu....food looked stunning but not much choice, could do with a few more items , but can not fault the food i ordered The only problem I had here was that when finished my drinks i had to go to the bar as staff not always around, to be told only table service, dont think i should have to wait for a top up ..... Also at end ordered a coffe to finish came , but no sugar so again had to go ask at the bar ....just needs a bit more attention on the guests by staff but this is a must to go. I recon at night this is a special place.", "date_of_review": "11 June 2018"}
{"review_id": 177, "restaurant_id": -13, "username": "Gnfnco", "date_of_visit": " June 2018", "rating": "2", "title": "Not worth it!", "comment": "Photos looked amazing however upon arrival, staff were quite rude and didn’t seem to know much about anything. The exposed rooftop drinking area is non-smoking and if you intend to have a cigarette, you need to go to the entrance of the bar on the ground floor (8 floors lower)  It was also very busy which is expected however despite the view, everything else is just your average bar. Prices are high. Wouldn’t recommend. ", "date_of_review": "18 June 2018"}
{"review_id": 178, "restaurant_id": -13, "username": "kimleighvdw", "date_of_visit": " March 2018", "rating": "5", "title": "Great food and views", "comment": "I visit this rooftop bar quite often. The views are amazing. It is great for lunch or dinner. They have blankets and heaters for colder days. I would recommend booking a table beforehand.", "date_of_review": "18 June 2018"}
{"review_id": 179, "restaurant_id": -13, "username": "l-globetrotter", "date_of_visit": " June 2018", "rating": "4", "title": "I had a great night", "comment": "Perhaps, reading all the reviews now, I have been lucky, and had the fortune smile on me, but returning here for the first time after the refurb, everythingelseis was top notch. I was seated at the Gallery, which affords the most spectacular views of London. The cocktails were great, I had Skyline and Aviation (both good) and barman awesome, he eveb came out from behind the bar to advise what I could have after my other drink. All the staff (boys mostly Italian) were super friendly, and my food waiter, the French girl Dorien lovely. The food was fantastic, pricey but excellent. Tuna on the raw portion of the menu exquisite, miso Aubergine also very good, and Korean beef skewers super tasty! The views are stupendous ( but do ask to sir against the glass in the Gallery are a when booking). Jeffrey the manager was in control, staff treating him, rightly, as a a conductor of sorts. Heartily enjoyed tonight's experience, ", "date_of_review": "23 June 2018"}
{"review_id": 180, "restaurant_id": -13, "username": "NWL72", "date_of_visit": " June 2018", "rating": "4", "title": "Fantastic views over Trafalgar Sq ", "comment": "Ate here on a beautifully hot sunny afternoon. The views are fantastic which is why this review has 4 stars, probably a 3 otherwise.  The food is nice enough although the tempura was greasy, not cooked in hot enough oil!  The wine is nice and all is priced to match the view Worth a visit though ", "date_of_review": "3 June 2018"}
{"review_id": 181, "restaurant_id": -13, "username": "Canadauk2012", "date_of_visit": " May 2018", "rating": "5", "title": "Drinks in the sun ", "comment": "Ok this is my new place to go when coming to London in the summer.  What a great view to just sit and drink wine, cocktails and eat.  Spent a glorious few hours here in the sun  London prices but great view !  Will come again ", "date_of_review": "12 May 2018"}
{"review_id": 182, "restaurant_id": -13, "username": "Sharoonie", "date_of_visit": " May 2018", "rating": "2", "title": "Shame about the service ", "comment": "Great location. But: very poor service.. Very expensive. Automatically put 12.5% service charge for appalling service. Someone needs to get their act together and organise this place which has great potential. ", "date_of_review": "19 May 2018"}
{"review_id": 183, "restaurant_id": -13, "username": "provencepassion", "date_of_visit": " May 2018", "rating": "4", "title": "Hotspot", "comment": "We enjoyed a light lunch in the sun high above the crowds with fabulous views. The food was delicious, but the service was poor. Had to ask for water twice and then we asked for the bill twice. It didn't spoil our experience, but there is a weak link, which otherwise I would have given an excellent score. I Recommend the salmon flatbread and the black cod .... and a glass of Prosseco!", "date_of_review": "15 May 2018"}
{"review_id": 184, "restaurant_id": -13, "username": "Maryana A", "date_of_visit": " March 2018", "rating": "3", "title": "Stick with drinks only. Food is average at tops.", "comment": "Just had lunch at the Rooftop. The view is goid if you are an early bird as we are. Seat with view over london eye and Trafalgar square are very limited and there is a strong chance you will not have it if you arrive 15-20minutes late for your time slot. We ordered food for lunch and it was just ok and certainly not worth the money. Black Cod at 24gbp felt reheated as opposed to freshly made. Beef skewers were okeish but on the level of highstreet take away as opposed to high end bar. Go for drinks only and it will feel an ok value for money.", "date_of_review": "23 June 2018"}
{"review_id": 185, "restaurant_id": -13, "username": "samanthaspry", "date_of_visit": " May 2018", "rating": "3", "title": "BEWARE £5 per head CAKEAGE CHARGE!!!!", "comment": "Working nearby, we used to come here after work regularly, so were pleased to hear it was being refurbished ready to 2018. The refurb has made it lovely and modern, they have also expanded the rooftop to include many more tables - covers and heating options were great for when the weather gets chilly in the evening. Front bar has FAB views over London and Trafalgar Square. However, although the Back bar is still outside, the views are not much to write home about - so make sure you check where you are being seated if you want the view. We went recently in May 2018 for a colleagues birthday. We had a group of 15 people. Menu nice, but \"sharing plate\" options are limited and expensive, plus too small in portion size to be any good for groups over 2 or 3 persons. Service was in general good and attentive. Beware however - they charge £5 \"cakeage charge\", per person. Having bought our own birthday cake from Caffe Concerto, we asked if they could bring a few plates and forks. Despite buying a decent number of bottles of wine, and some sharing foods - when the bill came, we were all shocked at this extra cost. There should have been a warning upfront about this from one of our waiters - as this is a significant extra cost.  As some people had left by the end of the evening, the remaining guests then had to make up the extra costs. Had we known upfront, this could have been avoided. In fact, had we known upfront, we probably wouldn't have bought the cake or chosen this venue to host a birthday party!  Very disappointing end to an otherwise nice bar experience.", "date_of_review": "23 May 2018"}
{"review_id": 186, "restaurant_id": -13, "username": "997kevins", "date_of_visit": " May 2018", "rating": "5", "title": "Kevin & Jane's pre Birthday lunch drinks ", "comment": "This is a fab place with great views over London's skyline. Situated overlooking Nelson's Column it's an ideal, central place to meet. The welcome was warm, the staff friendly and the service fast and efficient. The drinks and food selection was wide and although the prices weren't the cheapest, they were seriously good value given the location and outlook. Well worth a visit although booking might be advisable at busy times. ", "date_of_review": "23 May 2018"}
{"review_id": 187, "restaurant_id": -13, "username": "Lauren22232", "date_of_visit": " May 2018", "rating": "2", "title": "Disappointed with our visit", "comment": "I booked our visit online, but also followed up with an email direct. I managed to book at the time I wanted online however I recieved an email back stating they didn’t have the time or date I wanted. I responded to this saying not to worry I had booked online and managed to get a table. What was odd about this was when my partner and I arrived it wasn’t very busy where we were sat so couldn’t understand why we would have been told there was no tables available via email.  On arrival staff were very unfriendly and also unhelpful. On the cocktail menu it does state you can ask for other cocktails if you wish, when I asked if they could do a cocktail I liked the waitress abruptly said no with no follow up of what they could offer. It took us approximately 25 mins to get our drinks and about 15 mins to get some tap water.  Part way through our visit we asked if we could sit on another table which we saw was free with the better view, our waitress said she’d ask her colleague and come back to us but unfortunately never did.  Even though the view is spectacular from one side of the rooftop we weren’t sat there so didn’t get to enjoy the view. Overall disappointed with the service considering the price we paid for four drinks.", "date_of_review": "28 May 2018"}
{"review_id": 188, "restaurant_id": -13, "username": "Brink100", "date_of_visit": " May 2018", "rating": "1", "title": "Slow service and overpriced mediocre drinks", "comment": "Whilst the view is one of the best to be had from one of central London’s few outdoor rooftop bars, the enjoyment ends there.  The staff were unfriendly. Didn’t feel valued as a customer. The service was incredibly slow and the cocktails definitely were not worth the wait. The chocolate cherry “signature” cocktail was probably one of the most vile yet bland tasting drinks I’ve ever tasted - and I’m including cough medicine in that list. To top it off, they are super-expensive. Be warned!  There are far friendlier bars, that do better mixed drinks, pretty much everywhere else around. ", "date_of_review": "26 May 2018"}
{"review_id": 189, "restaurant_id": -13, "username": "Tim B", "date_of_visit": " May 2018", "rating": "4", "title": "Great views", "comment": "Not a cheap place to go, but the views are excellent. You are paying that bit extra due to the location but it is worth it.", "date_of_review": "28 May 2018"}
{"review_id": 190, "restaurant_id": -13, "username": "ChrisCresswell", "date_of_visit": " May 2018", "rating": "1", "title": "Homeopathic portions delight the palate but not for long", "comment": "So my favourite and well heeled art dealer nephew decides to treat me to a lunch and recommends the Rooftop for the views and the food, he brings all his clients here, I am anticipating a treat. We turn up, can they fit us in, do we have a reservation? no, we'll see if we can fit you in, oh thanks, it appears they can accommodate us which is nice seeing as how the restaurant is half empty, perhaps we could just have been waved up and in but no we have to go through the front desk rigmarole. Fair enough this is Piccadilly after all. \"I want to show the view\" he says but as we turn to step onto the balcony we are told that unfortunately it will not be possible to let us take our lunch there as there is a private function, we were allowed to step out briefly and the view is magnificent. Ah well, we take a table, order drinks which come promptly. I ask for some water with my whisky and am given a glass of water, perhaps there are no jugs available and I'm a dab hand with glass manipulation so I manage manfully not to spill a drop> We are then left alone for a while, quite a while, quite a long while. I appreciate this non pushy waitering style but now i'm getting hungry. So we order, my nephew informs me that the black cod is worth a go and so I agree, lets have it. We chat, we catch up, we drink, we order more drink and realise the meal has not arrived, we have been here half an hour, the waiter checks for us and also I overhear for the table next to us and suddenly the food is with us. I am slightly confused as I am confronted with 3 one inch square pieces of black cod. I look at my nephew, is this a starter or a main course I inquire, he doesn't know, he tells me that last time he came there was a lot more fish on the plate. I ask the waiter. He is not sure so he enquires and returns with the news that this is indeed the main course. I am bemused. The portions are the size of dice set nicely upon 3 strands of grated carrot and a flower of some kind. Is this a new trend I ask my companion, is this a homeopathic restaurant where we are given a brief taste of what the food could be? It is absolutely delicious but at £40 odd a plate I would expect it to be. I snuck a look at his bill, naughty I know but I was fascinated. We decided that we were still hungry and so at 1.55pm we asked if we could order something else. No. What? No the kitchen is not taking new orders, they are dealing with a private function on the balcony and so no more food is available. But those people over there are ordering food? the waiter shrugs. I eavesdrop on the two tables next to me. A waiter has just delivered them 2 plates which they are refusing. they point out that it has taken so long for these dishes to arrive that they assumed they had been forgotten and so they are not interested. The waiter has a hard time understanding their point of view but eventually she takes the food back. At the same time the table behind me asks if they can have their food which coincidentally as luck would have it is the same dish as the tardy food that has been returned. I watch a brief conversation between two waiters and then that very food is presented to the table behind me, they fall on it with cries of delight and relief. Meantime the other table is still discussing their experience, I am tempted to join in but then realise I am too hungry to make any sense, so we leave and I visit a local sushi because the taste of black cod has whetted my appetite. I inquire as to whether my high-spending nephew will be bringing his clients here again. \"I fear not uncle\" he says with a charming smile, \"I fear not. the area is awash with fine dining opportunities\"", "date_of_review": "23 May 2018"}
{"review_id": 191, "restaurant_id": -13, "username": "Michelle B", "date_of_visit": " May 2018", "rating": "5", "title": "10th Wedding Anniversary Surprise", "comment": "My husband surprised me by taking me here for our 10th wedding anniversary and the views over London were just fantastic. We had the fixed menu which consisted of 3 courses and a glass of prosecco. The staff were really friendly and although it was busy, we were not rushed and we could take our time and enjoy the view. The only thing was it was a really hot day and where we sat became a bit of a hot box.  The food was incredible, portions were small, but just right for me and every bite was pure pleasure. I was unsure if the food would be good due to location etc, but it really was excellent quality.  It is not the cheapest experience but it was a real treat to go there.", "date_of_review": "11 May 2018"}
{"review_id": 192, "restaurant_id": -13, "username": "Jenn_the_blonde", "date_of_visit": " March 2018", "rating": "4", "title": "Beautiful view - fancy drinkis", "comment": "We went to the Rooftop for after dinner drinks and to enjoy the view. The view is gorgeous. The drinks are pricy, but worth it if you are out for a special night. It was a chilly night and the blankets they had out on the chairs appreciated.", "date_of_review": "13 April 2018"}
{"review_id": 193, "restaurant_id": -13, "username": "charmainefosker", "date_of_visit": " February 2018", "rating": "4", "title": "Most of it was lovely", "comment": "Arrived for the value 3 courses for £31. Food was good but you might want to order extra side dishes but was brilliant value for money. Went to the open bar area which was amazing with stunning views of London and all the famous landmarks. Outside area has blankets which was a lovely touch. Think they would be onto a winner with more sofa type seats. Loved it and the drinks were a reasonable price for what you get. Only one complaint - the security who paced around most of the evening back and forth and I was actually followed they were also quite rude to me so it spoilt the night after that.", "date_of_review": "10 April 2018"}
{"review_id": 194, "restaurant_id": -13, "username": "Emma495", "date_of_visit": " April 2018", "rating": "2", "title": "Lunch on the weekend", "comment": "I was really really underwhelmed by the service here...The waitress was totally inattentive and seemed inexperienced who served us initially and the person after her not much better - there was no eye contact so hard to get her attention..Amongst our food, most of it was almost cold when it arrived so we sent some of it back and the tempura which came back seemed like it had been re heated in a microwave...I got the impression that the food had been cooked and left for some time before it had been served..The drinks were decent but no olives or celery in the bloody Mary which for £15 seemed a bit lacking in finish...The view was great but generally a very disappointing and over priced experience ...", "date_of_review": "14 April 2018"}
{"review_id": 195, "restaurant_id": -13, "username": "cartier10", "date_of_visit": " April 2018", "rating": "4", "title": "Great spot for drinks in a central location!", "comment": "I was a big fan of the Rockwell bar at The Trafalgar Hotel, and decided to visit the new Roof Top bar for drinks, I must say this bar has some amazing character, not to mention an amazing view. The service is exceptional, attentive and the drinks and food is equal. The bar is situated in a very central location so easy for the theatre, with a great atmosphere, totally recommended, a reservation is adviseable to avoid disappointment!", "date_of_review": "15 April 2018"}
{"review_id": 196, "restaurant_id": -13, "username": "Anne A", "date_of_visit": " April 2018", "rating": "5", "title": "Surprise 40th birthday celebration", "comment": "Having enjoyed this bar some years ago in its previous incarnation as Vista, I knew it would be the perfect place to begin my niece's surprise 40th birthday treat. It has undergone a huge transformation and is now even more spectacular.  The views are incredible and the cocktails amazing. Standard pricing for a hotel of this calibre. We didn't eat there as we had a reservation for afternoon tea at The Ritz but will definitely go back this summer to try the food. We had great tables ensuring the best views out over Trafalgar Square and the London skyline.  Would not hesitate to recommend but would advise booking ahead. Great place for a special celebration, especially on a beautiful day, as yesterday was.  Many thanks to Karim and his staff for making our visit an occasion to remember.", "date_of_review": "18 April 2018"}
{"review_id": 197, "restaurant_id": -13, "username": "Mike A", "date_of_visit": " April 2018", "rating": "5", "title": "Outstanding Service, Atmosphere and Drinks", "comment": "Recently visited The Rooftop on Saturday evening to treat a special lady. I'v been to a number of rooftop bars so had reasonable expectations coming to The Trafalgar. At the entrance of the rooftop we were greeted by the General Manager, Karim who made us feel very welcome and ensured we would be well looked after for the evening. We ordered prosecco and a couple of cocktails (recommend the chocolate and cherry!) and were well attended to by Justin who was serving our table. The cocktails came promptly and were dangerously good!! During our drinks Karim occasionally popped over to check how everything was, which was a lovely touch given it was our first visit here. The ambiance was just right, they do not over crowd the rooftop which helps give it an exclusive and comfortable feel. You won't get better views in London and we caught the end of the sunset which was perfect. Thank you to Karim and his team for giving us a memorable evening, we will be returning!", "date_of_review": "24 April 2018"}
{"review_id": 198, "restaurant_id": -13, "username": "Helen F", "date_of_visit": " April 2018", "rating": "5", "title": "Perfect birthday celebration", "comment": "We reserved our table via email a couple of days before for a birthday celebration. Upon arrival, we were directed to the reception desk which for the The Rooftop. We had arrived c.20 minutes earlier but a quick enquiry confirmed our table was already available. The birthday guest was name-checked upon arrival which was a nice touch.  One of the guests was unable to drink alcohol so a delicious \"mocktail\" was provided as an alternate. The views across London - mainly Nelson's Column and across to the south of the London Eye are spectacular. The friendly staff provide woollen blankets as the evening goes on for guests who get chilly - there are also heaters located to seated inner tables only. We were also able to adjust our dinner reservation to slightly earlier via the Rooftop staff given we had enjoyed pre-dinenr drinks and were ready to dine. Overall a great experience and one I would repeat.", "date_of_review": "16 April 2018"}
{"review_id": 199, "restaurant_id": -13, "username": "Alice F", "date_of_visit": " April 2018", "rating": "5", "title": "Great place for drinks and nibbles with a STUNNING view of London", "comment": "The rooftop bar at the Trafalgar hotel is the perfect destination for any occasion. A group of us went last weekend for my fiancé's birthday and we were thoroughly looked after. Fab service, great music, and most importantly, STUNNING views! Thankfully it was a warm evening but even when it did start to get cold the staff brought out cosy blankets! We'll definitely be going there lots over the summer!", "date_of_review": "28 April 2018"}
{"review_id": 200, "restaurant_id": -13, "username": "stalwart", "date_of_visit": " May 2018", "rating": "4", "title": "Great place", "comment": "Service - very good. (if any thing too many waiting staff for a small area !!) Views - directly overlooking Nelson's column in Trafalgar Square. London eye to the other side in a distance.  Area - a tad small. But therein lies its exclusivity. You are paying for the exclusive experience. Had drinks (beer and wine) and a portion of broccoli. Enjoyed the views, the experience and the service.", "date_of_review": "11 May 2018"}
{"review_id": 201, "restaurant_id": -13, "username": "Manmoon11", "date_of_visit": " April 2018", "rating": "4", "title": "After theatre drinks", "comment": "You definitely need to book if you want to guarantee getting in. Two other couples where turned away when we arrived as they had not not booked, they where told the bar was full but when we got up to the Rooftop there was at least 4 empty tables.  Fantastic views, great service but expensive drinks.....", "date_of_review": "8 April 2018"}
{"review_id": 202, "restaurant_id": -13, "username": "Elizabeth M", "date_of_visit": " December 2017", "rating": "3", "title": "Wet and cold", "comment": "Booked this for a treat as family were visiting for the day from the North, we were informed on arrival before we even ordered a drink that we would have to leave by 17 30 hrs , we has only arrived at 16 30 hrs as this was time I had booked table for. They had a private function booked in but we were told we could return again after they had finished on terrace. It was cold wet and the heaters were not working, view was very good , apart from that first impression was not good.", "date_of_review": "23 December 2017"}
{"review_id": 203, "restaurant_id": -13, "username": "Pippasmum_12", "date_of_visit": " February 2018", "rating": "2", "title": "Terrible service. Uninspired cocktails. ", "comment": "We just wanted a quick pre meal cocktail in an interesting place. The first barrier was the concierge in the hotel stopping us from entering the lift , then having to check if there was a table. As guests in the hotel we were given entry. On arrival at the rooftop there were plenty of tables inside - in fact there was only 1 other couple in the area we were taken to.  We were sat down having been told it was table service and then ignored. It took a long while for our order to be finally taken. I had ordered a Martini with an olive. This is not what arrived. Taking payment was so slow we went and paid at the bar on our way out  If you are inside there is only a view of the cranes . The decor and furniture is utilitarian and dull  Not at all what a west end bar should be like ", "date_of_review": "18 February 2018"}
{"review_id": 204, "restaurant_id": -13, "username": "jerry m", "date_of_visit": " December 2017", "rating": "5", "title": "Chilling Indulgence", "comment": "Yes it was very cold, but the heaters did their job, the cocktails were great and the food was too. Expensive ( and watch out for the discretionary service charge added to the bill) but for the view and for the experience it's a great treat.", "date_of_review": "30 December 2017"}
{"review_id": 205, "restaurant_id": -13, "username": "TheLegendP", "date_of_visit": " February 2018", "rating": "4", "title": "You pay for the views", "comment": "The bar is nice, cocktails are nice, but you are paying for the view. If you simply want a drink there's lot of other cheaper bars.  We booked a table, and just had a couple of drinks, there is no need to order any snacks. 2 x cocktails, and 2 x vodkas came to £65  Worth the experience but would not visit on a regular basis.", "date_of_review": "18 February 2018"}
{"review_id": 206, "restaurant_id": -13, "username": "LukeGWW", "date_of_visit": " February 2018", "rating": "5", "title": "Fun Place", "comment": "We went here to celebrate a friends engagement and we were not disappointed. We had a fantastic time. The food was good, the drinks were great and the service was brilliant. There were 7 of us in total and not one of us had a bad experience.  The atmosphere here was great it had a really fun vibe with everyone having a good night. We didn't sit outside as it was too cold but we did get to experience the view at the end and it was fabulous.", "date_of_review": "26 February 2018"}
{"review_id": 207, "restaurant_id": -13, "username": "KeriC189", "date_of_visit": " February 2018", "rating": "2", "title": "Awful experience", "comment": "The worst dinner experience in London. The portion of food was small and the taste is bad. Service was extremely bad. The waiter of our table kept ignoring us and the food came about one and a half hour after we ordered it. Generally, it was the worst dinner experience I have ever had in London.", "date_of_review": "25 February 2018"}
{"review_id": 208, "restaurant_id": -13, "username": "Michelle A", "date_of_visit": " February 2018", "rating": "4", "title": "So worth the view", "comment": "As a Londoner, it's so nice to see your home town from a different prospective. I was a little concerned when I was told they didn't have my reservation when I booked 3 days before arriving (one star deducted).  My visit was purely for the roof top bar and not as a hotel guest.  Fortunately the weather whilst cold was clear and bright so we were lucky. Cocktails were on the \"small\" side so we only stayed for a couple. View is so worth it!", "date_of_review": "12 March 2018"}
{"review_id": 209, "restaurant_id": -13, "username": "Diver233", "date_of_visit": " March 2018", "rating": "1", "title": "Booked a roof top table, to be told it’s not guaranteed.", "comment": "Stayed here 2 times before. On check in we asked about the roof top bar and was told if you want a table you need to book. So we did and we came back early to enjoy the night view. When we got up to the bar, a young lady showed us to a table for two. As we started to sit down another couple who apparently had an inside table declared they were sitting there as they had moved from inside because they liked our table better. I was shocked that the waitress instead of saying sorry to the other couple who already had had drinks at another table, told us the table was no longer available and just because we booked a table does not mean you will get one. Despite my complaints we were offered a table out the way in a cold in heated area or to add salt to our wounds could have the other couples table they did not want. Turned out this other couple were not even hotel guest, but had just come for a drink, I can only assume friends of the waitress. When I tried to complain none of the staff actually cared at all. Avoid this hotel if you are hoping that the young staff will actually care that you booked a table, if their friend want to have a drink. This was Saturday 31st March management if you want to look into it. Last time we stay there.", "date_of_review": "2 April 2018"}
{"review_id": 210, "restaurant_id": -13, "username": "Jill B", "date_of_visit": " March 2018", "rating": "5", "title": "Wow a meal deal that did exactly what it said on the tin", "comment": "I cannot say how I ended signed up to Bookatable Michelin meal deals but this was the 4th one we have tried in a month and all but 1 have been excellent, (read my other reviews to discover the 1 very poor one). This was a £32 3 course deal with a glass of prosecco included. My husband and I both started with the confit duck salad, I had the salmon fillet teriyaki as my main and my husband had the honey soy baby pork ribs. In actual fact we both had half of each which was lovely. For dessert we both had the caramel miso ice cream with crumbled cookies as there were only 2 choices and the other contained coconut which I don't like. I am not a fan of desserts but this was really delicious. The whole meal was not over facing, maybe not enormous portions for someone with a very big appetite but plenty for us. I note several reviews saying the service was poor, our service was excellent (thank you Carolina), however we were eating at a very quiet time. We had a very nice bottle of Merlot for £33 too. Would happily eat here again. I would recommend booking as I understand it can get very busy.", "date_of_review": "16 March 2018"}
{"review_id": 211, "restaurant_id": -13, "username": "harund", "date_of_visit": " December 2017", "rating": "4", "title": "Great Views ", "comment": "Following full refurbishment and expansions; hotel lobby areas looks great and stylish. There are great views on rooftop and expansion really works here. However, they have arranged a big part as a restaurant and put a big open kitchen where a bar with a view would suit better. The restaurant side was nearly empty despite DJ, there were couple of people who were enjoying their drinks! Cocktails are great, staff very helpful and professional. It is great place for socialising while enjoying majestic Trafalgar Square views. Overall great place and I would definitely suggest this place after dinner drinks and coctails", "date_of_review": "22 December 2017"}
{"review_id": 212, "restaurant_id": -13, "username": "noproblemjamaica08", "date_of_visit": " October 2017", "rating": "5", "title": "Lovely view and great service ", "comment": "We reserved a table as heard it can get very busy especially as it has just reopened. The outdoor area is lovely and the chairs are really comfy and their are even blankets outside in case it's chilly. There are lots of drinks on the menu. The cocktails are around £15 and a glass of wine about £10. Def not unreasonable prices especially considering the location. The staff are fantastic. Thank you for a special Afternoon!", "date_of_review": "23 October 2017"}
{"review_id": 213, "restaurant_id": -13, "username": "ThomasEMM", "date_of_visit": " September 2017", "rating": "5", "title": "Great view on top of Trafalgar Hotel", "comment": "On top of the Trafalgar Hilton property this rooftop bar is located. It's not a very big rooftop bar, therefore not sure how they handle visitors that are not guests in the hotel, on both occasions that I had a drink here I was a guest at the hotel and had not issues in getting in.", "date_of_review": "30 September 2017"}
{"review_id": 214, "restaurant_id": -13, "username": "David P", "date_of_visit": " March 2017", "rating": "5", "title": "Amazing view", "comment": "Me and the wife visited for lunch (meat and cheese platter) and cocktails on a promotion deal. Great for a special occasion as the cocktails start at £15.00. Only stayed for 2 drinks because of the price but really enjoyed our stay with amazing views over looking Trafalgar Square.", "date_of_review": "6 November 2017"}
{"review_id": 215, "restaurant_id": -13, "username": "Chippa3", "date_of_visit": " November 2017", "rating": "4", "title": "Nice lunch. Great views. ", "comment": "Popped in for some lunch early November 2017. Had been prior to the refit. Still the same high service. Great views across London. Snacks and drinks very nice. Tried a few cocktails and was not disappointed. Recommended. ", "date_of_review": "8 November 2017"}
{"review_id": 216, "restaurant_id": -13, "username": "Geir G", "date_of_visit": " November 2017", "rating": "4", "title": "Fantastic view", "comment": "We went there for drinks only and got a table outside overlooking the Trafalgar square. We were there in midday and we did not book in advance. The service was quick but perhaps a little formal or dry. I would recommend this at least for the drinks and the view.", "date_of_review": "10 November 2017"}
{"review_id": 217, "restaurant_id": -13, "username": "speedbird1", "date_of_visit": " November 2017", "rating": "5", "title": "Not for the riff raff... ", "comment": "Great views and great service cannot recommend this place enough.. Food and cocktails we're high standard...", "date_of_review": "15 November 2017"}
{"review_id": 218, "restaurant_id": -13, "username": "Amit S", "date_of_visit": " March 2017", "rating": "4", "title": "Best rooftop restaurant/bar of London", "comment": "I can vouch for this place as I have been there many times and have fond memories of this place from my college days. This place is chic, a little expensive and very centrally located at the Trafalgar Square. Do try the cocktails and lobster/prawns", "date_of_review": "13 December 2017"}
{"review_id": 219, "restaurant_id": -13, "username": "Doshi009", "date_of_visit": " November 2017", "rating": "4", "title": "Great views!", "comment": "We visited this bar on a Saturday evening. Great music, good atmosphere, and great service. It gets busy, so pre-booking is advisable. We were there for drinks only, so I cannot comment on the food. Well worth a visit.", "date_of_review": "2 December 2017"}
