{"review_id": 1, "restaurant_id": -4, "username": "43067", "date_of_visit": " September 2020", "rating": "2", "title": "Overpriced, bad drink", "comment": "I went with friends and not only was it very loud (could barely hear anyone), I ordered a raspberry mojito which was £10 and it was ghastly. It was extremely syrup-y and barely drinkable, and so I went to get another one from the bar which they agreed to but it was almost just as bad. Moreover the passion fruit cocktail tasted like a Bloody Mary- it was very sour. Overall it was very over priced.", "date_of_review": "12 September 2020"}
{"review_id": 2, "restaurant_id": -4, "username": "C M", "date_of_visit": " August 2020", "rating": "5", "title": "A Cute find!", "comment": "Myself and my husband stumbled across this little gem this weekend and were super impressed. We hadn’t booked obviously but the lady at the front managed to get us a table for a quick bite to eat. We ordered food from Babek Brothers and were blown away, super yummy. Didn’t have to wait too long at the bar either. Great find and would definitely return!", "date_of_review": "1 September 2020"}
{"review_id": 3, "restaurant_id": -4, "username": "Eat-Stay-Travel", "date_of_visit": " August 2020", "rating": "3", "title": "Nice but service improvement required", "comment": "As you arrive, the security are very friendly and welcoming however sadly, when you reach the top the FOH staff are incredibly rude and didn’t acknowledge us or greet us for about 3-5 minutes whilst they had a little gossip amongst the 3 of them. Eventually we were seated, ordered drinks at the table but for food you must queue up. This place looks so lovely when you first enter, it is so beautifully decorated and has incredible views with it being a rooftop location. The food was absolutely delicious and enjoyed every last bite of it.  Overall; the place is beautiful with great food but service requires drastic improvement unfortunately ", "date_of_review": "5 August 2020"}
{"review_id": 4, "restaurant_id": -4, "username": "Reviewer12830", "date_of_visit": " August 2020", "rating": "1", "title": "Horrific", "comment": "I went to Pergola Olympia with 14 people this saturday to celebrate my birthday and it was awful. We were told that it was 'table service' and by scanning a bar code someone would come over to us to take our order. Well this didn't happen, we waited about 40 minutes each time to get a drink, despite consistently asking for service. The food service was even worse! 8 of us ordered food and only 6 meals came. We complained about this and they said the food would come shortly. Another 5 of us ordered food and this came before the 2 outstanding meals. We enquired again about the missing food. Another person ordered food and their food came before the two outstanding meals. We repeatedly asked the our servers where our food was and he kept saying i don't know ask they guy who took your order or said 'it's coming'. My friend actually had to go to the food stand and enquire about her order herself , to which they said that they hadn't ever received it!!! We waited an hour for this food, ridiculous. They then bought out an extra burger shortly after, despite us not ordering it. For some very odd reason, they decided not to take payment immediately after ordering, so towards the end of the night we had a very rude server come over to us with a receipt and accuse us of underpaying (due to their mistake with some beers and a burger). This man then refused to listen to us and bought over the manager. Who outrageously said he'd been watching us on CCTV and had seen how much we had paid and we were wrong! What a ridiculous statement and an intimidation technique!! In the end, they accepted it was their mistake. Later on in the night we experienced again this poor service, where we ordered three wines and only one came! When i enquired 20 minutes later they said the bar was 'busy'. But my friend placed an order 2 minutes later and got their beers straight away. It took 30 minutes for these other wines to arrive. To be quite honest they ruined my night. I had been the previous year and it was decent but I will never come back. I understand with COVID-19 they are facing new challenges, but I have been to other bars/restaurants and not experienced this horrific service. Likewise, the bouncers are rude, they are very nice to the girls and are very rude and aggressive with the boys. STEER CLEAR", "date_of_review": "3 August 2020"}
{"review_id": 5, "restaurant_id": -4, "username": "F9036", "date_of_visit": " August 2020", "rating": "1", "title": "Awful service", "comment": "We booked a month in advance and on the day of the booking we received a phone call to say that we would be seated on the roof with no cover on a pouring down with rain night. The staff rang us to say they could change our booking to the Olympia pergola and then rang back 2 hours before the booking to say they had made a mistake and couldn’t offer this so the only option would be to take the tables in the rain. We had paid a £10 deposit per person and there was 24 of us under 4 different tables of 6. When we got there, the staff continued to be rude and even tried to not let one of our guests in as he had turned up a little late. We were a large group and was celebrating a birthday so did not expect the night to be ruined by such poor service and management.", "date_of_review": "29 August 2020"}
{"review_id": 6, "restaurant_id": -4, "username": "oliviaj810", "date_of_visit": " August 2020", "rating": "1", "title": "Disgusted !", "comment": "On the 29th August At 20:30 pm a group of 9 of us had booked for a meal at pergola ,when we arrived we were told that our table was outside in the heavy rain ( we requested under cover on the booking ) the table was soaking wet and no one wants to eat their meal in the Heavy rain, so we asked if we could be moved somewhere else as there were other tables that weren’t reserved . Both women/ girls on the 2nd desk were extremely unprofessional and told us they couldn’t help , did not offer to dry the table for us we did this our self but completely impossible keeping it dry due to how heavy the rain was and also refused to offer us any sort of discount if we were willing to sit in the rain. They were extremely rude speaking about us quietly and laughing to each-other In front of our faces when all we wanted was a suggestion or some sort of help from them ! When explaining that we had travelled a long way the girl on the left who would show you to your table was continuously rolling her eyes at us whenever we made a suggestion ! I have never been in a situation like this before and definitely won’t be returning to pergola due to the unprofessionalism and immaturity of their staff ! After trying for a while to figure out some sort of way that we could stay we decided to leave as pergola was no worth the money we were willing to pay. We got not a single apology from these girls just a giggle and a smile as we walked away . Disgusted !!!!!", "date_of_review": "31 August 2020"}
{"review_id": 7, "restaurant_id": -4, "username": "AliReviews123", "date_of_visit": " August 2020", "rating": "1", "title": "Awful customer service", "comment": "We booked a table of 8 for a birthday a few weeks ago, and our friends were travelling from outside london and all very excited. On the day of the booking, only a few hours before, we received a text stating our booking was on the roof uncovered from rain and it was due to rain all day! We are young girls getting dressed up, we did not want to be soaking wet on the roof. We have been many times and never sat on the roof so was confused by this so decided to call them to query. A young girl answered the phone and refused to help and said ‘you can cancel if you want my love’, i explained it was a birthday party in 4 hours, we did not want to cancel and she was extremely rude, unapologetic and did not seem To care at all. She stated it was due to the fact we had a large booking but I have been recently as a table of 12 and a 10 and have never been put upstairs so this did nlt make sense at all.  We were forced to cancel and will never return again, the staff need some serious training in customer service and manners. It was a total nightmare to try and find a table for 8 somewhere else so last minute.", "date_of_review": "17 August 2020"}
{"review_id": 8, "restaurant_id": -4, "username": "Lydia234", "date_of_visit": " September 2020", "rating": "3", "title": "Overpriced for what it is", "comment": "My partner and I came here on a blustery evening (being set outdoors as you can imagine was very chilly!) The decor and style was really cute, but this was let down by the food and drinks.  It was extremely overpriced, and didn't really taste that great to be honest. I had a temaki from Temaki Bros, which had one tiny piece of salmon and avocado in, and then severely bulked out with rice. I also had a tuna sashimi bowl, which was pretty much the same, way too much rice!  My partner had a steak sandwich and some wings, from the Salt Shed, and he too was not impressed.  We came here with high hopes but unfortunately left feeling disappointed, still hungry and a very empty purse. I would recommend this place for just drinks, but as for the food, I would avoid.", "date_of_review": "2 October 2020"}
{"review_id": 9, "restaurant_id": -4, "username": "425bethw", "date_of_visit": " October 2020", "rating": "3", "title": "Nothing amazing", "comment": "Booked to have food and drinks at Pergold Paddington with my family in a bubble. Due to COVID rules with London in tier two we thought we should try and sit outside even though we could sit inside. But on the day the weather was terrible so they allowed us to sit inside but on two different tables. We didn't argue but we were disappointed and confused. Then looking around at other tables who were clearly not social distancing and clearly from different households (so we assume in a bubble) we couldn't work out why we had to sit separately. After many lengthy, annoying chats with managers they allowed us to sit together. What really cheesed us off the most was they waited until we had spent (a lot of) money on food and drinks before splitting us up. Seemed like a scam.  The inside was nicely decorated with flowers (fake) so good for pictures and it was quite warm despite it being October. Toilets were clean and never full. We ordered a giant prosecco, pitcher of beer and food from the three vendors. I had a Katsu Curry which was really nice but did have a wee kick. Outside was blustery and cold so we didn't stay long.  Overall wouldn't come back again until the COVID fiasco is over. And even then I'd be wary. But there are probably nicer places to go. ", "date_of_review": "30 October 2020"}
{"review_id": 10, "restaurant_id": -4, "username": "HollyDianaA", "date_of_visit": " October 2020", "rating": "5", "title": "Best bottomless in the city", "comment": "The best bottomless in the city for sure. Endless drinks and the music is great. Also the whole place adheres to social distancing and there’s a great one way system in place.  ADDED to that, the waitress called Molly is an absolute delight of a human being and is great at customer service, AND is a great laugh.", "date_of_review": "3 October 2020"}
{"review_id": 11, "restaurant_id": -4, "username": "hannamegs7", "date_of_visit": " August 2020", "rating": "1", "title": "Sexist", "comment": "We were planning to have a few drinks here in the evening but were turned off spending our money here when the person on the door accused the women in front of us for having \"too short skirts\". Firstly, those girls had, at the least, mid-length dresses so that in itself was uncalled for. Secondly, the girls had already spent time in your institution so the bouncers were essentially insulting their own customers. Personally, I would not like to spend money on a place that is, essentially, being sexist towards women when said women are suitably dressed. It's 2020, women do not need to be subjected to these absurd standards anymore.", "date_of_review": "2 August 2020"}
{"review_id": 12, "restaurant_id": -4, "username": "ally762018", "date_of_visit": " January 2020", "rating": "4", "title": "Great atmosphere ", "comment": "We went there with a few friends on Saturday night.. the location and the atmosphere was great although I’ve to say that it’s more suited to a 20-30 crowd..the only negative was a couple of bar staff were not very hygienic when it can serving the drinks .. plus point the management ", "date_of_review": "8 February 2020"}
{"review_id": 13, "restaurant_id": -4, "username": "HelloLondon23", "date_of_visit": " February 2020", "rating": "5", "title": "Bottomless brunch- Great place!", "comment": "I went to Pergola Olympia on Saturday for a bottomless brunch £30 (£25 for the bottomless and £5 for a food voucher for any food stall) I was a bit nervous as some of the reviews on here were a bit iffy HOWEVER it was so great! Great food, great staff, great decor and an even better view! As soon as our group arrived, everything was explained about how the bottomless worked plus food (it was only about another added 5er to top your food voucher up!) So all in all 3 hours of bottomless plus food coming to around £35 was an absolute bargain! The views were amazing. The bar staff were quick and efficient. I will be highly recommending this option to people in future!", "date_of_review": "4 February 2020"}
{"review_id": 14, "restaurant_id": -4, "username": "AramintaWise", "date_of_visit": " February 2020", "rating": "2", "title": "Friends Birthday Meal", "comment": "I went to Pergola Olympia for a friends birthday meal yesterday. The people working there was very unhelpful. They seated us at a table and then decided they wanted to move us. Being we have never been to pergola before we didnt know how the place worked. Nonone working there bothered to tell us that we had to go up and order our food. I had the lamb steak and chips. I asked for medium and got well done. I wouldn't recommend getting the steak and chips. Overall I wont be in a hurry to return there from my experience.", "date_of_review": "23 February 2020"}
{"review_id": 15, "restaurant_id": -4, "username": "mikeyo60", "date_of_visit": " July 2020", "rating": "5", "title": "Firstly I would like to say", "comment": "Firstly I would like to say thank you to all the staff at pergola, the bouncers were polite, staff were brilliant and both managers especially I think it’s Matt we’re great.  First day out for a few drinks and food with the boys and it was superb.m, great atmosphere, good people and just an all round great day/night with great food choices.  I cannot wait to go back. ", "date_of_review": "26 July 2020"}
{"review_id": 16, "restaurant_id": -4, "username": "AimeeBell", "date_of_visit": " December 2019", "rating": "5", "title": "Beautiful bar", "comment": "Came here for a friend's birthday. Very friendly staff on arrival. Very lovely decor and nice open space. Outside on way in could do with being more inviting but the food was divine street food at a good price. Great price for bottomless prosecco and requests were listened to such as choice of table etc. Would definately come back again.", "date_of_review": "7 March 2020"}
{"review_id": 17, "restaurant_id": -4, "username": "bobo2245", "date_of_visit": " July 2020", "rating": "1", "title": "Never again!", "comment": "Honestly dreadful. Never again.  The only available vegetarian option was a side of chips Extravagant prices for wine. I found some of the house wines for €4.80, so about £3.80. They were selling it for £24. That’s almost 600% mark up We got chucked out with 5 mins warning. Totally out of the blue we were enjoying our £24 wine and were told the table was booked. The food was freezing. It was so expensive and tasted like oven food. It took so long to arrive we ate it cold.  Most importantly, I don’t think they were taking COVID-19 seriously. The waiters and staff had zero social distancing with us. Also, I seen a table get up and other people sitting in it within 5 minutes. Nothing was wiped down! I was sitting opposite it. There is no AC (that I noticed anyway) Only a few fans on the ground it was breathtakingly hot. Does that mean we were all breathing the same air? Very worrying. I won’t be seeing my elderly parents for a few days just in case", "date_of_review": "31 July 2020"}
{"review_id": 18, "restaurant_id": -4, "username": "C3336PMamys", "date_of_visit": " August 2020", "rating": "1", "title": "No", "comment": "Door staff were sexist and misogynistic. A group of girls in front of us were denied entry on the basis of the length of their skirts and the fact they were taking pictures outside. Two of the three women were in midi skirts. Decided not to enter after seeing the female door staff be so rude to other women. Don’t recommend, not worth the harassment.", "date_of_review": "2 August 2020"}
{"review_id": 19, "restaurant_id": -4, "username": "alainLondon44", "date_of_visit": " February 2020", "rating": "1", "title": "Rude doorman", "comment": "We decided to visit Pergola Olympia on Saturday after exhibiting at Olympia. The doorman was very rude to us. The venue should mention “Booking only” where they advertise the place at the bottom of the car park. It’s a shame about this attitude of the staff as it is a great venue.", "date_of_review": "2 February 2020"}
{"review_id": 20, "restaurant_id": -4, "username": "E2956AHhollyd", "date_of_visit": " August 2020", "rating": "1", "title": "They shamed the girls in front", "comment": "They shamed the girls in front of us saying they weren't allowed in because the skirts were too short. We chose not to go in after that ", "date_of_review": "2 August 2020"}
{"review_id": 21, "restaurant_id": -4, "username": "Anna A", "date_of_visit": " November 2019", "rating": "1", "title": "Wouldn't bother visiting", "comment": "Website suggests this is a very upmarket place. It is not and rather disappointing.Nice decor but freezing in the winter. Toilets are pretty disgusting - lack of toilet roll and hand sanitiser used as soap.  2 for 1 cocktails come from the tap (pre mixed) when we were there two had already run out.  Closed at 10:30 on a Friday and we were promptly asked to leave. Food is mixed - some very nice and some very very disappointing. All in all would not bother going!", "date_of_review": "9 November 2019"}
{"review_id": 22, "restaurant_id": -4, "username": "Yellowtopcab", "date_of_visit": " November 2019", "rating": "4", "title": "Refreshing and vibrant", "comment": "Pleasantly surprised with the elegant and massive structure with great airy room complemented by an open air resemblance. Great place to go with many friends given the lay out of the furniture but certainly couples would also enjoy it. With two bars on either end, service is excellent. This is also the only place I have been to with several independent restaurants serving a variety of food. Also impressed with security in place and liked the professionalism of Billy, one of them. I thought this place fits very well with the younger generation but of course other ages enjoy it.  A tube station is only 2 minutes walk and parking is in the same structure.", "date_of_review": "10 November 2019"}
{"review_id": 23, "restaurant_id": -4, "username": "childs03", "date_of_visit": " July 2020", "rating": "5", "title": "Pergola’s back!", "comment": "Myself and my housemates came for an evening at Pergola and it was wonderful. Lots of laughs had. A special mention to Jewel, who was keeping the bathroom in order; she was so lovely and chatty, as well as being orderly and she was good at making us feel safe. Give that girl a raise, she’s so nice!  Only downfall is that, when you arrive you’re told to remain in your seats where possible (which is what we want) but boys at other tables would come over to our table and try sit/talk to us less than the 1m rule. Perhaps if possible there should be more security making sure rules are broken as minimally as possible. We like safety!  All in all though, a wonderful night!", "date_of_review": "5 July 2020"}
{"review_id": 24, "restaurant_id": -4, "username": "cfhurley", "date_of_visit": " November 2019", "rating": "3", "title": "Great for the 'gram, but that's about it", "comment": "Tops points for the aesthetic. Plenty of leafy green plants, rows of fairy lights, and funky neons. There was music playing (upbeat chart stuff) which was loud but not so loud as to impede conversation.  The food options were really disappointing. There were 3 different vendors, operating a food court system of order and receive a buzzer. Nearly everything came with chips - even the bao buns. And it was all fried food. There is definately room for improvement here. A pizza oven, for example, would fit right in. The food was expensive and basically just fancy fast food.  The bar was very well stocked and had a good range of cocktails. Prices were as you would expect in London. The bar staff were a mixed bag - some were polite whereas others were rude and curt.", "date_of_review": "25 November 2019"}
{"review_id": 25, "restaurant_id": -4, "username": "charlies660", "date_of_visit": " December 2019", "rating": "1", "title": "Theft", "comment": "Doorman touched me inappropriately shining a torch down my trousers, stole my credit card and made purchases online minutes after I entered - complaint made with police and CCTV requested.They make you empty your pockets on the door and then steal from you. Absolute disgrace.", "date_of_review": "3 January 2020"}
{"review_id": 26, "restaurant_id": -4, "username": "Corrina1234", "date_of_visit": " November 2019", "rating": "5", "title": "Ashleigh is an absolute star!", "comment": "Ashleigh is an absolute star! She went above and beyond to ensure we well looked after and that our situation was addressed, I can’t thank ashleigh enough x", "date_of_review": "23 November 2019"}
{"review_id": 27, "restaurant_id": -4, "username": "3WildThings", "date_of_visit": " December 2019", "rating": "3", "title": "Busy", "comment": "Big venue, great selection of drinks, 3 food joints, all order yourself. Bar staff very friendly. Good for groups. Table share. Food very tasty recommend the Asian. Music fun. Views impressive. Great fun ", "date_of_review": "15 December 2019"}
{"review_id": 28, "restaurant_id": -4, "username": "259mayaj", "date_of_visit": " December 2019", "rating": "3", "title": "New years eve- your DJ was awful and ruined a good night", "comment": "We came here as a large group to celebrate New years and the venue was nice, the crowd was friendly, drinks were well priced (although somewhat watered down) and the decor was lovely. BUT a few things: You promised on your flyer that we can see the fireworks- didn't happen as the terrace was too fenced in so please don't advertise this if this is not the case. Secondly, the food was nice BUT all booths bar 1 were open at 1- not the variety, choice and opening hours you advertised. Lastly, your DJ was absolutely awful and she refused to take requests when every person I met was complaining about the music. She appeared to be staring at the decks and was having her own party rather than looking at the crowd who was mostly sitting down the whole night from boredom or they were on the dance floor but was insanely drunk that they didn't know what their name was. Next time, please understand that Celine Dion is not party music, especially not NYE..", "date_of_review": "2 January 2020"}
{"review_id": 29, "restaurant_id": -4, "username": "tarasY2397RZ", "date_of_visit": " December 2019", "rating": "3", "title": "After-work drinks", "comment": "It was ok. I can see why youner people would like it. Busy and loud. Loads of people there and apparently difficult to get a booking. We went here for our Christmas drinks so suited the mood. Not cheap though. But must have a great view in the summer, was a miserable evening on our visit too so didn't see much.", "date_of_review": "18 January 2020"}
{"review_id": 30, "restaurant_id": -4, "username": "918tk", "date_of_visit": " December 2019", "rating": "1", "title": "Criminal door staff, dodgy burgers, book a table scam", "comment": "This is my experience of Pergola \"on the roof\". We were celebrating a birthday with about 20 of us going. We booked a table 2 months in advance and made sure it was for 20 people.  Upon arrival the two door staff decided they didn't like the look of my brother so they pulled him aside acting like fake police for a detailed search, they pulled out all his possessions, shone a torch down his trousers and said \"Where are the drugs!?\" rifling through his wallet pulling all the cards out looking for drugs. There were of course no drugs the whole thing was uncalled for.  A short while after this happened my brother looked in his wallet and his credit card was missing. The bouncers definitely took his card, it was securely in a slot in his wallet and was used about 5 minutes before to come out of the tube station. He checked his online banking and there was a purchase of some £105 Nike trainers made within 15 minutes of us being searched. Confronting the door staff they denied it. The door staff at this place are absolute criminals and this matter has been taken up with the police.  After being manhandled and robbed by the bouncers we went downstairs \"underground\" to a fake rooftop bar. I was under the impression it would be on a roof seeing as it is called \"Pergola on the roof\". The whole place was extremely hot with no aircon.  We were shown to our prebooked table for 20 which was actually about 3 small tables put together barely enough for 10 people. After complaining the lady said your booking is for a mix of seated and standing. What a con. The pre-booked prosecco arrived and it was just two cheap £5 bottles absolute rip off. We said can you at least bring some chairs over she said yes but disappeared and didn't come back.  After a few drinks we decided to get some fast food from the stands running around the side. £14 for a basic burger without chips. The burger place produced a burger within a few minutes, it's no wonder because it was red raw, they basically through it on the grill for a minute on each side. A few of our group said they were vomitting the next day I'm certain it was these underdone burgers. There is medium rare, then there is completely rare where it is barely cooked.  So if you are thinking of planning a visit here to celebrate with your friends be prepared to have your credit card stolen and used by the bouncers, get food poisoning, and relax at a table with your non-existent pre-booked seats. This place is an absolute scam avoid at all costs.", "date_of_review": "3 January 2020"}
{"review_id": 31, "restaurant_id": -4, "username": "suitsyousir2010", "date_of_visit": " July 2019", "rating": "2", "title": "Got potential but......rubbish basically!", "comment": "Very trendy pretty place but also really bad! So downstairs was under Perspex so very hot and sweaty. Queue at bar was horrific! Food is average and you have to queue for that also. Ibiza vibe tunes were the best part. We had to reserve also. Wasn’t really worth the effort. Nice part of town too. What a waste. ", "date_of_review": "27 July 2019"}
{"review_id": 32, "restaurant_id": -4, "username": "Karenmfinn", "date_of_visit": " September 2019", "rating": "4", "title": "Birthday celebrations!", "comment": "We started our night here recently for drinks and a bite to eat. The venue is great and there is a good variety of food options! Great atmosphere and perfect for a large group as there is lots of space! Thanks!", "date_of_review": "13 October 2019"}
{"review_id": 33, "restaurant_id": -4, "username": "Jamesah1984", "date_of_visit": " July 2019", "rating": "1", "title": "What a shambles", "comment": "How can a place not allow people in couples to reserve a table and say walk ins available but you travel all the way across london and there is no walk ins! Say there is two different sittings we got there for 5pm today and still no walk ins! Why would a place not allow a couple to reserve a place", "date_of_review": "27 July 2019"}
{"review_id": 34, "restaurant_id": -4, "username": "SophiaKhan", "date_of_visit": " August 2019", "rating": "2", "title": "Bad customer service", "comment": "We reserved a table for six, but were placed on a table for four. When we spoke to the hosts about this they were completely unconcerned and said that the venue was fully booked (it was half empty at the time). We had to speak to them a second time and show them that there was no way all of us could fit at the table. We were then moved to a larger table for 2 hours and then moved back to our original table. The hosts did not even think to join the empty table next to us with ours to give us more space. The staff were completely unbothered about the issue and very unwilling to help.  They have also replaced Patty & Bun with a discount version known as Smash Patty.", "date_of_review": "4 August 2019"}
{"review_id": 35, "restaurant_id": -4, "username": "Grela898", "date_of_visit": " July 2019", "rating": "2", "title": "Really not worth it! Shame!!", "comment": "Real shame place is nice but just not worth it! Prices are ok, as you expect in London but the staff is just terrible, you have massive queues cos they are chatting with friends or with each other! You get an evil if you ask for a glass rather then plastic!! The music is way to loud to have a conversation but luckily there is outside area which not very politely you get told to go inside before 23. The whole thing looked very badly run and unprofessional. The food we only had chips with were well overpriced! Toilets and facilities in general are not clean! Real disappointment and wouldn’t recommend there is much better in this great city!!", "date_of_review": "26 July 2019"}
{"review_id": 36, "restaurant_id": -4, "username": "huddersfieldeater", "date_of_visit": " August 2019", "rating": "5", "title": "Great place", "comment": "We visited on a Thursday afternoon around 3, it was not super busy but several tables were dotted around and looked to be having a great time. Drinks were nice, although the bar is card only and we ordered food from the dumpling (an choi) and sushi (temaki bros) stalls, which arrived promptly. Food was absolutely delicious, portions were decent sized considering the prices- chicken dumplings and bao buns were my favourites.  The only downside were the toilets- not very clean and full of insects. The floor is also basically just loose rocks and I imagine it would quite hard to walk on with heels. Would definitely recommend visiting on an afternoon if you are wary of the crowds and queues described in other reviews", "date_of_review": "30 August 2019"}
{"review_id": 37, "restaurant_id": -4, "username": "EmpressM", "date_of_visit": " August 2019", "rating": "3", "title": "Not as expected", "comment": "It is a lovely location but the billing is all about view then there is none. I expected to see the railroad tracks, canal and rooftops, but you see nothing. It is a great idea and wildly successful with young people. The food and drink is surprisingly good. But unless you are under 30 and enjoy a mob scene, stay away. I must note tho that the young staff was very polite.", "date_of_review": "20 August 2019"}
{"review_id": 38, "restaurant_id": -4, "username": "jmenamon", "date_of_visit": " August 2019", "rating": "3", "title": "Lovely decor and good location", "comment": "Nice place for a couple of drinks. Target age group 20 - mid 30's. Free drink was nice and they do drink packages (pay in advance).", "date_of_review": "4 September 2019"}
{"review_id": 39, "restaurant_id": -4, "username": "galactica2015", "date_of_visit": " August 2019", "rating": "1", "title": "Wouldn't recommend", "comment": "We went as a birthday and though it was a great atmosphere, some of us got sever food poisoning and were bed bound for three days! We also saw mice walking around at around 7pm and again at 11pm so promptly left!", "date_of_review": "8 September 2019"}
{"review_id": 40, "restaurant_id": -4, "username": "oliviarosemaosn", "date_of_visit": " September 2019", "rating": "3", "title": "Pergola Olympia “bottomless brunch”", "comment": "We visited pergola Olympia’s rooftop bar yesterday for a bottomless brunch. We paid £30 for bottomless brunch , however the drinks included in the bottomless offer are pretty weak. This also does not include food , you have to pay extra for it . However food is fantastic.  THE FACT THEY DONT TAKE CASH IS SO ANNOYING.CARD ONLY.  One thing we did notice was bar staff were quite rude and unhelpful. However vibes are good! Good music playing !", "date_of_review": "22 September 2019"}
{"review_id": 41, "restaurant_id": -4, "username": "louiville7", "date_of_visit": " May 2019", "rating": "2", "title": "Not worth the wait", "comment": "An open area suited for large groups for drinking and food stalls. The entrance gives the feel of entering an exclusive venue, but this raises the stakes too high. It is geared for large groups to drink and be merry. There is little else in terms of distractions in the area as it is a large space. The queues for the bar can take 20 to 30 minutes at busy times, which is a long time to wait. The centre of the area often becomes filled with people impatiently waiting. There are side areas to purchase food, but they can be regularly understocked. Leaving you to wait for food. Once again this is a slightly pretentious place that offers little for what it is worth. If you have a free drink voucher it is worth a quick stop, but like everything you have to wait to gain very little.", "date_of_review": "23 July 2019"}
{"review_id": 42, "restaurant_id": -4, "username": "L6640RQerikag", "date_of_visit": " June 2019", "rating": "3", "title": "Good aesthetics and busy atmosohere", "comment": "The place looks quite trendy and has a good atmosphere. Although the bins next to the benches had a very unpleasant smell. The music started off nice, with R&B and hip hop, but then quickly changed to a random vibe - didn't really suit the casual atmosphere.", "date_of_review": "26 June 2019"}
{"review_id": 43, "restaurant_id": -4, "username": "70melaniel", "date_of_visit": " June 2019", "rating": "3", "title": "Great concept but hot and loud", "comment": "We went to Pergola on the Roof at Olympia rather than Paddington. We were able to book a table online fairly easily and arrived about 5:30 on the Saturday. Location is quite easy to get to and the set up at the location is pretty cool. There are 2 bars and a couple of food stalls serving street food - burgers, chicken, noodles etc. The drinks menu is extensive with loads of cocktails, beers and wine to choose from. Don’t get too excited about the cocktails though as most are made from pre-made purées and juice, other than the gins which are quite well done. We arrived at 5:30 but by about 7 quite a few of the cocktails - particularly those on tap had run out. You can get a free frose which you register for online before you go, they will give you a ticket when you check-in. The frose is lovely although again periodically runs out due to its popularity so you may have to wait. The security staff are amazing and on the look out to make sure you keep your space and there isn’t over crowding. The bar staff are lovely but are pretty slow. We went on the hottest day in June and although they had ‘air conditioning’ and fans it was still pretty hot. Although it’s on a roof top it is enclosed just with big windows. Great if the weather isn’t too good as you can still enjoy it, but on a hot day is a bit close. There were a few people celebrating birthdays and hen parties who had some neat areas they had set aside which were good. For me I’d suggest going for a couple of hours at the beginning of the evening and then moving on somewhere else.", "date_of_review": "30 June 2019"}
{"review_id": 44, "restaurant_id": -4, "username": "Jack34525", "date_of_visit": " June 2019", "rating": "1", "title": "Great promo campaign on Instagram/ FB.", "comment": "Invited to a birthday here on a Friday night in June. Despite having a reservation, some of the guests had to queue outside for 30-40 minutes, to find out it was only half full inside. No clear reason why they were keeping people with reservations outside. People at the door were impatient and irritable. Drinks were expensive for the area, long queues for the bar due to understaffed and untrained staff. Had to queue 15 mins for food and then wait 25 minutes for it to be made. Felt like everyone in the group was queuing most of the evening. There are cheaper, more accessible places with better views, shop around. ", "date_of_review": "11 July 2019"}
{"review_id": 45, "restaurant_id": -4, "username": "debbiecU7414ZZ", "date_of_visit": " July 2019", "rating": "3", "title": "Ok but needs improvement ", "comment": "If you are going to have a massive amount of seating then you need to have enough staff behind the bar, at the eateries and reservation hosts to see you to your tables. When I arrived I asked where my booked table was, I was pointed in the direction however I had to go back and ask where were my prepaid drinks package.  The queues for food and bar are ridiculous. Get more staff.  The temperature on an average warm day is in humane.  However the place has a decent vibe and the music isn’t ridiculously loud.  Food is average. Prosecco is nice. Good place for birthdays and group gatherings. ", "date_of_review": "14 July 2019"}
{"review_id": 46, "restaurant_id": -4, "username": "dhrs2015", "date_of_visit": " July 2019", "rating": "1", "title": "Unprofessional and dirty place", "comment": "Booked a table for 6 got a table for four. After complaining they changed the table. Couldn’t order food because the chef was alone. Dirty glasses and overpriced. What a .....place. Avoid this place as you don’t have any value for money. ", "date_of_review": "14 July 2019"}
{"review_id": 47, "restaurant_id": -4, "username": "TanagraUK", "date_of_visit": " July 2019", "rating": "1", "title": "Food and wines average and brutal staff ...", "comment": "We were a group of friends enjoying a party. The place is really nice (decoration, layout) however pretty noisy so it can be difficult to have a conversation. Music is great though.  Food options are pretty limited if you dislike junk food (it is manly burgers or kebabs and plenty of other fatty foods so if you pay attention to your waistline the donburi will be your one and single option. And I lust say it was okay. The wine and Prosecco are just average.  But what was really shocking to me was how brutally all the clients were « invited » to leave at 10.45pm. It is ok, we do understand that it closes at 11pm. But a nice and polite « hi, just to let you know that we are closing, please finish your drinks and start leaving not forgetting any belongings, » would be far more appropriate around 10.30, with a gentle reminder at 10.45, if needed (I acknowledge everyone won’t leave straight away), such as « sorry, but I have to ask you to leave now, sorry to insist, but we are closing, thank you for coming to the Pergola today (showing the exit way to the guests) », that would have been far better than the aggressive way we were asked to leave the place. This approach was very shocking, highly unpleasant and very disrespectful. ", "date_of_review": "15 July 2019"}
{"review_id": 48, "restaurant_id": -4, "username": "SuziePAP", "date_of_visit": " July 2019", "rating": "4", "title": "Very pretty place, great music but massive queues ", "comment": "This place looks stunning, cool vibe music and lovely on a sunny evening but the queue was 45-60 minutes for walk ins. My sister and I had tried to book but they don’t accept bookings for less than 4 so we came back later at night and only waited 10 minutes. The long tables mean there’s plenty seating but the tables were filthy and wet from all the drinks and the bar was busy. For such a stunning photogenic place, the toilets were disgusting. No toilet roll, broken toilet seats on the floor, soaking wet sinks.  Can’t comment on food as only had drinks. ", "date_of_review": "16 July 2019"}
{"review_id": 49, "restaurant_id": -4, "username": "Nic B", "date_of_visit": " July 2019", "rating": "1", "title": "Never again!", "comment": "When we first turned up we we were greeted by a pretty flower wall at the front, on entering we found a space of picnic benches and bar, walls painted in pastel pinks and blues and a painted decking floor. Be aware, this is mainly a crowd of late teens/early twenty somethings. Heading downstairs we found a packed out space of yet more large picnic benches. We were shown to ours (we had ore booked) and squeezed 11 of us into a table that should probably just fit 8 comfortably! The bar staff kept disappearing but eventually we were seen before choosing to get a kebab. After 15 minutes of queueing some of our group joined our queue as the dumpling kiosk they were at decided to close, presumably because they were unable to keep up with demand. 10 minutes later we were all turned away from the kebab kiosk, again, closing and turning us away. Heading to the burger kiosk we got the front after another 15 minute queue and had to wait again as they had run out if buzzers. We eventually ordered our food and sat back down to wait a further 30 minutes for our buzzers to alert us if our food being ready. The upside here is that the burgers and chips were good and for a reasonable price.  It was too hot, too crowded and felt like a cattle market, clearly allowing far too many people in than they can possibly cater comfortably for. First and last visit!", "date_of_review": "7 July 2019"}
{"review_id": 50, "restaurant_id": -4, "username": "Celetar", "date_of_visit": " December 2018", "rating": "1", "title": "I am not your mate sonny Jim...", "comment": "A truly awful experience! Booked a table for lunch for myself and two adult daughters during our visit to Olympia (not Kingdom Street) but then received an email to say the \"restaurant\" was not opening until 4.00pm - despite being advertised as a venue for lunch on the Olympia International Horse Show website. Then after a series of email exchanges informed, yes, it would be opening at 12.00pm after all because of the show. Arrived promptly on the day (the venue was practically empty), we needed quick service as our show started at 12.45pm, all of us decided on burgers from Patty&Bun. Went up to order and was told rather dismissively by the young man that they were not opening until 1.30pm - I do not like being called \"mate\", by the way, sonny Jim! Quickly ordered fish fingers from \"Claw\" as time was pressing - this took nearly 20 minutes to prepare and then discovered they had got the order completely wrong! It was too late to sort out and there was absolutely no time to eat our food by the time it was ready. We took it with us but could not get it past arena security - so, had to bolt it down whilst standing in the foyer with crowds bustling past. Food was pretty bland and I, certainly, would not recommend as somewhere to eat - it is not even decent \"pub grub\". A complete waste of £17.00 and, needless to say, we will not be going back. Singularly unimpressed!", "date_of_review": "26 December 2018"}
{"review_id": 51, "restaurant_id": -4, "username": "JCDavies67", "date_of_visit": " February 2019", "rating": "4", "title": "An interesting food court style venue with a bar - very social environment (only open Thu-Sat)", "comment": "We ate at the Paddington Pergola which is close to the station and at the end of the Paddington Central shopping and business area - about 5 minutes walk from the Hammersmith and City tube exit. (make sure that you access it via Paddington Central area along the canal as the rear access from the road system is untidy and backs onto bridges and rough areas) The restaurant is a food-court where you are seated and then choose which of a number of outlets you want food from. There is a reasonable selection with a duck kiosk, a burger kiosk, a Vietnamese kiosk and a Taco/Mexican style kiosk. You walk up to the kiosk of your choice and buy your dishes there - they give you a buzzer/pager and you come back when it goes off. Drinks are bought separately from a cashless bar to the side. We visited on a Saturday lunchtime and there was plenty of space and the food was quick to be ready. We mainly had the duck from the Canard kiosk and it was very tasty and nicely prepared with great chips (cooked in duck fat!!). It cost ~£45 for 4 adults and another ~£18 for drinks. This seems to be a very popular venue for light social lunches with a bar and there were a number of groups there (~8 in each) and lots of small families and friends in groups of 3-4. The main seating area is inside but in a loft type area with radiant heaters near each table that warmed it nicely - there is another roof area which is more 'outside'. People seemed very happy and having fun and it had a great social feeling - like this was a regular Saturday thing for many - which I enjoyed. I imagine it is heaving in the evening and very lively with music - think funky Oktoberfest.", "date_of_review": "18 February 2019"}
{"review_id": 52, "restaurant_id": -4, "username": "GrizzlyIreland", "date_of_visit": " February 2019", "rating": "3", "title": "Saturday early evening", "comment": "It is average food and considering the area wasn't shocked by bar prices. The Vietnamese street food was the favorite and appeared to be the largest portion size. No rush to go back, staff were fine, not exactly friendly but not rude. Looks like a place for larger groups rather than couples.", "date_of_review": "3 March 2019"}
{"review_id": 53, "restaurant_id": -4, "username": "KerenVisser", "date_of_visit": " April 2019", "rating": "3", "title": "Very busy!", "comment": "Visited for a friends birthday, so thankfully we had a reservation. Was really busy as the weather was nice. The queue for the bar was always 3 or 4 people deep. Long cues for food. Prices are high, which is to be expected for the location. Not sure it’s worth the hype. Aesthetically it’s cute. ", "date_of_review": "11 April 2019"}
{"review_id": 54, "restaurant_id": -4, "username": "londonsparkster", "date_of_visit": " April 2019", "rating": "2", "title": "Misleading offer....", "comment": "My friend suggested we tried this as she had seen the \"bottomless brunch\" offer and thought it would be fun to try .... not the case .... we booked the 2.30 slot, arrived to a massive queue and spent our first half hour queuing on the stairs to get into the place .... so effectively lost half an hour of our \"bottomless\" then ..... the staff however were fantastic, especially Olivia a lovely girl from the Wirral, where me and my friend are from, who explained the system and showed us to our table. It was VERY noisy, there were some very drunk groups of girls already falling over .... the food we ordered on top of our £30 bottomless (the inclusive food had run out) (bloody mary, prosecco - very weak 10.5%, and non existent expresso martinis as when we ordered at 4.30 they said we were too late ...) was quite pricey .... £25 for some crab fries, slaw and a portion of fish finger tacos ... anyhow... it was different but I would only go back NOT doing the bottomless brunch ... great people watching ..... and great if you are in your 20s ....", "date_of_review": "13 April 2019"}
{"review_id": 55, "restaurant_id": -4, "username": "462grahamj", "date_of_visit": " April 2019", "rating": "4", "title": "Great food, long queue for bar ", "comment": "Trendy roof top pop up, popular with 20-30 year olds, we felt rather old. Well run and friendly with energetic polite staff. Really well done with lots of food choice. Dim sum or poke recommended as is the Aperol ", "date_of_review": "21 April 2019"}
{"review_id": 56, "restaurant_id": -4, "username": "BJM123-G", "date_of_visit": " May 2019", "rating": "3", "title": "Great place to drink, horrendous wait time for food", "comment": "Visited here for a birthday celebration. Great venue perfect for meeting with friends. Bar was well staffed and drinks were fast. Slightly disappointed by the food, after ordering two burgers and waiting close to 40 mins. Considering the setup was fast food esque, I.e. order and wait for your meal, 40 mins was a significant wait which really spoiled the overall experience.", "date_of_review": "23 May 2019"}
{"review_id": 57, "restaurant_id": -4, "username": "Hannahannah92", "date_of_visit": " April 2019", "rating": "2", "title": "Rude staff ", "comment": "Visited here yesterday as a group of 7 for a friend’s birthday.  We booked a table for 5pm and were told to sit at one of the middle benches until then. We were then taken to our table which were two small tables pushed together at the side of the venue in area W.  The area was absolutely freezing in the area we were moved to, heaters only covered the middle benches and we had a dreadful draft.  A couple of hours in we noticed the whole venue was absolutely freezing. We were told it was disconnected and spoke to staff a number of times who just told us the heating was off whilst sitting in their large jackets. The website states the venue is fully heated.  I found a lot of the female staff in this venue extremely rude and unhelpful as we asked for our table to be moved as we were absolutely freezing but no apologies or resolution for this issue was offered.  The two girls in big jackets at the door were very unhelpful and unapologetic.  The free drink offer is also an absolute shambles. There is no scanning a code or anything, it is simply the bar staff deciding who they have already served or not to the point where my friend did not get a single free drink despite the email because a member of bar staff said he had already served her which was not true. This was very unfair and embarrassing for my friend when they accused her of this. They then served another girl two free drinks because she was “a friend of her brother’s”.  When we were leaving the venue, we left via the same door we came in. There were a group of dodgy looking people (presumably staff) smoking and drinking sitting on the floor when a European girl with a cigarette came over in an absolute flap shouting at us telling us to get inside now and that we can’t exit this way in an extremely rude manner and trying to herd us in like animals. She even ran down the road to get another group of people and made them walk back in when they left in front of us. There was no security or signs on this door. Security then arrived and simply rolled his eyes at her.  Drinks were expensive, as was the food but it was expected as I had seen the menus.  I would have given 1 star, but the restaurants were really good, very quick and staff were very helpful. Definitely recommend either duck burger and the loaded fries with pulled pork. Attitudes of staff needs to be rectified. ", "date_of_review": "14 April 2019"}
{"review_id": 58, "restaurant_id": -4, "username": "nagasaki74", "date_of_visit": " July 2019", "rating": "2", "title": "Major potential but badly executed", "comment": "Just back from a week in Ibiza and attracted to this place by its promise of Balearic beats. Couldn't be far enough removed. Diverse crowd, good beers but absolutely dire quality of sound and tune selections. Few stag and hen dos didn't help. At least two of food establishments had completely run out of food at 9pm...… Had a posh patty bun which was ok. Not worth travelling to.", "date_of_review": "19 July 2019"}
{"review_id": 59, "restaurant_id": -4, "username": "GlobetrotterNL83", "date_of_visit": " December 2018", "rating": "3", "title": "Could be great in the summer ", "comment": "A bit harder to find than expected and unfortunately not very lively on Saturday afternoon. I reckon it could be a great place to hang out in the summer , but even with heat lamps it wasn’t very warm now. Only 4 restaurants to choose from, but we were happy with the burgers and chips we ordered. ", "date_of_review": "26 December 2018"}
{"review_id": 60, "restaurant_id": -4, "username": "Ma R", "date_of_visit": " June 2019", "rating": "3", "title": "Nice place for drinks", "comment": "It’s a nice place to have drinks but I don’t really understand the hype around it. The place smelled funnily of wet dog and poo. Really strange smell :D staff seemed friendly and great choice of drinks.", "date_of_review": "16 June 2019"}
{"review_id": 61, "restaurant_id": -4, "username": "carlyward", "date_of_visit": " August 2018", "rating": "1", "title": "Awful", "comment": "Very disappointing. Planned to go with a friend and after waiting 20 minutes at an under staffed bar they told us they only had 1 frozen margarita, we had signed up on the website for a free one and may have stayed for another drink but decided to leave as limited bar staff looked visibly stressed and unhappy, only 2 people serving on our side of the bar!! It's 30 degrees and August, how can you not have enough drinks in a bar? It's beyond me, never going back. It's a shame as the place is nice but they clearly don't have enough experience in running a bar whoever is in charge.", "date_of_review": "2 August 2018"}
{"review_id": 62, "restaurant_id": -4, "username": "G- G", "date_of_visit": " August 2018", "rating": "1", "title": "GERARD- what a terrible and rude bartender", "comment": "Spent the Saturday afternoon with few friends, and we also registered for the margherita. It's a Fu***ing spam, don't fall for it. Gerard the bartender didn't even consider to let me pay for 3 margheritas, he simply assumed I wasn't interested but all I wanted is margherita free or not or just other drinks. Shouted at me twice saying the machine was broken when it was still rotating/working. Defintely not coming back...staff should have respect... always", "date_of_review": "7 August 2018"}
{"review_id": 63, "restaurant_id": -4, "username": "MsShepps", "date_of_visit": " August 2018", "rating": "4", "title": "Good for group drinks!", "comment": "Booked a table for 8 people for a birthday 2 weeks in advance.  It ended up chucking it down with rain on the day. The table was undercover and dry! It was still busy with people in the under cover section but everywhere else was dead.  Good selection of food - 4 huts, burgers, Mexican etc. They give you a buzzer timer, to come back and collect your food, so you don't have to stand and wait for your food, you can go and join the drinks line. Every drink is in a plastic glass... and they were all dirty.  We brought in cake, table sprinkles and balloons and that was allowed.  Would i go back, yes. It's perfect for a large group of friends. It's grubby around the edges but all good fun.", "date_of_review": "13 August 2018"}
{"review_id": 64, "restaurant_id": -4, "username": "PirloParty", "date_of_visit": " April 2019", "rating": "4", "title": "Good place and fiod", "comment": "Visited here for a friends birthday. The food is really tasty if not a bit expensive for the portion size. There was a DJ in the evening, and the drinks were good. There’s no system to the free drink offer and people get refused for no reason when others get multiple free drinks. It’s very cold in the evenings and the staff make excuses for not having the heaters on. Overall it’s a great place but the venue staff (not restaurant staff) are very rude to everyone ", "date_of_review": "20 April 2019"}
{"review_id": 65, "restaurant_id": -4, "username": "954jaes", "date_of_visit": " September 2018", "rating": "3", "title": "Brief visit", "comment": "Quick stop on the way out of London.  Quite nice, like a food court on a rooftop, under a pergola.  It helped it was 28 deg and quieter on a Sunday. Ordered white wine and two soft drinks for £11.00. Followed by veggie burger, fries and a vegan bao/ tofu meal and fries... £23.00. Not the cheapest, not the most expensive. Food was a 3/5, it is what it is, street food in cartons. Would go back if we were nearby, Paddington Central is quite nice now, but probably would travel too far to get to it.", "date_of_review": "2 September 2018"}
{"review_id": 66, "restaurant_id": -4, "username": "AdrianCorry", "date_of_visit": " September 2018", "rating": "2", "title": "Cool concept - Poorly Run! ", "comment": "Yesterday our friends who we have not seen for 12 years came over from Australia and they booked a day bed 12-5pm at the pergola as this was going to be a special day for all 20 of us. On arrival there was no booking for a day bed, even though the host booked it months ago from Australia. We were offerd an alternative area which was fine and we had a great day, good drinks and fab food.  The only reason i am marking you down is because the drinks service was very slow, drinks served in dirty glasses and the Very rude inexperienced lady door \"host\". We all work in hospitality and run very busy buisness, but under no circumstances would we have this person greeting and dealing with our guests. So get these few things right and you will have a great venue and 5 stars.", "date_of_review": "2 September 2018"}
{"review_id": 67, "restaurant_id": -4, "username": "mrsGiroud", "date_of_visit": " September 2018", "rating": "3", "title": "Something different", "comment": "This is a good location and I’m sure in the summer it was like a hot house inside. Very warm day, but no windows opened until we and many other people around us pleaded with the security staff (who were dressed as if it was winter ). Bar staff were very slow and you couldn’t take a jug of water back to the table, just those tiny little glasses of water. Good selection of food, the burger was one of the best I’ve had in a long time Definitely book in advance as they were turning away a lot of people Toilets not pleasant", "date_of_review": "8 October 2018"}
{"review_id": 68, "restaurant_id": -4, "username": "loux", "date_of_visit": " June 2018", "rating": "2", "title": "consistently poor management", "comment": "Decided to try La Pergola again after a very poor experience during the winter. This time the weather was nice and warm, on Sunday afternoon. The place was reasonably crowded but not overwhelmingly. Still the queue at the bar was very long and slow, mostly due to very inexperienced and slow bar tenders. Tried to order an aperol spriz and it was not available. Tried a few other cocktails and the answer was that they were not available Only basic gin and tonic, rum and coke and vodka soda were basically available. I ordered a bottle beer and i was served one that was totally warm. The bar tender did not bother asking me whether i would be ok with a warm beer, just opened the bottle and gave it to me.  This is so amateur and consistently poorly managed for a venue with such potential. Real shame.", "date_of_review": "11 June 2018"}
{"review_id": 69, "restaurant_id": -4, "username": "Mgnlj2112", "date_of_visit": " June 2018", "rating": "4", "title": "First visited ", "comment": "Decided to try Pergola recently after being on the places to visit list for so long. I found all staff smiley and helpful, we had booked a table so were directed downstairs where we were pointed to our table. I will admit I was expecting a bit more - maybe a view of London and more food places? The food we had was nice just felt there could have been a little more choice (the breaded Brie was very nice). Drinks were reasonably priced. Also, it gets SO hot and the fans don’t do much to cool you down. Overall I’m happy I paid a visit but probably won’t rush back. ", "date_of_review": "18 June 2018"}
{"review_id": 70, "restaurant_id": -4, "username": "109sophiea", "date_of_visit": " July 2018", "rating": "1", "title": "Falsely advertised & unsafe ", "comment": "Went here for a friends birthday and we will never go back! She booked a table and was told that there “wasn’t a roof here and the tables where all downstairs” which isn’t true. There are tables upstairs however it’s not got as many and they made everyone book their tables downstairs and no one was upstairs. The upstairs was ok but poor I said they don’t book you up here and omg downstairs is AWFUL! The pictures online show it being completely open roof and it’s not. This place has a roof on it in the style of a greenhouse roof and OH MY GOD ITS HOT! I’ve been to colder places in Dubai. Yes, they have fans but they do absolutely nothing to gain any sort of temperature regulation. I have no idea who’s idea it was to put a greenhouse style roof on a event place that would be used in the summer but whoever it is needs to go on a health and safety course as this is so dangerous. Every single person in there had sweat dripping off them. Everyone was using the napkins to dry the sweat. We had to put ice cubes from our prosecco bucket into our bras to cool us down. After an hour the place lost about half the people in it because no one could bare the heat. We had so much sweat on us all the girls had sweat patches when they stood up on their bums and backs! Ruining the outfits. Our hair was WET from the sweat! If you sit on the benches it’s so hot that you actually slide down them on the sweat on your legs. When you walk down from the roof you get an instant smack in the face from the heat worse than getting off an aeroplane. They do have water around EVERYWHERE but you’re only allowed a small cup. There’s danger of someone dehydrating in there mixing that amount of heat with alcohol. Although after 1 jug of pimms you’re so hot it puts you off even drinking - made obvious by the fact that when we first got there you couldn’t move to get a drink and after an hour there was no queue and you can walk straight to the bar for the rest of the day. It ruined our friends birthday and left everyone annoyed and boiling to the point where even some of the guests went home. Why it needs this roof I will never know as it’s only open in the summer therefore it’s not going to be in danger of being cold! ", "date_of_review": "8 July 2018"}
{"review_id": 71, "restaurant_id": -4, "username": "dorothyf1807", "date_of_visit": " June 2018", "rating": "5", "title": "Amazing service from Chelsea!", "comment": "Arrived as a walk-in group with 10 friends for my bestie’s birthday. Chelsea made us feel so welcome and accommodated our needs. We love her! Thank you so much! X", "date_of_review": "30 June 2018"}
{"review_id": 72, "restaurant_id": -4, "username": "Lornah1986", "date_of_visit": " July 2018", "rating": "2", "title": "Fun for a while - but tarnished by bad customer service and overpriced drinks", "comment": "I went to Pegola for a work night out. We were unlucky in that after a month of sunshine, we had heavy rain. However because when you book tables, you have to book downstairs and indoors, that wasn’t an issue. What was a problem was the security guard on the door upstairs.  We had to sprint in the rain to get there because taxis can’t get close to the door. The jobsworth on the door put the rope up in front of us and said “no walk-ins, you booked?” We were being rained on by stormy rain so said “yes of course”. He then walked off and left us there. My friend tried to move the rope back a little so that it was at least under the cover and was shouted at by the idiot on the door. We got that there’s a list but leaving people outside in torrential rain when their company have paid thousands of pounds isn’t good... it’s also just really, really crap as person. Bit more consideration would be lovely. When we got in, the staff were apologetic for him and seemed embarrassed, but too late. If the first thing you see is some idiot on the door who treats you like crap, that’s what you’ll take away.  When we found our table, it was alright I guess. Drinks are ridiculously expensive but the food is good. So it’s hit and miss.  There are a few staff walking around cleaning up but not many so don’t expect any help. With the plastic roof, its kind of like if you went to a campsite to eat and drink in a really humid country, and you wanted to pay £10 a drink for the pleasure of being yelled at by security. So yeah.... meh.", "date_of_review": "14 July 2018"}
{"review_id": 73, "restaurant_id": -4, "username": "HemK83", "date_of_visit": " June 2018", "rating": "4", "title": "Great atmosphere and pretty outdoor space!", "comment": "A little hard to find but once you arrive if the weather is nice its the perfect setting to be out for drinks. We reserved a table which would be reccomendable, unfortuntely when we arrived the lady at the entrance was a little unclear and we thought she mentioned to take a seat at a table towards the back and someone would be with us but actually we were meant to head towards the back and down some stairs to the seated area. By the time we realised this we had missed out table booking but fortuntely didnt have to wait long for a table to be available.", "date_of_review": "24 June 2018"}
{"review_id": 74, "restaurant_id": -4, "username": "Chloe_foodlover", "date_of_visit": " July 2018", "rating": "4", "title": "Nice ", "comment": "Nice venue in the office district of Paddington Central.  Staff are friendly.  Little disorganised as they can’t find the bookings they are meant to find. Roof isn’t great it rains.  Food is super expensive. Prepare for a pricey time. ", "date_of_review": "17 July 2018"}
{"review_id": 75, "restaurant_id": -4, "username": "HaylsAndDave", "date_of_visit": " July 2018", "rating": "3", "title": "Drinks and food", "comment": "Great setting and amazing food options. Bar staff could use a kick up the butt, no real sense of urgency, a bit of arrogance and unclean plastic glasses which they argued about when I tried to get another one. In my book, old lipstick and brown spots don’t constitute clean. Security staff and runners had an argument in front of people standing at the bar, seems like a bunch of amateurs managing the place. I would go again because of the quirky decor and food however. ", "date_of_review": "20 July 2018"}
{"review_id": 76, "restaurant_id": -4, "username": "319annalisap", "date_of_visit": " July 2018", "rating": "1", "title": "Awful!!!", "comment": "I booked a day bed for 10 people for my birthday last week. Today I wanted finally to see the venue and I went with my friend there. I also decided to change the time of the booking , so I went to the reception and I explained my situation. She said that there wasn’t any booking under my name; after a while she found the booking but it wasn’t on the day bed/sofa but on an ordinary table!!! I deleted my booking and I am now with a bday coming without a venue for my party!! The service was horrible on the bar too and it was EXTREMELY warm!!!!!!", "date_of_review": "15 July 2018"}
{"review_id": 77, "restaurant_id": -4, "username": "Go51780513592", "date_of_visit": " October 2018", "rating": "5", "title": "Very instagramable", "comment": "Beautiful venue, amazing Rosmary chips and great deals! Definitely a very affordable, however hip place! Will be back very soon!", "date_of_review": "12 November 2018"}
{"review_id": 78, "restaurant_id": -4, "username": "Spindo84", "date_of_visit": " July 2018", "rating": "3", "title": "Great concept ", "comment": "Overall a nice way to spend an evening. Has a decent buzz about it, good atmosphere. Critically though bit overpriced, food choices were ok but drinks selection pretty poor. Service from the bar was pretty laidback. ", "date_of_review": "22 July 2018"}
{"review_id": 79, "restaurant_id": -4, "username": "Andy C", "date_of_visit": " November 2018", "rating": "5", "title": "Wooden shack to amaze you", "comment": "What an illusion..... wooden shack in a location between busy roads and high rise office buildings and Hotel.  Welcomed by a friendly security chap and shown the way to the downstairs area.  Welcomed and shown to our table by a pleasant chap and explained how the Pergola works.  Great food options, plenty of drink options too.  Very relaxed, holiday type of setting.  One warning..... ladies be careful if wearing high heels..... loose slate covering on the floor surrounded by decking.  Wife and friends went in the summer... fans around the roof area.  We went November... but chilly, but heater lamps in place of fans plus blankets for those who wish to wrap up and relax more.  Food... SUPERB.  Service... SUPERB. Staff members.... SUPERB.  Pergola.... SUPERB, really enjoyable experience.", "date_of_review": "25 November 2018"}
{"review_id": 80, "restaurant_id": -4, "username": "MarcMLondon", "date_of_visit": " December 2017", "rating": "3", "title": "Good concept; slow service...", "comment": "Tucked away from Paddington station, this huge place escaped me for many months. I have finally found it! One of the things that drew my attention were the abundance of security. Are they expecting trouble? Here are 4 food concepts but we found the service very slow and sometimes, understaffed. It isn’t very cheap here either.  A great place for large groups of friends who are out for a party and do not mind paying. Feels almost like a Winter Wonderland without the Christmas feel.  I would rush back in a hurry Nor would I recommend in a hurry. There are other good places in the area. ", "date_of_review": "3 December 2017"}
{"review_id": 81, "restaurant_id": -4, "username": "MySloeLink", "date_of_visit": " September 2017", "rating": "4", "title": "Good vibe", "comment": "Went to a lunchtime bash here with around 40-50 others. Apart from us there were few other customers in but I don't think it fully opens and launches for winter until the end of October. Drinks choices were ok and the street food kitchens offer a few choices. Patty & Bun delivered their usual best burger in London and some of the other food offerings were quite good as well. Good value for a street food sesh and drink. We were lucky with the weather, not sure it would have quite such a vibe when it's blowing a gale in November! Worth going to and we may try and visit one Friday evening after work and see whether it lives up to its potential.", "date_of_review": "4 October 2017"}
{"review_id": 82, "restaurant_id": -4, "username": "muchobenny", "date_of_visit": " December 2017", "rating": "2", "title": "Overpriced and underheated.", "comment": "5.50 for a pint of Pilsner Urquell would be a tad steep in a normal bar, but in a place furnished with garden benches and no central heating it really isn't acceptable. You're essentially drinking and eating outside, without even patio heaters, in December. We wouldn't normally have stayed but we were all starving and the food is all fast food. We finished our food - Patty & Bun, always great - as quickly as possible and got ourselves to a proper boozer with a nice open fire.", "date_of_review": "14 December 2017"}
{"review_id": 83, "restaurant_id": -4, "username": "tropicalislandgirl", "date_of_visit": " December 2017", "rating": "3", "title": "Good atmosphere, rubbish food/drink", "comment": "Really nice idea, with a good vibe and atmosphere. Let down by universally tiny portions (eg. the burgers are the size of a McDonald's cheese burger and are about £9-10 and the tonkatsu pork broth had just one small slice of pork in the whole pot of ramen). Generally overpriced. Drinks selection very limited. Free drink promised if you sign up to their mailing list but that turned out to be only valid for a shambolic soft drink only. So don't bother signing up for the free drink!", "date_of_review": "5 December 2017"}
{"review_id": 84, "restaurant_id": -4, "username": "saintlysinner", "date_of_visit": " December 2017", "rating": "3", "title": "Overrated!", "comment": "My sister suggested to go here for our Christmas drink. On first impression the place looks cool. At the time I enjoyed my visit here. However on reflection it's nothing short of an indoor fast food place with expensive drinks. ", "date_of_review": "23 December 2017"}
{"review_id": 85, "restaurant_id": -4, "username": "J7466DKchrish", "date_of_visit": " December 2017", "rating": "2", "title": "Celebrating a friends Birthday", "comment": "I would not go back. The venue has so much promise and the food hall market will grow over the next few years but the customer service and experience is shocking. We arrived and I took a bottle of champagne for my friends who's birthday it was but wasn't allowed to take this in. they insisted I took photos of the wrapped bottle of champagne so we could pick it up later.  There were only 4 food outlets open on the Sunday before Christmas, Patty & Bun, a pizza place, DF mexico and a dodgy Japanese outlet which were all fairly poor and even so took ages to get served. It was cold, the \"bouncers\" were overly officious and told us to get the children out at 5pm, there were 3 families, and we left before our friends who, because they didn't have the photos couldn't get the bottle of champagne, shocking experience really and we won't be back. I hear the same company is doing a couple of further outlets but I will avoid.", "date_of_review": "19 December 2017"}
{"review_id": 86, "restaurant_id": -4, "username": "laurenkelsey21", "date_of_visit": " December 2017", "rating": "2", "title": "Cold, rude staff", "comment": "Visited as a group of 5. Free drink voucher was only for a soft drink or ‘house cocktail’ which was some weird hot rum concoction. Doesn’t say this on the voucher. Bar staff were rude and the food was pretty pricey. I wouldn’t go back.", "date_of_review": "3 January 2018"}
{"review_id": 87, "restaurant_id": -4, "username": "pepa2015", "date_of_visit": " May 2018", "rating": "1", "title": "Unapologetic, unmotivated and uninspiring staff", "comment": "The pictures dont do this place justice. If you're looking for a leafy environment with a cool, chic feel where you can get drunk then this is NOT it. The drinks were overpriced (cheapest pint £5.50) and there was a selection of two. It took over an hour at the bar, manned by one slow-moving early twenty something with 3 deep all questioning the decision to man a bar with 40 thirsty punters with one member of staff?!? Having not been able to get a drink, our party, which had 5 free margaritas and 5 free Peronis waiting for us at the slowest bar on earth - we decided to leave. On exit, the excuse was 'its bank holiday'. We told them we'd pop our thoughts on TripAdvisor. The man said 'fine'. Unapologetic, unmotivated and uninspirational. ", "date_of_review": "7 May 2018"}
{"review_id": 88, "restaurant_id": -4, "username": "billthefirst", "date_of_visit": " September 2017", "rating": "4", "title": "Buzzy atmosphere brining the outside in", "comment": "You can sit out on the roof terrace, but as it was drizzling, we descended into the large covered area. There is not much choice for beer or wine, but plenty of different styles of food. You go to the kitchen window and but your food, which is great for a large crowd - minimal queuing and lots of different choices (Chinese/ Mexican/ Burger/ vegan Pizza/ Seafood). It is very informal and you keep changing places as people get up for food - great for a large after work get together. This one is only open until next month, so hurry!", "date_of_review": "14 September 2017"}
{"review_id": 89, "restaurant_id": -4, "username": "tlmaid", "date_of_visit": " May 2018", "rating": "5", "title": "Fabulous service", "comment": "My friends booked on a sunny Saturday for my birthday. The venue looks great, everyone enjoyed the varied and reasonably priced food and the free frozen margarita (you need to sign up before hand for voucher) was an added bonus. The processco was a little pricey but wine reasonable.  It was very hot when we went and I ended up fainting! The staff, in particular the security staff couldn't have been kinder and more helpful. They produced a chair in the shade and lots of ice and water. They kept checking on me and were brilliant. Thank you and will definitely be back.", "date_of_review": "27 May 2018"}
{"review_id": 90, "restaurant_id": -4, "username": "Emma M", "date_of_visit": " May 2018", "rating": "4", "title": "Cool place to visit", "comment": "We visited Pergola Paddington Central whilst in London for a long weekend. The weather was FANTASTIC when we visited and although other reviews have not been so kind we found this place to be great! The staff were friendly and the whole place had a nice atmosphere. The food is great although the service at the food stands can be a bit slow, everything is cooked to order so the wait is understandable. We had booekd a table in advance and we were there earlier in the day. Overall we found Pergola Paddington Central a great experience!", "date_of_review": "17 May 2018"}
{"review_id": 91, "restaurant_id": -4, "username": "Sam J", "date_of_visit": " December 2018", "rating": "2", "title": "Overpriced average booze and food", "comment": "I wouldn't bother. There are plenty of better places around. Booze is weak and overpriced food is average. ", "date_of_review": "7 December 2018"}
