{"review_id": 1, "restaurant_id": -3, "username": "490zacc", "date_of_visit": " July 2019", "rating": "5", "title": "Pappardelle heaven ", "comment": "Yum. Delicious fresh pasta, bean and anchovy salad, washed down with a crisp beer. Friendly staff. Good food.", "date_of_review": "13 July 2019"}
{"review_id": 2, "restaurant_id": -3, "username": "SolihullRichard", "date_of_visit": " August 2019", "rating": "5", "title": "Range of great dishes to share", "comment": "Half of our party have some dietary requirements and the staff were excellent both on our call to book and when ordering. There are a limited number of dishes in each course with all freshly cooked in the open plan kitchen. Some great fresh tasting dishes topped by an interesting wine list and a choice of three home made digestifs of amaretto, limoncello and coffee liqueur. Maybe in a strange location on an old industrial park but definitely worth a visit", "date_of_review": "3 August 2019"}
{"review_id": 3, "restaurant_id": -3, "username": "827Janty", "date_of_visit": " April 2019", "rating": "3", "title": "Two stars for food, upped to three", "comment": "I scored this two but as the food for the others was ok, upped to three. Visited a Sunday Lunch time.  Squeezed on long table, very noisy. Garlic toast is what it is; fish not seasoned at all; a lot of agretti was like chewing on twigs; the roast potatoes and spinach must have had the salt meant for the fish; spinach far too wet (and full of salt). Dessert panacotta was delicious. Others had the spatchcock chicken which looked lovely (and I was told it was) Overall, for me, very expensive for both food and the experience.", "date_of_review": "7 May 2019"}
{"review_id": 4, "restaurant_id": -3, "username": "kfrancesb", "date_of_visit": " June 2019", "rating": "4", "title": "Great food with friends", "comment": "Went in on a Saturday with friends and had a gorgeous meal and really good wine. Really good atmosphere and great food.", "date_of_review": "5 November 2019"}
{"review_id": 5, "restaurant_id": -3, "username": "hurremm2018", "date_of_visit": " May 2019", "rating": "3", "title": "I expected better...", "comment": "I came here with a group of friends the Friday just gone. Whilst the service and drinks were nice (I had one Aperol Spritz and then a Campari Spritz), I was underwhelmed by the food. I knew the pasta dishes were small so you could try a few, and I enjoy that part as I have been a a few Italian restaurants like this, so this was no issue. However, the food itself was just disappointing. I could have made better at home sadly, and in comparison to other restaurants I have been to (Padella, for example), it was spectacularly below the standard that I had expected. I had the 'Spaghetti' dish, which consisted of peas and cheese, and we ordered garlic bread. The garlic bread was rather sparse in terms of portion - 1 piece each, which is a shame as I enjoyed that. The pasta was a bit bland, nice cheese on top, but I expected better. I would come again to try a few dishes, maybe it was just a bad night, as it wasn't terrible. But at least now I know what to expect, sort of.", "date_of_review": "15 May 2019"}
{"review_id": 6, "restaurant_id": -3, "username": "ElizaH233", "date_of_visit": " March 2020", "rating": "3", "title": "Off putting", "comment": "I came here with a group of 6 friends on a weekday evening, and had booked well in advance. From the moment we sat down we were made to feel on edge from the waiting staff. The first thing said to us was that we had to leave the table at 8pm sharp (even though we were sitting in a completely empty restaurant) We were repeatedly asked if all 6 members of our party were going to be present. (We all arrived within 5 minutes of our allotted time) Despite the off-putting atmosphere from the servers, the food was all perfectly acceptable and only worth it because of the 10£ pasta wine deal, otherwise I wouldn’t have bothered as the pasta wasn’t anything spectacular for the price. It wasn’t an entirely relaxing experience, and our entire party left feeling on edge and displeased with the strange atmosphere and unwelcoming attitude of the staff.", "date_of_review": "12 March 2020"}
{"review_id": 7, "restaurant_id": -3, "username": "Q3558ETnatashac", "date_of_visit": " March 2020", "rating": "2", "title": "Underwhelming", "comment": "A strange dining experience. The £10 pasta and glass of wine option between 6-7pm is a fair deal but wouldn’t rush back for the service or quality of food. I would have been thoroughly disappointed if I had paid the full price for the slightly uninspiring pasta options available. Came with a group of friends at 6.30pm, but before 6.35 had been asked/told we must leave at 8pm, which is fair enough but not the most welcoming line upon arrival to an empty restaurant? The starters were quite nice but very expensive for the portion sizes. The red wine had a lot of sediment in it and the white wine had a strange cloudiness. Although attentive, the staff’s lingering presence around our table made us all feel quite uncomfortable and eager to leave before the 8pm deadline. Average food, strange ambience and left still feeling peckish.", "date_of_review": "12 March 2020"}
{"review_id": 8, "restaurant_id": -3, "username": "dianne n", "date_of_visit": " December 2020", "rating": "5", "title": "Xmas Hamper", "comment": "Was lucky enough to receive one of Forza wine hampers for Xmas from my son Josh Absolutely loved it, especially the biscotti  Really really pleased with everything that came Looking forward to the time we can actually visit restaurant , hopefully next year when all restrictions are lifted ", "date_of_review": "25 December 2020"}
{"review_id": 9, "restaurant_id": -3, "username": "dorton", "date_of_visit": " February 2020", "rating": "5", "title": "LOVED IT & STILL LOVE IT", "comment": "Absolutely loved our visitng to Forza, up up and away from it all. Fabulous food and very unique. Really warm and fun atmosphere too - cant wait to see you back up and at them! ", "date_of_review": "25 September 2020"}
{"review_id": 10, "restaurant_id": -3, "username": "mnita227", "date_of_visit": " November 2018", "rating": "5", "title": "Fantastic food!", "comment": "We went there with my boyfriend for a date lunch :) The food was absolutely delicious. The service was great and very helpful. We loved the decor and the open kitchen is just a treat to watch while you wait for your food. We can't wait to be back!!", "date_of_review": "7 January 2019"}
{"review_id": 11, "restaurant_id": -3, "username": "Steve P", "date_of_visit": " January 2019", "rating": "5", "title": "Fantastic food and service ", "comment": "Really tasty food served in small plates,ideal for sharing ,excellent service from a young but knowledgeable staff ,wine list isn't too lumpy either ,a real treat . ", "date_of_review": "12 January 2019"}
{"review_id": 12, "restaurant_id": -3, "username": "Biblioswiss", "date_of_visit": " January 2019", "rating": "5", "title": "Peckham Prizewinner", "comment": "What a find! In deepest south London's old industrial quarter but easily accessible by overground, this is the place for excellent fresh and beautifully cooked, seasonal Italian food with an Asian twist. The enthusiastic young chefs and staff help you enjoy yourselves. We had cassouela - braised pork with cabbage and polenta, washed down with a great wine from the Marche (Ciu Ciu), while the next table devoured between them a whole grilled chicken. Great atmosphere, too.", "date_of_review": "16 January 2019"}
{"review_id": 13, "restaurant_id": -3, "username": "GMY94", "date_of_visit": " August 2018", "rating": "5", "title": "Delicious pasta", "comment": "Had an amazing time here. The staff were so attentive, the pasta was great, but the deserts were the best thing. You MUST try the custardo - it'll change your life.", "date_of_review": "20 January 2019"}
{"review_id": 14, "restaurant_id": -3, "username": "Josephine M", "date_of_visit": " March 2019", "rating": "4", "title": "Fresh and modern Italian - can try lots of different things! ", "comment": "Perfect for a group of foodie friends catching up for a mid week dinner. We ordered lots of things to share and it came to just over £30 each which including a couple of bottles of wine I don’t think is bad value at all!  The food was very good:  For the anti pasti we had the garlic toast, ham and mustard pears, mozzarella, smoked eels, mussels and punterelle (posh chicory with anchovies). Then we shared spaghetti with roasted tomato and Parmesan and radiatore with garlic parsley and chilli. We also had roasted potatoes and bread and butter!  The food was fresh with a blend of traditional and experimental Italian flavours. I feel like you can always trust a place that does wonderful things with its vegetables! The radiatore and garlic toast was our favourite and we ordered extra!  The ambience was fun and trendy! And Peckham is a cool place with lots of bars to go to before or after. The staff were friendly and welcoming. Also forza wins Instagram account is hilarious definitely check it out!  Where there is room for improvement: Im pescatarian so didn’t try it but my friends said the ham and pear was very strange and a bit like supermarket sliced ham on a plate with a tinned pear (it looked like that) however I didn’t try that dish and everything else was amazing!  The mozzarella was flavoured to perfection but at £12 very overpriced. Probably because people are willing to pay for it. I guess that’s capitalism for you!  That said, generally good value for a top notch unusual Italian. I really liked it and would come again.", "date_of_review": "28 March 2019"}
{"review_id": 15, "restaurant_id": -3, "username": "Jonty1961", "date_of_visit": " March 2019", "rating": "4", "title": "I'm in Peckham?", "comment": "Booked up for a Sunday lunch after being recommended this Italian in Copeland Park, Peckham. Walk through the Bussey Building and you'll find right at the park near Copeland Road. It's an old warehouse/factory building which means it's easy to hear your conversation in this buzzing venue. The menu is straight forward and easy to follow. Elly and myself shared a spatchcock chicken with some salad and roast pots plus a lovely broad bean side dish. I haven't eaten broad beans since I was 10! They were a great surprise and very tasty.", "date_of_review": "18 March 2019"}
{"review_id": 16, "restaurant_id": -3, "username": "kevoed", "date_of_visit": " March 2019", "rating": "5", "title": "Yummy lasagne ", "comment": "This restaurant is hidden away at the back of Peckham’s Bussey Building so isn’t easy to find; i lived in Peckham for years before becoming aware of this place. Being Peckham it is, of course, very hip and trendy; when asked for a beer i couldn’t work out if my glass was for drinking out of or a vase for flowers.  Portion sizes are small so you need several dishes to fill you up. The lasagne was delicious: better than what i had in Italy. The dishes are probably slightly pricey given the portion size.  Service was excellent. Will definitely be coming back. ", "date_of_review": "31 March 2019"}
{"review_id": 17, "restaurant_id": -3, "username": "Izzysaunders", "date_of_visit": " April 2019", "rating": "5", "title": "Really delicious", "comment": "Tried a variety of dishes, the standout ones were the rabbit toast starter (unbelievably tasty) and the lamb & caper pasta which had a very generous helping of parmesan on top. All dishes were great, the service was informal yet attentive. Really enjoyed my meal here", "date_of_review": "30 April 2019"}
{"review_id": 18, "restaurant_id": -3, "username": "Michael B", "date_of_visit": " January 2019", "rating": "5", "title": "Excellent food in backland area of industrial sheds.", "comment": "Excellent quality authentic Italian food in an unlikely area. Modern food, enthusiastic staff - a good lunch.", "date_of_review": "4 April 2019"}
{"review_id": 19, "restaurant_id": -3, "username": "Katy P", "date_of_visit": " May 2019", "rating": "5", "title": "DELICIOUS", "comment": "Wow what can I say this place is the nuts. it's not fancy it's just seriously good italian home cooking. The pasta is to die for , and the giant meatball with tomato sauce out of this world. the lemon tart was seriously unctuous, and the perfect level of citrus. The housemade limoncello really finished the meal nicely.", "date_of_review": "2 May 2019"}
{"review_id": 20, "restaurant_id": -3, "username": "ERICA w", "date_of_visit": " November 2018", "rating": "5", "title": "Fantastic food , great service", "comment": "I went there with my daughter , the food was great ,and the service friendly and efficient. They are hugely enthusiastic about what they do here. I really appreciated the Italian with a twist that they have going on. I will definitely send my friends along....", "date_of_review": "21 December 2018"}
{"review_id": 21, "restaurant_id": -3, "username": "84ami", "date_of_visit": " January 2020", "rating": "5", "title": "Great atmosphere, lovely staff", "comment": "We went to forza win for the first time and we'll definitely be back. The space is welcoming with a great atmosphere. The kitchen extends out into the restaurant so you can see the chefs prepare the food. We did the pasta and wine for £10 deal which was delicious, and we also added on an appetizer and a main. The dishes are shareable but the portions are also the perfect amount if you want your own dish.  Afterwards we went to the new sister bar, forza wine, which I highly recommend. ", "date_of_review": "15 January 2020"}
{"review_id": 22, "restaurant_id": -3, "username": "26july", "date_of_visit": " August 2018", "rating": "4", "title": "The best ever tiramisu!", "comment": "This place is a little pricey: we paid £62 and that only bought us 2 starters (the garlic mushroom toast was lovely though) and a couple of (very small) taster pasta dishes (the tomato sauce/spaghetti dish was very average, spaghetti some what over cooked) a beer and a glass of wine, oh and an amazing dish of tiramisu. All considered, it is a rather pricey place. Chef/owners no doubt disagree, but hey ho. Sadly, we can't select an in between average/very good rating (generally this annoys me!), cos we might wander back towards the average but then some of the dishes were very nice, but overall the place does not deserve a 'very good' I think. Hmmmmm... Service here was rather good - nice waitress. But I don't think we'll be back. I was expecting a wow from these guys, but you can't win em all. I'd drop 5% off the food cost and put a little more on the plate and I'd listen/act on comments/reviews left on this site. Reviews here will put some people off, as you will know.", "date_of_review": "20 August 2018"}
{"review_id": 23, "restaurant_id": -3, "username": "menelaus r", "date_of_visit": " August 2018", "rating": "4", "title": "great local italian passionate team", "comment": "Popped in off the cuff with a friend. Lovely service. Team in kitchen looked very serious and ready to please, smile gents your food is great. Lovely chilled red and food was very tasty and authentic made with passion and plume. Decor minimalist and sooo cool they have put a little light into copeland. A must go!!!!", "date_of_review": "28 August 2018"}
{"review_id": 24, "restaurant_id": -3, "username": "271alistaird", "date_of_visit": " September 2018", "rating": "4", "title": "Really tasty food, bit of a hidden gem", "comment": "Went for a Friday evening dinner with my family, including two pre-teens. Had a really tasty meal, and thought the pricing wasn't too bad - about £135 for 4 of us, incl starters, mains, puddings, wine & tip. Nice mix of starters incl excellent garlic bread (tad burnt?), and delicious polenta chips with walnut. Mains were a well cooked & tasty whole fish, aubergine with nuts (vegetarian) and couple of spaghettis with tomato sauce and generous amounts of parmesan. Puddings were traditional - chocolate puds,tiramisu - nothing special but nicely done. Service was patchy, but it was a busy night, and we had no complaints.  All in all, really liked it, and we will be back!", "date_of_review": "26 September 2018"}
{"review_id": 25, "restaurant_id": -3, "username": "Koermendi", "date_of_visit": " August 2018", "rating": "4", "title": "£120 and change, including £20 cash tip -- ah, London!", "comment": "Strongly recommended. Our friendly, efficient waiter quickly and pleasantly corrected initial organisational deficiencies -- no salt or pepper shakers in the table setting fish to be boned and no plate on which to place the debris erm, that's it Caponata / beetroot-mozzarella-walnuts. Onglet steak and wax beans, grilled mackerel and wilted spinach. Everything interesting, everything beyond make-it-at-home capabilities (at least beyond mine). Two glasses of an indifferent draught beer, a bottle of decent Chianti. We enjoyed ourselves. Four stars rather than five because, well, a tad pricey. Not about to become our once-a-week treat-ourselves eatery. But we'd take guests here.  Top tip: Ask for a table in the section with the dark-haired bloke, freckled forearms, snub nose, knows what he's doing.", "date_of_review": "16 August 2018"}
{"review_id": 26, "restaurant_id": -3, "username": "wendoline91", "date_of_visit": " August 2018", "rating": "4", "title": "Decent Italian food and a good atmosphere", "comment": "Dined here with a friend and had a bit of everything. Very buzzy atmosphere for Wednesday night - we left happy.", "date_of_review": "29 August 2018"}
{"review_id": 27, "restaurant_id": -3, "username": "tatdesousa", "date_of_visit": " October 2018", "rating": "5", "title": "stunning place", "comment": "Can't get enough of this beautiful gem in Peckham. Food, atmosphere and service all stop and the weekly menu change is a fine touch.", "date_of_review": "26 October 2018"}
{"review_id": 28, "restaurant_id": -3, "username": "lanabrad", "date_of_visit": " November 2018", "rating": "3", "title": "Nice atmosphere, disappointing food", "comment": "Good location and nice setting in a converted warehouse outside Bussey Building, decor is good and I love an open kitchen watching the Chefs. Service is friendly and attentive, but the wait for food was way too long - around an hour for mains to come. Food was a little bland, pasta portions disappointing in size and taste, lamb shank with risotto was swimming in some sort of oil or sauce. £32 for a whole chicken with no sides, and only given a steak knife to carve, would be nice to be offered for it to be sliced as it got messy. Sides are very small for £5 - left feeling hungry unfortunately. ", "date_of_review": "4 November 2018"}
{"review_id": 29, "restaurant_id": -3, "username": "942duncanw", "date_of_visit": " November 2018", "rating": "5", "title": "Pasta in Peckham", "comment": "Spent the afternoon discovering the delights of Peckham and Forza Win was definitely a highlight. Unpretentious but stylish - friendly service and amazing food at reasonable prices makes this place a winner. Menu is Italian - limited selection - open kitchen with a friendly buzz this was the perfect venue for a lazy Sunday lunch. Give it a try - you won’t be disappointed. ", "date_of_review": "11 November 2018"}
{"review_id": 30, "restaurant_id": -3, "username": "silvia f", "date_of_visit": " November 2018", "rating": "5", "title": "What are you looking for?", "comment": "I could tell you a lot about this restaurant but what is sure is that you will find enthusiasm, passion, taste of Italy and lovely people around you.  Homemade fresh pasta and genuine ingredients to make your experience memorable .  Buon appetito", "date_of_review": "29 November 2018"}
{"review_id": 31, "restaurant_id": -3, "username": "Leylahni", "date_of_visit": " July 2018", "rating": "4", "title": "Great service", "comment": "Walked in for a drink a few days ago after travelling for ages. It was raining heavily outside . The team were very courteous and helpful. The drink was also good. Looking forward to returning for a full meal as the place looks nice and quirky :).", "date_of_review": "29 July 2018"}
{"review_id": 32, "restaurant_id": -3, "username": "VOP30", "date_of_visit": " March 2018", "rating": "4", "title": "Deep Fried Mussels!", "comment": "Great atmosphere and food for a Friday night dinner with friends. Very helpful and friendly staff were able to fit us in last minute too. Deep fried mussels were excellent!", "date_of_review": "24 March 2018"}
{"review_id": 33, "restaurant_id": -3, "username": "Bill E", "date_of_visit": " April 2018", "rating": "5", "title": "A real gem!", "comment": "Tucked away a short hop from Peckham Rye station, it has the relaxed urban vibe you would expect in an up-and-coming area.  The food is a delight... the bruschetta tasted as if the tomatoes had just bounced off the vine onto the plate; the sea bass was a triumph of fennel and coriander seed flavour. Service was friendly and informed, our waitress was spot-on with advice on the best dishes and accompanying wine. The whole meal was such a delicious experience without any fuss or pomp; even as we were leaving we started planning our next visit. If only all meals out were as pleasurable as this.", "date_of_review": "7 April 2018"}
{"review_id": 34, "restaurant_id": -3, "username": "markylonn", "date_of_visit": " June 2018", "rating": "1", "title": "Forza Lose", "comment": "Looks amazing, service brilliant, food tastes amazing... BUT the portion size was more amuse bouche than a lunch. My bouche was far from amused. Smaller than a child's portion. It's basically 20ps worth of pasta and some sauce and a very small portion at that. £33 for a bottle Gavi. £7 more expensive than The Ivy. Sadly won't be back as it's just not value for money.  It's Peckham not Mayfair.", "date_of_review": "3 June 2018"}
{"review_id": 35, "restaurant_id": -3, "username": "Biggreymouse", "date_of_visit": " May 2018", "rating": "5", "title": "Little hidden gem ", "comment": "My daughter has just moved into the area & found this Italian restaurant situated in a warehouse. The food was amazing. The atmosphere was buzzing & overall great dining experience ", "date_of_review": "20 May 2018"}
{"review_id": 36, "restaurant_id": -3, "username": "Sophie G", "date_of_visit": " June 2018", "rating": "4", "title": "Forza out of five stars", "comment": "I took my friend to Forza Win yesterday for a birthday dinner on Awesome Sauce night and had a fabulous time. Firstly, it's such a gorgeous space; light, bright and airy & really great for summer dining.  For our starter we picked the grilled fontina cheese sandwich which was a real highlight. You can tell all the ingredients are great quality because impressively it didn't feel heavy or rich at all and came we loved the smoky chilli sauce on the side. The pasta mains were well made - perhaps the least tasty offering of the meal interesting. The pasta was silky and thin however and some of the best fresh stuff I've eaten. The real highlight was the side of wilted spinach that had tonnes of flavour. For dessert we shared the tiramisu which had a delicious thick custardy cream on top and shavings of fresh chocolate. Service was pretty good - all in all a really wonderful place and I will be back!", "date_of_review": "7 June 2018"}
{"review_id": 37, "restaurant_id": -3, "username": "Ben_baguette", "date_of_visit": " June 2018", "rating": "4", "title": "Hidden gem in peckam", "comment": "This hidden restaurant is hard to find, behind a warehouse, is the best Italian food around. I had tagliatelle and rabbit and it is honestly the best pasta I had in a while. Take a trip out to this place and it will be worth it. . They should try advertise it more to get better clientele. ", "date_of_review": "13 June 2018"}
{"review_id": 38, "restaurant_id": -3, "username": "claireo103", "date_of_visit": " March 2018", "rating": "5", "title": "Great Italian food", "comment": "This was our first time back in this place since their re-furb and it has got even better. The mozzarella starter and meatballs were amazing. Great wines to choose from. This has become a local favourite for us. ", "date_of_review": "23 March 2018"}
{"review_id": 39, "restaurant_id": -3, "username": "Sarah13_mtl", "date_of_visit": " March 2018", "rating": "4", "title": "food was excellent but but a bit pricey ", "comment": "We really enjoyed the pasta and the desert was excellent, great service too but thought it was a bit pricey for what we ordered. Will try to go back on a Wednesday when they have special price. ", "date_of_review": "18 March 2018"}
{"review_id": 40, "restaurant_id": -3, "username": "bert1958", "date_of_visit": " June 2018", "rating": "2", "title": "Poor service ", "comment": "We went for early dinner on a Saturday, the food was great and wine lovely. I have been to this place several times before and always loved the food, atmosphere, and especially the friendliness of the staff. However in this occasion our server was so miserable and obviously he didn’t want us there. We felt rushed and wanted to leave as soon as possible. When we left I noticed he had a big scratch on his arm (not covered with a dressing!) I know this sounds a bit childish and some can even say “first world problems “ but when you are paying £150 for dinner I’d spect to be treated at least with politeness.", "date_of_review": "24 June 2018"}
{"review_id": 41, "restaurant_id": -3, "username": "emily_magic", "date_of_visit": " December 2016", "rating": "5", "title": "Great good at great price", "comment": "We went here as \"market research\" for a similar product my boyfriend is running in France (not stealing your idea I promise! The Alps are much colder and the food is much more potato based! Haha) but we wanted to experience the \"shared dining\" without committing to the long evening so popped in on a Wednesday for the pasta and drink for a tenner evening! Had a starter of bread and oils and olives and then both the pasta dishes (half each!) And I had wine and he had beer. Overall the wine was fine, decent and drinkable for the price and beer was biere morretti which is one of the boyfs favourites. The food was... Outstanding. We had a beef pasta and spaghetti with perhaps ricotta (apologies in advance that we just ordered one of each and didn't really mind what it was as we eat anything and there were 2 options so got those 2 and didn't 100% pay attention to what they were)... But it was TOTALLY delicious and COMPLETELY perfect. For a tenner we can't believe how delicious the meal was. Homemade pasta and amazing flavours and the quality was incredible. I would recommend this to anyone who wants a no-frills Italian high quality and less than usual London prices.  The staff were really friendly too.  We really enjoyed our experience there, admittedly we wouldn't go on a buffet evening but we feel that's no fault of Forza Win, we know the score and know it's not our thing and are glad they don't miss sell it just to get people in the door. Hats off to you. Fab.", "date_of_review": "15 January 2017"}
{"review_id": 42, "restaurant_id": -3, "username": "fdm190", "date_of_visit": " March 2017", "rating": "3", "title": "lovely home-made pasta, but not a dining experience - feel like I gave money away", "comment": "Have wanted to try Forza Win for some time - their instagram looks great!! We went for their Wednesday pasta and a wine/beer for £10. We ordered some bread to start and then our pasta, and within minutes of sitting down the bread and pasta were at the table. The pasta was lovely and homemade, but the portion was more appropriate for a 5 year old. We ordered tagliatelle with wild garlic pomodoro, which was essentially just a tomato sauce - nothing else. I would not have been happy paying £8 for the portion we got. Also, we were then finished within about 10 minutes and ready to leave. It would have been nice if we had been given our bread, had our drink, perhaps ordered another and then got our main pasta dish. This made it feel like we had literally just given money away. When you go out for dinner, you go for the experience, not just to be rushed in and out - we were literally in the restaurant for about 10 minutes. It felt like they just wanted you in and out asap. All very rushed and not the dining experience we wanted. Overall, rushed and small portions - went home hungry. A real shame.", "date_of_review": "23 March 2017"}
{"review_id": 43, "restaurant_id": -3, "username": "JohnPage123", "date_of_visit": " January 2017", "rating": "2", "title": "Unspectacular food and not much of it", "comment": "The communal seating is a nice touch however when you are paying a decent wedge for tiny portions of pretty average food, you can't help but feel ripped off. Everyone around us left hungry and felt it was no better than your average home cooked Italian food. If all your mates are going, just meet them after for a drink, you're not missing out on much. At least you won't be hungry. ", "date_of_review": "29 January 2017"}
{"review_id": 44, "restaurant_id": -3, "username": "TammyW1998", "date_of_visit": " July 2017", "rating": "1", "title": "Once inspiring now insipid", "comment": "It's with a heavy heart I write this. I used to love going to Forza but the heart of it seems to have gone. No more hearty, belly busting meals with so much booze and fun. The food has lost it's way in portion size and preparation. I left hungry and underwhelmed. For the price I expect better.", "date_of_review": "9 July 2017"}
{"review_id": 45, "restaurant_id": -3, "username": "Jason T", "date_of_visit": " September 2016", "rating": "5", "title": "Great night", "comment": "Brilliant food, friendly communal tables, loads of drinks. Owner seemed a really nice guy. Big forehead ", "date_of_review": "19 August 2017"}
{"review_id": 46, "restaurant_id": -3, "username": "graucho2015", "date_of_visit": " August 2017", "rating": "4", "title": "Good place to chill after shop till drop", "comment": "Went there after some time spent shopping around Oxford street. It was not crowded, nice music being played, served delicious tea and curious black lemonade. You can sit outside.", "date_of_review": "12 August 2017"}
{"review_id": 47, "restaurant_id": -3, "username": "emily_magic", "date_of_visit": " February 2017", "rating": "5", "title": "An absolute steal and delicious!", "comment": "Went here on a whim with the other half on a Wednesday and by George was it tasty... Got the £10 deal meal and drink and had the tastiest fresh pasta with beef and jeepers creepers it sure was fresh and tasty! Good beer list, good option of veggie and meat pasta dish plus a beer and wine!  Will definitely be back!", "date_of_review": "12 November 2017"}
{"review_id": 48, "restaurant_id": -3, "username": "tou_can_travel2016", "date_of_visit": " September 2017", "rating": "1", "title": "One positive: it won't still be around in a year", "comment": "Went here with a group of 25 for a birthday meal on their Wednesday Awesome Sauce night when you're meant to get a bowl of pasta and a drink for a tenner. Somehow they had decided we were a party of 18, don't know why, a quick count would have shown them otherwise. They decided to give us sharing dishes, but as they were cooking for too few, there wasn't enough to go round and it left most of us hungry. The vegetarians were worst off, there was one dish for them - pasta with a plain tomato sauce, and little left over after the meat eaters had had their share.  When we explained to the manager that we hasn't had much food, he became very defensive, despite us explaining the problem calmly. He said that he'd asked one person on the table (not the person who's birthday it was) and they'd said it was 18 people and hadn't let him know about any dietary requirements. It was baffling that he thought that one person would know everyone's dietary requirements, or even necessarily know the size of the party.  Rather than offer to make us more food, which we would have happily paid for, we were given excuse after excuse. I wonder if they'd perhaps run out of pasta, or their 'awesome sauce'. Avoid Forza Win at all costs. ", "date_of_review": "14 September 2017"}
{"review_id": 49, "restaurant_id": -3, "username": "mattcZ4966TB", "date_of_visit": " July 2018", "rating": "1", "title": "Terrible food and service", "comment": "Went last night for dinner with friends. Chicken was undercooked and tasteless. Wine was corked and the staff were unfriendly/rude. Would never eat here again.", "date_of_review": "15 July 2018"}
{"review_id": 50, "restaurant_id": -3, "username": "Elise_loves_holidays", "date_of_visit": " August 2016", "rating": "5", "title": "Share share share!!", "comment": "This place is just brilliant. You buy tickets up front and then just sit back, relax and stuff your face until you can't eat a single thing more. You can buy drinks when you get there - a good selection particularly on the wine and very very reasonably priced. You will be sat at one of two long 'family style' tables and the last few times I've been we've had a great time with the people we were next to. The more the alcohol flows the more you get to know each other. The food is great, again comes family style so you share with your table. There is plenty of it so pace yourself! If there is anything you want more of, just ask, there is always spares. Highly recommended brilliant fun night out. The people who run this place are fantastic, upbeat, fun and passionate about what they do. One of my favourite places in London. ", "date_of_review": "20 August 2016"}
{"review_id": 51, "restaurant_id": -3, "username": "andrewmE7137NR", "date_of_visit": " December 2017", "rating": "5", "title": "Relaxed, welcoming and delicious ", "comment": "Went for a midweek family catch up and it was perfect. Relaxed environment with welcoming atmosphere. Interesting menu with lots of ingredients I hadn't tried before (staff were happy to help with explanations!). Highlights were the roast beef and the chicken with nduja. ", "date_of_review": "12 December 2017"}
{"review_id": 52, "restaurant_id": -3, "username": "Pibochen", "date_of_visit": " August 2016", "rating": "3", "title": "The whole experience was average but definitely NOT the food", "comment": "This place has great ethos - local ingredients, minimum wastage and good food cooked over wood. £35 for 5 courses was a bargain.  The food started coming at 20:00 The bread and olives were very welcomed as I was starving by then. The whipped bean paste was delicious but I only got a spoonful. The grilled vegetables were nice but had to order more. The 1st lot of toasted almonds were too salty for me but they brought some more with less salt on and they were lovely. The pasta was yummy and so was the steak. I liked the flat bread (which I watched one of the chaps made and baked in the wood oven) especially when it had soaked up all the meat juices. There was a lot going on and somehow the salsa verde got a bit lost. As I write this, I can't remember how it tasted. The steak was cooked just right. The Panzanella was very good. I would have liked to eat that before the steak. It deserved to be savoured separately. The grilled peaches with mascarpone and ground hazelnut were heavenly. A cash bar was a good idea. This way, people can buy rounds and lighter drinkers won’t feel there are subsidising the heavier one. The wine list wasn't long nor was it expensive.  So far so good, then why only 3 stars? This is partly because Tripadvisor only let us have one lot of scores, so it has to be an average score. The food was definitely 5 stars but not so much the \"restaurant\" itself. It is a converted warehouse. I take my hat off to them for spending time and effort doing it up, putting in the kitchen, loos, plumbing, etc, but it wasn't very comfortable. Those benches were narrow and hard. For an evening lasting from 7:30 to gone 11:00, one's posterior was getting numb. My back started to hurt half-way through the evening, too. I don't mind sharing food with strangers. But it would have worked better if the food were served on smaller dishes so that they are spread out more evenly on the long tables. More difficult was having to make small talk with the people next to me. It can work really well if you click and have lots to talk about. Otherwise it doesn’t make for a very convivial evening, particularly if you, like me, are not a heavy drinker, and had to watch the other groups getting more and more raucous and with no way of escaping. Of course, age might have something to do with it… Going as a group of 6 might be best. You then have enough mates to fall back on when conversation with the new neighbours falters. You will also be served with the right amount of food, and won't have to worry about sharing too often.  The team was very welcoming and friendly and ensured we had a good evening. What a dilemma! I love the food but found the setting uncomfortable. Would I return? I would actually, but will definitely bring a cushion and five friends, and I want to try their Wednesday pasta and sauce!", "date_of_review": "21 August 2016"}
{"review_id": 53, "restaurant_id": -3, "username": "Hutchy71", "date_of_visit": " August 2016", "rating": "5", "title": "Fantastic pasta", "comment": "Went to Forza win a couple of weeks ago after seeing it reviewed and checking out their website. It's an unusual concept in that you queue (on a weds) to pay for pasta (1 option of meat or vegetarian)and a drink for £10 and then sit at communal tables and wait for the food to arrive. Normally queuing is enough to make me go somewhere else, however I persevered on this occasion and how glad I was. The pasta is delicious. Home made pasta with a home made pesto which was the best I've eaten. We managed to bag the one side table which wasn't communal and where you could see all the goings on in the open kitchen. By the time we left the place was rammed and no end of people still queuing to get in.  If you haven't been but we're thinking about it then go. We Will definitely be going back. ", "date_of_review": "1 September 2016"}
{"review_id": 54, "restaurant_id": -3, "username": "VickyCaldow", "date_of_visit": " August 2016", "rating": "3", "title": "Good food but not value for money", "comment": "I went here with a large group of friends on a Saturday night. There are 2 communal tables and we took up most of one, so I didn't have to share plates with strangers. If you come here as a couple you will definitely have to share so be prepared to get to know the people next to you! It was incredibly hot inside, there is no air con (this is an industrial space turned into a restaurant) and the combination of a hot day and hot ovens was quite uncomfortable.  The menu was advertised as 5 courses although course 3 and 4 came at the same tie (i.e. one was essentially a side dish). The first course was fine - bread with a bean dip, roasted vegetables, almonds and olives. The dip was good although exceptionally garlicky (you could smell garlic in the corridor of the Bussey Building on the walk round to the restaurant)! The veg were delicious. Almonds far too salty.  The next course was a pasta dish, really simple and fresh although could have done with some of the salt from the almonds... Following this we had strips of steak which were cooked to perfection and melt in the mouth. This came with panzanella (course 4) which was nice and tasty new potatoes (not the flatbread that was advertised but that was fine with me). Each person only gt 2-3 very small slices of the steak which was such a shame as it was so tasty. Likewise with dessert, each person only got half a peach with mascarpone. I did enjoy the food but felt for £35 a head it was far too much. Bread, bean dip and roast veg should be no more than £5-6. A small bowl of pasta likewise. Half a peach, maybe £3.50. I could forgive this if there was more of the steak but 2 small slices just didn't suffice! I didn't leave feeling hungry my any means but just felt a bit short changed.  I also thought it was extremely unreasonable that vegetarians also paid £35. Instead of steak they were given baked aubergine, which is in no way a fair substitute in terms of price. Also to note, a couple brought their dog into the restaurant and it sat underneath the table where we were dining. I have a dog and this didn't bother me but for some people this can be quite off putting.  The place has a great vibe and it's perfect for birthdays/going with a group, I just think it is priced too high.", "date_of_review": "30 August 2016"}
{"review_id": 55, "restaurant_id": -3, "username": "ClaKaTom", "date_of_visit": " September 2016", "rating": "3", "title": "Delicious meal, but not as advertised", "comment": "Visited Forza Win on a Friday evening with a large group of friends for a birthday. Overall the experience was good. The bar had some fantastic cocktails and the ambience was great. However, the pasta course was definitely over cooked and the pudding was advertised as tiramisu (on the board hanging in the restaurant on the day of dining). This actually turned out to be half a grilled peach, definitely not a comparison to a tiramisu! The service was great however I do not think the style of serving worked. We were a large group and had to squeeze on to the benches to fit in. The part of the table I was on ended up sharing each dish between about 8, whereas further down it was shared between 4 or 5. I think the quantity of food would be ideal if shared between 4 or 6 and would have definitely been much better value for money. Would go again but perhaps in a smaller group.", "date_of_review": "3 September 2016"}
{"review_id": 56, "restaurant_id": -3, "username": "rjaidev", "date_of_visit": " October 2016", "rating": "3", "title": "Maybe not the best night", "comment": "We had the summer feast menu on 30/8/16. If you've googled Forza Win, you'll know all about the format -- it's banquet style dining, at long benches (there are 2, holding 20something each). If you're not in a big group, you'll be sharing with strangers, and if that puts you off, don't go -- it's a fairly long time (c. 3 hours) to be uncomfortable. But if you're in a big group, it'll feel like a dinner party -- except you don't have to cook or clean. (I trust that's where the \"Win\" comes from)  I was unimpressed by the food itself, unfortunately. I should caveat this by saying some people seem to love it (and my BF liked it more than I did, although with some reservations also) so (i) i might just be a cow or (ii) maybe it was an off night.  The best dish was the papardelle with scottish mushrooms. It had that incredibly satisfying slight thickness that proper home-made pasta has, and was in a really tasty mushroom sauce. The portion was small -- one heaped pasta dish between 6 people. You could tell everyone wanted a bit more, which is especially weird if the other 4 are strangers. Same goes for the whipped white-bean dip starter -- a little more would have been nice. Conversely, there was plenty of the main -- rump from Flock & Herd with sides of roasted new potatoes and panzanella. The potatoes were fine. The rump was completely cooked through -- and it wasn't just our piece, the group down the table from us had the same. I'm not even sure how you do that when the piece is that big. It was also unevenly seasoned -- some bits were totally bland and others were too salty. The whole thing made me sad. The flatbread underneath was a clever idea though, as it soaked up the steak juices. I was indifferent to it myself, but others definitely rated it.  The panzanella was uneven. It didn't feel like the bread had been properly marinated. Some pieces of the bread had (allegedly) pulled in the juices, but all of the pieces I picked hadn't, and just tasted like stale bread coated in olive oil. It was also under salted. I did not like it. When I've had nice panzanella before, it's been more juicy and therefore flavourful -- while the bread isn't meant to be falling apart, it should be moist at least. Having said that, I have since discovered another local place that sells basically the same thing, also calling it panzanella, so maybe I'm the one in the wrong. The dessert -- half a red wine poached pear in a frangelico mascarpone -- was also disappointing. The cheese was great, but the pear needed more sugar, and a little spice. Also I'm not sure half a small pear is a decent pudding size, but then I'm a glutton. I'm in two minds as to whether the whole thing is good value. I was definitely full at the end, but only because I'd filled up on the potatoes, and not on things that were really good, like the pasta and the bean dip, or the things that should have been good, like the steak. To put it another way, in terms of volume by weight alone, it's probably good value. But I didn't feel like the standard of the cooking, accounting for how each dish was apportioned, amounted to good value.  I think I will try one of the Awesome Sauce evenings (Wednesdays, no booking, £10 for pasta and a glass of wine/beer) given that I liked the pasta, and to see if it was just an off evening. ", "date_of_review": "6 October 2016"}
{"review_id": 57, "restaurant_id": -3, "username": "858charlotte", "date_of_visit": " October 2016", "rating": "2", "title": "Nah", "comment": "Bit of a case of the emperor's new clothes. It's got a very high opinion of itself but it's nowhere near as good as it thinks it is. We were really excited to try it because we'd heard great things, but the only parts we enjoyed were the venue, the lovely woodburner and the aperitif served before we ate. The food was really disappointing, ranging from mediocre to bad. I think they buy good produce but they don't know what to do with it. Also, they added a service charge to my bar bill, which annoyed me. It's a shame because the group eating thing is a really nice concept. The final nail in the coffin was googling Forza Win afterwards and finding the owner's unbearably pompous 'open letter' in response to Time Out's review. Bum-clenchingly awful.", "date_of_review": "19 November 2016"}
{"review_id": 58, "restaurant_id": -3, "username": "Cherry050", "date_of_visit": " October 2016", "rating": "1", "title": "overpriced", "comment": "Atmosphere and service was good and we had a fun evening but at £40 a head for food £25 a head for a couple of glasses of wine its extremely overpriced for what you get.", "date_of_review": "22 October 2016"}
{"review_id": 59, "restaurant_id": -3, "username": "LouiseLawson", "date_of_visit": " November 2016", "rating": "4", "title": "3rd visit - don't rest on your laurels ", "comment": "I've been here now 3 times over the past couple of years & now that it is well known it feels a bit more commercial & not as good value for money.  To start the winter menu includes an artichoke, which was tasty but hard work with little reward until you get to the middle. The secondi pasta dish was fantastic, so fresh & tasty. The meat & polenta were a bit disappointing. The wine could be better value for the location. I love this place & the concept but it needs to continually improve & be more self aware but be careful not to get arrogant. People visit for an experience & great food, keep up both.", "date_of_review": "4 December 2016"}
{"review_id": 60, "restaurant_id": -3, "username": "TheGregA", "date_of_visit": " December 2016", "rating": "4", "title": "Good food in a changing area", "comment": "Smack in the middle of the super hipster part of Peckham, this eatery's food is so good that I had to add a review.  I tried the braised fennel with cavolo nero, polenta and crispy potatoes. This is a hearty dish perfect for a winter's day and it is so good I battled to put my cutlery down. Speaking of cutlery, it is the heavy antique kind that I remember having at my gran's.  It's in an industrial building but they have a fireplace and blankets to keep you warm. Pop by if you're in the area. ", "date_of_review": "11 December 2016"}
