{"review_id": 1, "restaurant_id": -10, "username": "983rachelv", "date_of_visit": " October 2020", "rating": "5", "title": "Wow wow wow! ", "comment": "Wow wow wow! Gutted that Boris has announced lockdown, because I would literally be living at the queen of hoxton! This place is greeeeeat, food and drinks amazing and the staff are fantastic!! Thank you thank you ", "date_of_review": "31 October 2020"}
{"review_id": 2, "restaurant_id": -10, "username": "caoimhem962", "date_of_visit": " December 2020", "rating": "5", "title": "Amazing Service!", "comment": "Thank you so much to Charlie who made our first evening out post lockdown so enjoyable! She was very accommodating, brilliant service and great craic! Will 100% be back.", "date_of_review": "7 December 2020"}
{"review_id": 3, "restaurant_id": -10, "username": "Kamila6424", "date_of_visit": " December 2020", "rating": "5", "title": "Winter Wonderland", "comment": "We had a wonderful time. The Christmas decor was very cute and cosy. One of the ladies gave us all blankets which was so nice! I would say definitely wrap up warm. The food was very nice, I would recommend getting the warm spiced cocktail with rum! Staff were extremely friendly and very attentive. Massive thank you to Vincent and his colleague (lady) I'm so sorry I didn't ask for your name! But of them looked after us all night! Thank you!", "date_of_review": "7 December 2020"}
{"review_id": 4, "restaurant_id": -10, "username": "horatiol2019", "date_of_visit": " December 2020", "rating": "5", "title": "Love it, always a good night", "comment": "Love it, always a good night with great staff and drinks Good music, good vibes, would definitely be back", "date_of_review": "10 December 2020"}
{"review_id": 5, "restaurant_id": -10, "username": "elisagC9625AU", "date_of_visit": " December 2020", "rating": "5", "title": "Great night", "comment": "Having the best night, such a fun place and great staff. Would definitely recommend the cocktails, and great music!", "date_of_review": "10 December 2020"}
{"review_id": 6, "restaurant_id": -10, "username": "chloemO6068FB", "date_of_visit": " November 2020", "rating": "5", "title": "Shoutout to Malika - fantastic waitress !!", "comment": "Had a lovely evening at the Queen of Hoxton with my friend. Malika was our waitress and she was an absolute star !! Super friendly and attentive - we had such a laugh with her! We really need more waitresses and people like Malika in this world !! Thank you!", "date_of_review": "5 November 2020"}
{"review_id": 7, "restaurant_id": -10, "username": "VictoriaR35", "date_of_visit": " October 2020", "rating": "2", "title": "Service is very poor", "comment": "We visited as a group of five and booked a table on the rooftop terrace. The service was very poor, drinks took ages to arrive, many things were sold out (we were told they had run out of red wine and almost half of the cocktails on the menu) and they kept not putting our orders through so we had to keep ordering again from different people. One of the waitresses said she was working a double shift - they need extra staff swapping shifts so staff get a proper break! ", "date_of_review": "31 October 2020"}
{"review_id": 8, "restaurant_id": -10, "username": "sofunalex", "date_of_visit": " December 2020", "rating": "4", "title": "Fantastic vibe on the rooftop,", "comment": "Fantastic vibe on the rooftop, really great view of the skyline. Fantastic area, I felt like I was being treated like an A-Lister. My favourite part was at the beginning when me and my friend arrived and the lady working there said “Vincent Vincent, we’re taking them up”. We both found this amusing. And exciting! Staff were very nice. Food was a little dry and perhaps could have been better. However, the vibe made up for it. ", "date_of_review": "13 December 2020"}
{"review_id": 9, "restaurant_id": -10, "username": "Sally9851", "date_of_visit": " December 2020", "rating": "5", "title": "Mila", "comment": "Great experience here for after work drinks. Service from Mila was exceptional, friendly, professional and helpful! Looking forward to coming back!", "date_of_review": "15 December 2020"}
{"review_id": 10, "restaurant_id": -10, "username": "STRGHN", "date_of_visit": " December 2020", "rating": "3", "title": "Dogs Dinner", "comment": "We visited here on Saturday night. The atmosphere was really good, great music and reasonably priced drinks for London. But the food... we booked ahead and we were required to put a deposit down for a burger as a substantial meal. When we were there they mixed up our orders and we were served one of their 'Christmas Platters' (see picture below). The food was cold and looked like something you would get from Iceland. I know this place isn't known for its food but what we got was pretty poor...", "date_of_review": "14 December 2020"}
{"review_id": 11, "restaurant_id": -10, "username": "T8434ZEdannyp", "date_of_visit": " October 2020", "rating": "5", "title": "Them team made us feel very welcome. Toya and Gabi reaccommodated us inside to give the best night ever!! And the food was amaz", "comment": "Them team made us feel very welcome. Toya and Gabi reaccommodated us inside to give the best night ever!! And the food was amazing. All round 10 out of 10 service", "date_of_review": "31 October 2020"}
{"review_id": 12, "restaurant_id": -10, "username": "_cpollard1", "date_of_visit": " September 2020", "rating": "1", "title": "Cancellation", "comment": "After having our booking cancelled because there was no space after they had already taken a £40 deposit from us, they said they had refunded our deposit. I waited a week and had not received the refund, I contacted them and they said they had not sent it but will send it now and I would receive it by the 28th September (our booking got cancelled on September the 11th). I have still not received our refund 3 weeks after our booking was cancelled and after another email asking where I refund is I have not had a reply. Taking a £10 deposit per person before they even know if their is availability is ridiculous. I am appalled with this service and will not be booking again.", "date_of_review": "30 September 2020"}
{"review_id": 13, "restaurant_id": -10, "username": "Juliette L", "date_of_visit": " September 2020", "rating": "5", "title": "TOP VIBES", "comment": "Vibey and not full of itself - a good night out for real Londoners to appreciate.  Slightly concerned some customers were clicking at and being rude to the staff - perhaps they hadn't been to Q of H before but this is a cultural institution and I didn't like seeing the staff patronised like that.  Always a top team, great energy and brilliant security & management.  Fun and safe.", "date_of_review": "6 October 2020"}
{"review_id": 14, "restaurant_id": -10, "username": "emmaspillane", "date_of_visit": " October 2020", "rating": "5", "title": "Leaving do", "comment": "This place is amazing really good night had by all my friends highly recommended the host on the door is amazing very friendly door men and very helpful staff", "date_of_review": "16 October 2020"}
{"review_id": 15, "restaurant_id": -10, "username": "Frankmagill", "date_of_visit": " September 2020", "rating": "5", "title": "Amazing place in London!", "comment": "Recently visited with some friends ! Such a fun atmosphere on the roof Terrace and such lovely attentive staff! We had the best time even with the new restrictions in place the cocktails were amazing !!", "date_of_review": "3 October 2020"}
{"review_id": 16, "restaurant_id": -10, "username": "F4312LGandrear", "date_of_visit": " October 2020", "rating": "5", "title": "Ms", "comment": "Had such a good girls night on Friday. It’s was very pleasant experience from the star to finish. Firstly I would to thank the stuff there for making our night very enjoyable. Personally just wanna say a big thank you to Ali on the door on arrival you made us feel so welcome and safe at this terrible time. Love his Personality all us girls wanted to take him home. 10/10 across the board. See you guys.", "date_of_review": "17 October 2020"}
{"review_id": 17, "restaurant_id": -10, "username": "laurensB3301UJ", "date_of_visit": " October 2020", "rating": "5", "title": "Amazing service", "comment": "Despite corona restrictions, the service was amazing! Emily was lovely and I’ll definitely be back! ❤️", "date_of_review": "23 October 2020"}
{"review_id": 18, "restaurant_id": -10, "username": "Mai5itos", "date_of_visit": " October 2020", "rating": "1", "title": "I won't come back, we booked", "comment": "I won't come back, we booked a table that turned out to be an \"stairs edge\". We have a word with the staff to see if we could move into one of the three empty tables they had in the middle of the room and, apparently, we couldn't. (Well, at this point I really thought they were taking the piss, more than anything because they could seat people around the staircase, same as they did with us). At the end, when we decided to leave, was when one waitress went really rude at us for no reason. Please don't go, it's no worth the while.", "date_of_review": "24 October 2020"}
{"review_id": 19, "restaurant_id": -10, "username": "paulsD8819DX", "date_of_visit": " October 2020", "rating": "5", "title": "Amazing brunch! Made even", "comment": "Amazing brunch! Made even more incredible by the awesome and beautiful phoebe who was awesome!! She is amazing, attentive, and awesome! As someone that works in hospitality, I would Hire her in an instant. ", "date_of_review": "31 October 2020"}
{"review_id": 20, "restaurant_id": -10, "username": "local2nowhere", "date_of_visit": " October 2020", "rating": "4", "title": "Drinks", "comment": "it was a really beautiful venue! we were on the rooftop, and really amazing staff (thank you Emily)!", "date_of_review": "23 October 2020"}
{"review_id": 21, "restaurant_id": -10, "username": "bethg7", "date_of_visit": " March 2020", "rating": "1", "title": "Never been before.. wouldn't return!!!", "comment": "First time coming here, would never return.  Last night me and about 15 others queued to get in to this venue. Me and 3 others were stuck in the queue after the rest were allowed in and the bouncers were insisting on checking everyones ID'S , even people within our party which were 35+.  One of our group has a visual impairment and only has one eye which you can clearly see when in front of him. Because of a medical condition this has had an impact on his brain function and he sometimes has a delayed response when asked a question or involved in social interraction.  When our friend mentioned was next to be checked, the doorman got in our friends face and with an aggressive tone pertruded to shout 'who are you with', my friend couldn't anwser right there on the spot due to his condtion to which he politely asked the doorman to repeat his question and the response he got was even more aggressive and pushed himself further in to my friends face. My friend pointed to the 10+ people that were just let in, in front and us 3 behind and said i am with these guys. The doorman then said you aren't coming in your too drunk and told him to move aside. My other friend asked if she could go inside and let the others know they need to come out as we arent staying there, she was allowed to go in and the rest of the party had already paid entry and were queing for drinks.  The doorman followed her whilst leaving 2 other security there to ensure our friend didnt get in. Meanwhile the staff were prepared to let the rest of our group through who WERE visibly drunk but not our friend who wasnt drunk although they seemed to have made the most ridiculous assumption he was. The rude doorman came back and then asked what our problem was and I'm not afraid to say i lost it.  They were prepared to let us girls go in and the rest of the party but not our friend who had an visable impairment. So because our friend didn't anwser in a split second due to a condtion he was then discriminatrd against which is absolutley disgusting. I was told to 'F*@k off' by the bouncer as he was agressively shouting abuse to us all because we stuck up for our friend. He also used expletives and foul language in an aggressive way to the rest of the party. Luckily all of the rest of the party were able to get refunds from the entrance desk which meant the company had to refund 10+ entry fees all because of their awlful doormen. I Never even got in the venue but i would never even return. Disgusting indiviudals. Looking at the reviews all seems to be negatively based around your discriminating doormen, Maybe you should consider reviewing who you employ as its not a good reflection on your brand. Not Happy!!! Ruined our night and its even sadder to whitness this type of discrimination first hand, its the sort of thing you hear sbout but dont necessarily witness and tonight i am absolutely saddened and disgusted my friend was made to feel outted and singled out by your vile doormen!!! I wish i had the individuals name!!!", "date_of_review": "15 March 2020"}
{"review_id": 22, "restaurant_id": -10, "username": "stevebintley", "date_of_visit": " June 2019", "rating": "4", "title": "Great crowd and atmosphere", "comment": "Brilliant night out! Admittedly it was a Sunday night and wasn’t overly busy but the atmosphere was still superb, the staff decent and overall a great fun night out.The different floors and roof terrace enable different vibes thorough the evening but wherever you are it’s a sociable crowd and you feel welcome. Drink prices are reasonable given the venue and location and the facilities are clean. I can’t wait to return!", "date_of_review": "15 March 2020"}
{"review_id": 23, "restaurant_id": -10, "username": "Charlie1234567897878", "date_of_visit": " July 2020", "rating": "5", "title": "We love Sydney", "comment": "I am pretty fussy with service but Sydney was so attentive and amazing. The weather almost made us leave but she relocated us, gave us great cocktails and service! Come here. Just for her!", "date_of_review": "25 July 2020"}
{"review_id": 24, "restaurant_id": -10, "username": "999darcyh", "date_of_visit": " August 2020", "rating": "5", "title": "SYDNEY IS AMAZING", "comment": "Sydney was so fun and so lovely amazing service, quick and made us feel comfortable and looked after! Us! Amazing !!", "date_of_review": "1 August 2020"}
{"review_id": 25, "restaurant_id": -10, "username": "L3565ZAhannahh", "date_of_visit": " August 2020", "rating": "5", "title": "Perfect way to start my day!", "comment": "Perfect way to start my day! Had a boozy early afternoon on the roof terrace with some pals, Sydney was such a babe and made us crack a smile every time she popped over to our table, that girl deserves a raise", "date_of_review": "2 August 2020"}
{"review_id": 26, "restaurant_id": -10, "username": "leedenny", "date_of_visit": " August 2020", "rating": "5", "title": "Very welcoming and brilliant service", "comment": "The staff went out of their way to cater for our access and dietary requirements and created an incredible atmosphere even with the strictest of social distancing measures! Thank you all we will be back soon", "date_of_review": "22 August 2020"}
{"review_id": 27, "restaurant_id": -10, "username": "chloemY7045KS", "date_of_visit": " August 2020", "rating": "5", "title": "Amazing place", "comment": "Could not of asked for a better night. Everything was amazing! Staff were great, super friendly and attentive. Would go again", "date_of_review": "22 August 2020"}
{"review_id": 28, "restaurant_id": -10, "username": "marionmW6507TN", "date_of_visit": " July 2020", "rating": "1", "title": "Very disappointing ", "comment": "I booked to go to QOH in July 2020, where I had to pay a £40 deposit to secure my space (very fair given current restrictions). However, I was promised if the weather didn’t permit we would be given the money back. After attending and only spending 20, the bar staff assured me if I emailed their management I’d be sully reimbursed as promised due to the bad weather and inability to spend the money. I have emailed multiple times, messaged on twitter and Instagram but no response. Very disappointing service! ", "date_of_review": "20 August 2020"}
{"review_id": 29, "restaurant_id": -10, "username": "nathilism", "date_of_visit": " August 2020", "rating": "2", "title": "Not accessible unless you look 'disabled enough'.", "comment": "This visit was in the summer of 2018 but I didn't have the confidence to report back then. I realised I needed to not just for myself but for the sake of others. I will be filing a formal complaint. Came here to work for a private company which uses the venue. I asked where the lift was to get to the roof. A member of the bar staff looked me up and down and asked \"are you disabled? I can't just give access to anyone...\" Embarrassed, I said \"oh okay...\" and headed towards the stairwell. What an ignorant response! There are an endless number of conditions a person could have affecting stamina and mobility which aren't obvious at a glance and no one should have to answer such a personal question to a stranger. A highly invalidating experience to put someone through. It's a pretty venue but I can't support them if they can't train their staff on basic disability etiquette.", "date_of_review": "18 August 2020"}
{"review_id": 30, "restaurant_id": -10, "username": "ellenah2020", "date_of_visit": " August 2020", "rating": "5", "title": "ABBIE IS THE BEST", "comment": "Honestly the best! Such a lovely place for indoor and outdoor drinks & food. Abbie was our waitress and she was so helpful and funny, literally love this girl! Would definitely come back! And Abbie made the experience better, definitely recommend.", "date_of_review": "29 August 2020"}
{"review_id": 31, "restaurant_id": -10, "username": "Echologist", "date_of_visit": " July 2019", "rating": "3", "title": "Crowded rooftop", "comment": "The Menu on the Website says Vegan Platters. Upstairs you can buy Tacos and Mexican Food - but it was not clear how to order. Was a very busy night!", "date_of_review": "23 July 2019"}
{"review_id": 32, "restaurant_id": -10, "username": "Freestandard", "date_of_visit": " March 2020", "rating": "1", "title": "Awful experience", "comment": "Up in London for my girlfriend's birthday, following a couple of drinks at bounce we headed to queen of Hoxton to see the night off around 2000 this Saturday gone. There was no queue to get in and about 12 of our group got in and paid before being alerted to the fact that our last member, who only has one eye, was turned away by the bouncers for being too drunk. He wasn't too drunk and has had trouble like this before because of the way he looks, despite being a well spoken, well dressed and decent man never causing any trouble whatsoever. Unbelievable, we all got refunds for the entry fee of £8.00 and I asked the bouncer after why he didn't let our mate in. He just responded saying he asked him to wait, that he never said he couldn't come in. So they lied to us after as well. Nightmare experience when all we wanted was to celebrate with a few drinks.", "date_of_review": "15 March 2020"}
{"review_id": 33, "restaurant_id": -10, "username": "dkyei", "date_of_visit": " September 2019", "rating": "5", "title": "Booking for my 25th Birthday Party! - Room 2", "comment": "I celebrated my 25th birthday at the Queen of Hoxton, 2 weeks ago and it was amazing!  I was dealing with Meghan in terms of the booking and organisation, and she was excellent. Her communication was great, and she ensured I had everything I needed down to requesting extra chairs, and even a cake and table cloth for my cake. She spoke with the venue so I could attend earlier to set up and decorate also. She would respond to my emails in a timely manner, and was happy to speak to me over the phone also.  The staff and security at the venue were so great - I can't remember everyone's names, but I do remember Miguel. He initially showed me and my husband around before we booked, and he was so lovely - he was polite, so friendly, and we felt like we had known him for ages! He made sure that things ran smoothly on the door when there was a slight hiccup with the guest list.  The security guards in the afternoon watched my car for me when I first parked up to off load items, so I wouldn't get a ticket.  I am so hot on excellent customer services, and the staff at Queen of Hoxton exceeded my expectations in every way, especially because I am such a perfectionist. I would definitely recommend you guys!  The bar staff at my party were so kind - they were not rude and they did not have attitude. They were a friendly and welcoming bunch! Thank you Queen of Hoxton so much for making me feel valued, and for catering to my every need - God bless!", "date_of_review": "20 September 2019"}
{"review_id": 34, "restaurant_id": -10, "username": "kjunkap", "date_of_visit": " June 2019", "rating": "5", "title": "Amazing fresh food", "comment": "Healthy, fresh food, cool atmosphere, very helpful staff, will be back :) my favourite place for food in the area", "date_of_review": "7 August 2019"}
{"review_id": 35, "restaurant_id": -10, "username": "amyrM1640ZK", "date_of_visit": " December 2019", "rating": "1", "title": "Rude and aggressive bouncers", "comment": "The bouncers referred to a drunk girl in front of me in the queue as a ‘slag’ and other words that I’d rather not repeat, and got aggressive when called out on it. Other door staff were pretty apathetic towards the bouncers language....definitely won’t be returning here anytime soon.", "date_of_review": "7 December 2019"}
{"review_id": 36, "restaurant_id": -10, "username": "tanewman", "date_of_visit": " December 2019", "rating": "3", "title": "Queues", "comment": "Loved this bar - the look, feel, vibe - the Emerald City area is fab. BUT it took so long to get served. Unreasonably long. We ended up just staying for 1 drink and going - which was a shame ", "date_of_review": "10 December 2019"}
{"review_id": 37, "restaurant_id": -10, "username": "hotfuss73", "date_of_visit": " December 2019", "rating": "1", "title": "We just visited 5 minutes", "comment": "We just visited 5 minutes ago for a drink for a friends birthday. The doorman asked our first friend for photo id. When my friend said he didn’t have any (he’s 41) the doorman got very rude and told us all to leave. He closed the door on my friend and told me (a female) to shush b*tch. Been there before and had a lovely time but never again. Disgusting behaviour. We are now over the road having a nice time without idiot doormen. Shame.", "date_of_review": "14 December 2019"}
{"review_id": 38, "restaurant_id": -10, "username": "charlief430", "date_of_visit": " December 2019", "rating": "1", "title": "Awful", "comment": "Like many of the complaints here we had a run in with the terrible terrible door staff. We reserved a space on the ground floor to the tune of £600. The space was reserved 9pm to close. We turned up at 9pm and they wanted to charge us £5 pp for entry!! There were 13 of us. The door team wouldn’t listen to logic, were incredibly aggressive, threatening none entry in response to fair complaint. They kept us waiting in the lashing rain for 15 mins whilst finding a manager who would listen to our legitimate refusal to pay more for entry. Then they insisted on ID’ing everyone even our bosses who are 40+. It took the edge off the night and when we had paid a lot for it. It’s clear this is owned by people who operate the club at arms length. Overall the entire experience lacked ‘hospitality’ just a joint packed to the rafters to the point of discomfort, playing average music and rinsing every penny from their customers. We left a few hours later with the prepaid drinks tab still in credit - it was that bad. Soooo many better places in Hoxton, avoid at all costs.", "date_of_review": "16 December 2019"}
{"review_id": 39, "restaurant_id": -10, "username": "HippyinPinstripes", "date_of_visit": " November 2019", "rating": "4", "title": "Great music And Vibe", "comment": "We were here on a Saturday for a friend's birthday. The bouncers in the queue outside are needlessly aggressive and rude, as others have commented tio. But I would suggest just ignore them as best you can and get inside. The music is great and the crowd is diverse and quirky. We were in the basement rooms for most the time and the crowd was great. No sleezy behaviour and just there for the music :)", "date_of_review": "25 January 2020"}
{"review_id": 40, "restaurant_id": -10, "username": "L_Hazell", "date_of_visit": " December 2019", "rating": "3", "title": "Ok venue but harassing film crew spoil it", "comment": "I like this bar and even in winter it's a great outdoor space to sit by the fire and enjoy the views of London.  But on our last visit they'd rented out the rooftop to an online film crew without telling any of the customers. The crew then harassed the customers over and over again to appear on the programme. We declined multiple times and even moved when they started filming where we were sitting. We were then trapped in a corner away from the fire pits because the film crew blocked off any escape by doing an interview right in front of us. They even had the audacity to tell us to be quiet when we were talking.  We left because of this and I'd be reluctant to return. We should have a right to decide if we're going to feature on a trashy online show and the bar staff did nothing to address the way the film crew were behaving. Several other people complained and the staff just shrugged, even when the main woman in the film crew was harassing customers right in front of them.", "date_of_review": "20 December 2019"}
{"review_id": 41, "restaurant_id": -10, "username": "Tommy2736", "date_of_visit": " June 2019", "rating": "4", "title": "Nice nice nice", "comment": "Been there few days ago  Nice food but the service a bit slow Apart of this all was great I will be there soon again", "date_of_review": "8 June 2019"}
{"review_id": 42, "restaurant_id": -10, "username": "Kate O", "date_of_visit": " May 2019", "rating": "1", "title": "Awful ", "comment": "A large group of us came to celebrate a recent engagement. On a sunny afternoon, bank holiday weekend, five bar staff were om for the whole place. This led to huge queues, for over priced drinks. Poor planning and management have let this place down as otherwise, this would be a great bar ", "date_of_review": "25 May 2019"}
{"review_id": 43, "restaurant_id": -10, "username": "Kingpaul100", "date_of_visit": " June 2019", "rating": "2", "title": " Not queen status ! - Out my depth ?? ", "comment": "Decided to visit as heard it is very modern and different and lively and the place to be- think maybe I am too old ? Inside area was like youth club to me !! Lol. Outside area disappointing. Poor quality cocktails- many ' blue peter' style- here is something we made earlier ! Poor quality / high prices. Roof tops of Liverpool street and hoxton not really the best of views. ", "date_of_review": "23 June 2019"}
{"review_id": 44, "restaurant_id": -10, "username": "Ella R", "date_of_visit": " June 2019", "rating": "2", "title": "Basic, messy, rude staff", "comment": "I came here for a little boogie with my friend, security let us cut the queue (cos we're females haha) and it was super super busy, 10.30pm on friday night! Drinks spilled all over the floor, quite smelly and hot, and everyone's super wasted. The drinks were usual London price, nice bar staff too. Downstairs was awful poppy techno, very very odd vibe. Upstairs was even worse, DJ playing \"Uptown Funk\" type music, just very basic chart music which if you like that it's fab. Everyone else was dancing and living their best life, but for us personally we like R&B, and then the DJ mixed a Backstreet Boys song with Tupac lyrics....so awkward. Anyways the venue is gorgeous apart from the smell, rooftop was completely cornered off apart form a tiny spot where the rude security who shouted and told us to \"f*cking move down for f*cks sake\" and when we replied asking why he was so rude he said he didn't \"f*cking care\" so....not the best experience here. However if you're a mixed group looking for some basic tunes to dance to and get wasted, come here, good place for a dance I guess, just not my cuppa tea", "date_of_review": "29 June 2019"}
{"review_id": 45, "restaurant_id": -10, "username": "LawrenceW620", "date_of_visit": " July 2019", "rating": "1", "title": "They lie on their website and on the phone ", "comment": "Third time tonight came here, looked at the website and phoned in advance to check if the rooftop is opened and they said yes, arrived to find its shut for a private event. They lie just to get you to go there. Don’t bother. Rooftop is overrated. ", "date_of_review": "4 July 2019"}
{"review_id": 46, "restaurant_id": -10, "username": "PetaP685", "date_of_visit": " July 2019", "rating": "4", "title": "Nice place but rude barman", "comment": "Came here on a Saturday afternoon and got seated straight away at the rooftop. Mexican wrestling themed which was fun and great drinks. Just found one of the bar men very rude. Had a mix up with a drink and he basically blamed me rather than admit that he misheard me and then whilst I was patiently waiting at the bar a man came from nowhere and pushed in front of me and nothing was said to him. Just would have appreciated the bar man to say sorry mate that lady has been waiting in a queue. But nothing. Anyway would come back here as we had such a lovely afternoon. Can’t wait to see what the next theme is.", "date_of_review": "7 July 2019"}
{"review_id": 47, "restaurant_id": -10, "username": "Ryan5483", "date_of_visit": " July 2019", "rating": "2", "title": "Eh ", "comment": "The staff was unfriendly, the music was way too loud, it was so packed you could barely walk through. We went specifically for the slushies that they advertise but they were “too watery” when we got there at 6 pm. If you’re already drunk and want to wait thirty minutes for the one choice of beer they have, after walking up five flights of stairs, then come here. ", "date_of_review": "9 July 2019"}
{"review_id": 48, "restaurant_id": -10, "username": "eatallthefoodman", "date_of_visit": " July 2019", "rating": "4", "title": "Rooftop bar is a gem", "comment": "Rooftop bar is just awesome. Great array of seating. Awesome decor. Beer and drink choice although to an extent limited, are chosen well. Worth a visit in the sun.  Lost a point for the food. It was very meh. But can soak up the beer. ", "date_of_review": "7 July 2019"}
{"review_id": 49, "restaurant_id": -10, "username": "hannaholb", "date_of_visit": " July 2019", "rating": "1", "title": "Slow bar staff, too expensive, no happy hour", "comment": "Bar staff were painfully slow even when quiet, took half an hour to order a pint. Too expensive and not very competitive when lots of better bars with better staff and better atmosphere have happy hours and drinks deals. Very disappointed ", "date_of_review": "12 July 2019"}
{"review_id": 50, "restaurant_id": -10, "username": "Amy J", "date_of_visit": " July 2019", "rating": "5", "title": "Fun times but no nakedness", "comment": "Fun Monday. Too late for neon naked life drawing but awesome to listen to Ukulele playing and chatting to the fun bar staff. Definitely recommend.", "date_of_review": "15 July 2019"}
{"review_id": 51, "restaurant_id": -10, "username": "mongreladam", "date_of_visit": " May 2019", "rating": "5", "title": "Rooftop brilliance ", "comment": "Celebrating Cinco de Mayo with tequila, Mexican singing and a trump piñata was a great Sunday afternoon with mates  As a ticketed event it meant that it didn’t get out of control, the bar staff were friendly and quick to serve and it was a great atmosphere  Plenty of room on the roof to enjoy the atmosphere and sunshine I would recommend any event like this to anyone - for £4 a pop too you can’t complain for a London bank holiday weekend  Top marks!", "date_of_review": "6 May 2019"}
{"review_id": 52, "restaurant_id": -10, "username": "HanBenLou", "date_of_visit": " March 2019", "rating": "4", "title": "Fun Friday Night", "comment": "The Queen of Hoxton is well located near Liverpool st and guaranteed to be buzzing on a Friday. The mix of music across the different floors is great to mix up the night and pleases groups of friends with different music tastes. A guy working at the cloakroom I think his name was Ali at the cloakroom was also really helpful! Nice staff members is always a bonus.  Drinks are quite expensive which is why I've only given this a 4, but will probably be back soon.", "date_of_review": "2 March 2019"}
{"review_id": 53, "restaurant_id": -10, "username": "hayley c", "date_of_visit": " February 2019", "rating": "4", "title": "Vibes", "comment": "Aw I had such a good time st the Queen of Hoxton. The music on the ground floor was amazing I loved it such a vibe. I tried to put my coat into the cloak room and I didn’t have change there was a really lovely guy there called Ali who payed for my jacket I must say I was surprised. He was so welcoming and funny he made my night. The drinks were good would defo come here again thank you.", "date_of_review": "6 March 2019"}
{"review_id": 54, "restaurant_id": -10, "username": "NeetsB74", "date_of_visit": " March 2019", "rating": "5", "title": "Hip hop karaoke", "comment": "Great venue , Lina atvthe cloakroom was a babe let me put my coat in for free x Music great, great vibe", "date_of_review": "7 March 2019"}
{"review_id": 55, "restaurant_id": -10, "username": "TheGame G", "date_of_visit": " March 2019", "rating": "5", "title": "Hip hop kareoke", "comment": "Lina smashed it She works in the cloakroom... Checked our stuff in for free! Go see her... Everyday if you can ... Won't probably be free everyday... She does thou Very helpful Knows that cloakroom... Kills it I think my stuff will come out pressed and looking sharp!", "date_of_review": "7 March 2019"}
{"review_id": 56, "restaurant_id": -10, "username": "Roving669149", "date_of_visit": " April 2019", "rating": "1", "title": "Very unfriendly staff members", "comment": "Great set up if it wasn’t for the extremely rude staff. Came on a visit with colleagues and the service was awful, the staff were very very rude.", "date_of_review": "5 April 2019"}
{"review_id": 57, "restaurant_id": -10, "username": "Chloefern8", "date_of_visit": " March 2019", "rating": "5", "title": "Queen of Hoxton", "comment": "Lina is an amazing girl ! Very friendly  She treated me and my friends with such  Kindness! Rare to see this treatment  Give her a PAY RISE! Will definitely come back again as I had a great time", "date_of_review": "7 March 2019"}
{"review_id": 58, "restaurant_id": -10, "username": "joe k", "date_of_visit": " May 2019", "rating": "1", "title": "Wouldn’t return due to one bouncer.", "comment": "One bouncer was extremely aggressive in the basement and needs firing, not someone you want interacting with your customers. we entered the venue in a equal mixed group, we were confronted by the stage and it was a case of mistaken identity, two bouncers apologised one told us all to leave whilst being very hands on with the women. Happy to indentify the members of staff.", "date_of_review": "5 May 2019"}
{"review_id": 59, "restaurant_id": -10, "username": "bjwfilm", "date_of_visit": " April 2019", "rating": "5", "title": "amazing bartenders", "comment": "Josh, Chloe, Cristina and Rodrigo were amazing bartenders. Great service and so lovely on the rooftop. Had a great time!", "date_of_review": "13 April 2019"}
{"review_id": 60, "restaurant_id": -10, "username": "cfern1", "date_of_visit": " June 2018", "rating": "1", "title": "Awful", "comment": "Went for drinks with friends, didn’t like it at all. Seems grimy and the worst rooftop bar I’ve ever been to, waiting around to try and get drink and pushing past people. Would NEVER go back. ", "date_of_review": "21 August 2018"}
{"review_id": 61, "restaurant_id": -10, "username": "bbl1995", "date_of_visit": " August 2018", "rating": "3", "title": "Birthday outing ", "comment": "I chose Queen of Hoxton as my birthday drinks location purely for the rooftop and cocktails. The bar had a good atmosphere and even though the views on the rooftop are not famous landmarks, they are still scenic. The cocktails on the rooftop are not great, as many other reviews also mention, they are mostly pre mixed. There were two slushy machines in cocktails which could be a nicer option, unfortunately one of these had finished and the other was a tequila based drink, so not something I'd like for myself.  The price for the premixed cocktails does seem steep. There are more options for different cocktails and beers on different floors, however moving between floors is not ideal, not just due to effort but the bar is busy, so moving around is not ideal.  The bar is understandably busy, and going on a Friday night it was hard to find a good location to stand, and seating is limited. Decorations of the bar are cool, the toilets were all very interesting especially.  It's worth noting the flooring is wooden panels/decking. It's not the most high heel friendly- although even after a few drinks despite my heel falling through a few times no accidents happened!  The lower rating is purely due to the drink quality and pricing. The bar is worth a visit but maybe not for the whole night. Thankfully it's in a great location so can be a good stop on way.", "date_of_review": "19 August 2018"}
{"review_id": 62, "restaurant_id": -10, "username": "laaboria", "date_of_visit": " August 2018", "rating": "1", "title": "Rude aggressive door security", "comment": "Never in my life have I been questioned why I’m leaving a venue . The security guard didn’t like my response and decided it would be a good idea to follow me out and start a argument with a woman. I will never come back. Don’t waste your time .", "date_of_review": "24 August 2018"}
{"review_id": 63, "restaurant_id": -10, "username": "Michelle B", "date_of_visit": " August 2018", "rating": "2", "title": "Not Great", "comment": "Staff were not overly pleasant, the bar downstairs was empty and looked like a youth club, there were about 8 flights of stairs to the rooftop, when we finally got served at the bar I was served my drink in a plastic cup so it felt like I was at a children’s party.  The place looked like a child’s play area, with the white chapel being a kids Wendy house, the three toilets were portaloos and weren’t enough for the amount of people that were there.  The pictures on the website are very misleading, don’t be fooled! ", "date_of_review": "3 September 2018"}
{"review_id": 64, "restaurant_id": -10, "username": "xxshayxx", "date_of_visit": " October 2018", "rating": "2", "title": "50/50", "comment": "Great venue, enjoyed the music upstairs had a table booked down stairs and when we requested the music to be changed downstairs we were told to f**k off...not impressed and decided to leave the reservation downstairs and continue the night upstairs.", "date_of_review": "6 October 2018"}
{"review_id": 65, "restaurant_id": -10, "username": "markydon89", "date_of_visit": " August 2018", "rating": "2", "title": "Nicer bars nearby", "comment": "Venue is nice and they were playing drag bingo which was good fun however the bar staff have appalling attitudes. Thought I may have just got a barmaid in a bad mood however we had drinks on the rooftop and on ground.  For your bar staff alone, I wouldn’t go back", "date_of_review": "30 August 2018"}
{"review_id": 66, "restaurant_id": -10, "username": "andytp2018", "date_of_visit": " November 2018", "rating": "1", "title": "Don’t bother ", "comment": "I thought the rooftop bar was okay until the night was ruined by the rude bar staff and bouncer. This will be my first and last visit here. I’ve been going to Shoreditch quite frequently and was shocked to experience such (non existent) service. Not even worth the effort considering there are many other bars in Shoreditch (and London in general), which provide better service and drinks. ", "date_of_review": "10 November 2018"}
{"review_id": 67, "restaurant_id": -10, "username": "Maria A", "date_of_visit": " December 2018", "rating": "3", "title": "Disappointing NYE 'party'", "comment": "I was excited to go but, having paid £25 just for entry, I found the music and decoration very pour. Not great tunes, and a disappointing atmosphere. I liked the light dance floor area, but expected the outdoors area to be much bigger. It looked nothing like the picture above. The staff were nice.", "date_of_review": "2 January 2019"}
{"review_id": 68, "restaurant_id": -10, "username": "RuthD7177", "date_of_visit": " January 2019", "rating": "1", "title": "No Interest in Customer Satisfaction", "comment": "Came here to visit the roof terrace. Really pretty. Ordered \"A La Mode\" cocktail (pre made and served by ladle from soup urn). Took a sip and struggled not to spit it out. Disgusting. Went straight back to bar and explained I wasn't happy with my drink and could I please swap it. Plus it was advertised as with cream (there was none). And it said it came with bourbon (actually is blended whisky). No. Not an option. Bar tender went back to reading his book. First restaurant I've ever been to in my life where they don't change your food / drink if you don't like it. Very poor / negligible customer service.", "date_of_review": "19 January 2019"}
{"review_id": 69, "restaurant_id": -10, "username": "Bellebellebelle", "date_of_visit": " February 2019", "rating": "1", "title": "Not so Queen of Hoxton", "comment": "Myself and a friend went to the valentines event. Unfortunately, it was awful. The bar staff were nice but the drinks were poor, they were filled with ridiculous amounts of ice, the price would be good if the drinks were better. A lot of people were unsure what was happening, there was no communication what was happening when and everybody was asking one another. Eventually, the tarot card reader began, it was not announced where she was, who she was or how we could pay, once again everyone was asking if you pay at the table or beforehand. There was a long queue for the tarot reader, a reading being 10 minutes long which is a good amount of time but the queue was long and blocking the doors. We noticed a member of staff organising for other guests who had not waited in the queue to see the tarot reader next and offering the people who witnessed this a drink as compensation. When she told us, she said it was because the tarot reader was taking so long, And our reading would be shorted to shorten the queue (price remaining the same), which made no sense as to why she brought the guests who did not queue in front of everybody else- who had waited over an hour already. However, when we received the drinks she offered as compensation, they were not what we ordered, when I say this, we couldn’t even recognise the taste- it was heavily watered down and god knows what was in it- this put me off as I suffer from allergies and have to be strict on what I drink- from a bar this is extremely poor. It was a shame it ended so badly as the beginning of our night was good.", "date_of_review": "14 February 2019"}
{"review_id": 70, "restaurant_id": -10, "username": "chauraepoon", "date_of_visit": " August 2018", "rating": "1", "title": "Disappointing ", "comment": "It’s not worth the climb. After all the struggle to climb up the stairs, they don’t even serve a proper cocktails. All the cocktails are Pre-made & costs £8. Whole place needs to be repainted or maybe needs new theme. Very dissatisfied ", "date_of_review": "18 August 2018"}
{"review_id": 71, "restaurant_id": -10, "username": "LanaZ87", "date_of_visit": " May 2018", "rating": "1", "title": "Bouncer was rude!", "comment": "Went out on a Friday night and checked the times for opening hours. Got in an hour before closing time and bouncer said it was closed when clearly the club was open and people were still going in out. Management should speak to the bouncers and make sure they are respectful and curteous to customers.", "date_of_review": "5 May 2018"}
{"review_id": 72, "restaurant_id": -10, "username": "Giselle1960", "date_of_visit": " April 2018", "rating": "4", "title": "Wow!", "comment": "Had to queue to get in and then there was security! Disappointed they didn't frisk me! LOL! Once in it is the hive of hip and fun. Downstairs Bar is for dancing and drinking and chilling! But make your way to the rooftop - it is worth all the stairs - There you can drink and dance (with headphones) in the sunlight or moonlit sky and when you are hungry there are freshly fried chips for your comfort! Smothered in Tomato sauce and Mustard sauce - a fabulous tummy filler Other great things on the menu too but the fries won my heart The door staff are lovely and very keen to make sure you are going to get home safely", "date_of_review": "29 April 2018"}
{"review_id": 73, "restaurant_id": -10, "username": "Biañca L", "date_of_visit": " May 2018", "rating": "1", "title": "Awful", "comment": "We booked a table for my cousins hen do and when arrived we were told we couldn’t enter with our sash’s and that our table was double booked. Instead of offering us another table or fast track to the roof top bar, we were told there was nothing they could do they were ‘busy’. I would have expected better and at least an apology instead we were told to get to the back of the queue. Never again will I entertain at the Queen of Hoxton!", "date_of_review": "5 May 2018"}
{"review_id": 74, "restaurant_id": -10, "username": "885calums", "date_of_visit": " July 2018", "rating": "2", "title": "Not a good experience", "comment": "Extremely busy bar on on a Saturday afternoon, filled with hen parties. The music in the main bar during the day is at nightclub levels, so everyone is shouting at the top of their voices to be heard, making it a very inhospitable environment. Drinks range from average for central London to expensive for central London.  I wouldn't recommend visiting this place unless you like not being able to hear your friends and having drinks spilled on you in the middle of the day.", "date_of_review": "14 July 2018"}
{"review_id": 75, "restaurant_id": -10, "username": "F4960OGchristinel", "date_of_visit": " May 2018", "rating": "1", "title": "So bad !!!!!!!!!!", "comment": "For £7 ENTRY FEE these wronguns will take your money and cram you into a horrible horrible bar where you barely have space to move.  Bear in mind, they advertise a rooftop bar but when you walk up the ridiculous amount of stairs you will find it shut. And then, when you eventually make it back downstairs, they will still have the gall to charge you £10+ for a drink whilst you listen to their average-at-best DJ. AVOID.  I would love to know what the local council think about their fire safety protocol, as a tipsy layman I can tell it was at least sub par. So, if you want to pay over a fiver to go to an awful place in Shoreditch with a questionable evacuation policy and yucky drinks - deffo go here.", "date_of_review": "11 May 2018"}
{"review_id": 76, "restaurant_id": -10, "username": "Gary S", "date_of_visit": " June 2018", "rating": "1", "title": "Booking, What booking!!", "comment": "So, i booked an area for 25 people to watch the World Cup for a 3pm kick off on Saturday 30th June, we turned up about 2.45pm & the main doors where closed, the shutters where down, i popped up to the roof garden to ask about our booking & was told the downstairs bar does not open until 4pm!! We where told to come back at 4pm, first of all why take bookings for the bar area if you dont open till later in the day?? we watched the first half in another pub & decided to go back for our area at 4pm, the barmen asked for my order, i said 11 pints please, he served me 5, then said you have now had your 11 drinks & started to serve someone else!! Never going back to this place", "date_of_review": "3 July 2018"}
{"review_id": 77, "restaurant_id": -10, "username": "Anna A", "date_of_visit": " July 2018", "rating": "3", "title": "Great rooftop bar but expensive", "comment": "Great rooftop bar with funky decor. The rooftop bar is definitely worth a visit just for the experience.  However, the rood top does get very, very, VERY busy. Drinks and food are very expensive. £9 for hot dog is a joke even in central. Good selection of drinks. There is no music on the rooftop which I thought was a shame. The music in the other rooms is very muffled. The sound system is not very effective which seems a shame. I did enjoy the choice of music it was just a shame that at times it was very difficult to hear!", "date_of_review": "15 July 2018"}
{"review_id": 78, "restaurant_id": -10, "username": "Paul M", "date_of_visit": " November 2017", "rating": "1", "title": "Awful", "comment": "Went here after work on A Friday with my girlfriend and her sister. Upon entry my girlfriends 21 year sister had her bag rudely checked. Inside the bag were some anti depressants. The nasty bouncers proceeded to take an eternity looking at them, showing them to their colleagues and laughing heartily. Absolutely disgraceful and no surprise in the gentrified unwelcoming place that shoreditch has become.", "date_of_review": "11 November 2017"}
{"review_id": 79, "restaurant_id": -10, "username": "embean27", "date_of_visit": " November 2017", "rating": "3", "title": "So so", "comment": "Lovely stylish place but drinks are seriously overpriced for what you get. Downstairs is great party vibes but gets VERY hot. ", "date_of_review": "17 November 2017"}
{"review_id": 80, "restaurant_id": -10, "username": "ReviewsByMichaela", "date_of_visit": " October 2017", "rating": "3", "title": "Rooftop", "comment": "We’d heard about this cool rooftop bar with changing themes so went to check it out. The downstairs bar is quite dark and dingy, we got some nice cocktails from the bar though then headed up the many many stairs to the roof. It was a cold evening and it was still packed. The Moroccan theme ( I think that’s what it was) looked great. A huge tipi filled most of the space with people sitting on rugs underneath all cosy looking.  Worth a try if you fancy some good scenery. ", "date_of_review": "3 November 2017"}
{"review_id": 81, "restaurant_id": -10, "username": "bluntbuttrue1", "date_of_visit": " August 2017", "rating": "2", "title": "Get over yourself", "comment": "started drinking here a few years back when ever I came back to where I grew up to visit friends as in the summer liked the roof bar, But I can quite honestly say over them years I've seen the decline of the place.because it became popular very quickly it also became pretentious over priced and actually started believing it's own hype, which it doesn't live up to the service is slow granted the place does get busy we'll employ more staff, being asked by door staff for id and trust me I'm well past my spring chicken days seemed ridiculous and pointless especially as I didn't carry any why would I. And then finally being asked to pay to get in please your a bar at the top of an old warehouse not a night club. Get over yourself", "date_of_review": "23 December 2017"}
{"review_id": 82, "restaurant_id": -10, "username": "lizpiechota", "date_of_visit": " December 2017", "rating": "1", "title": "This kind of place is everything that’s awful about Shoreditch", "comment": "Overpriced drinks, rude bar staff, dull atmosphere. Came for a couple of Friday eve drinks with friends and was appalled by how the bar manager spoke to both myself and my friend. Disgusting attitude, would never go back. ", "date_of_review": "1 December 2017"}
{"review_id": 83, "restaurant_id": -10, "username": "Aarron W", "date_of_visit": " April 2019", "rating": "4", "title": "Professional Staff", "comment": "I would like to comment that after a misunderstanding the staff here were respectful and professional throughout. They dealt with my issue well and and ensured my welfare. An honourable mention to both the head doorman and the manager of the venue. Both very friendly and understanding.", "date_of_review": "22 April 2019"}
{"review_id": 84, "restaurant_id": -10, "username": "Naviinnn", "date_of_visit": " February 2018", "rating": "2", "title": "Avoid if possible ", "comment": "Dull atmosphere, especially downstairs where the dance floor is quite congested Terrible music!!  Take a long time to order one drink! The place should have more bar staff Avoid if possible since there are many better bar and club in the area ", "date_of_review": "17 February 2018"}
{"review_id": 85, "restaurant_id": -10, "username": "ahmed b", "date_of_visit": " March 2018", "rating": "4", "title": "A very big bar with different atmospheres!", "comment": "An exotic place where you can feel the atmosphere of the Desert and have a lot of fun... the drinks are accessible (good price)", "date_of_review": "3 April 2018"}
{"review_id": 86, "restaurant_id": -10, "username": "Sierra V", "date_of_visit": " March 2018", "rating": "4", "title": "Hip hop Karaoke", "comment": "This place only get 4 stars because of Hip Hop Karoke. I had a great time singing along and watching the performers. The host and DJs were great. The staff there werent necessarily friendly.", "date_of_review": "31 March 2018"}
{"review_id": 87, "restaurant_id": -10, "username": "nysthomas", "date_of_visit": " December 2017", "rating": "2", "title": "Rooftop bar Moroccan Medina stule", "comment": "The 6£ mint tea was terrible. The mint taste was totally absent and it was mere plain black tea without sugar. Not the kind of mint tea you’d expect in an Moroccan themed bar.", "date_of_review": "28 December 2017"}
{"review_id": 88, "restaurant_id": -10, "username": "deecastro2017", "date_of_visit": " January 2018", "rating": "3", "title": "Avarage", "comment": "The roof top has been converted into a Moroccan medina. Essentially found it on cushions with really low coffee type tables. The vibe is laid back, colourful carpets and prints in the tent. Shisha available outside with logs and wall sits to chill on. There is a bar and a kitchen type area which allows you order snacks and burger.", "date_of_review": "18 April 2018"}
{"review_id": 89, "restaurant_id": -10, "username": "Jolz59", "date_of_visit": " July 2018", "rating": "3", "title": "Nice but could be better!", "comment": "Popped in for a drink on a hot afternoon. Great little rooftop space, quirky and they’ve made good use of it. However, the 6 flights up to it is hard going! The bar lacks atmosphere down stairs, being dark but i guess aimed at evening club trade. Not the best vodka, lime and soda.....Still it’s a good little pit stop.", "date_of_review": "28 July 2018"}
{"review_id": 90, "restaurant_id": -10, "username": "manpoodle", "date_of_visit": " August 2018", "rating": "5", "title": "Lost Vegas", "comment": "We visited early on a sunny Sunday afternoon, before the main bar downstairs was open. We went up to the rooftop which has the theme Lost Vegas, complete with a little white chapel. Loved the set up, it all looked fab and we really enjoyed the food from the little shack up there. It was a boiling day so it must have been a nightmare cooking over a grill in that heat! I had the not dog which was delicious! Fries were good too and they do some lovely cocktails. As we were there early in the afternoon it was fairly quiet which was lovely! I'd imagine it gets really busy later on. Great little place for a snack and some cocktails, especially if the sun is out!", "date_of_review": "9 August 2018"}
{"review_id": 91, "restaurant_id": -10, "username": "gabrielboschi", "date_of_visit": " February 2017", "rating": "4", "title": "Cozy and nice place", "comment": "Really cozy and nice rooftop place for a drink with friends and cool background where to spend an evening. I went already 5 times and always feel really cool, especially when winter! Service acceptable", "date_of_review": "20 October 2017"}
{"review_id": 92, "restaurant_id": -10, "username": "chrisdU1408DY", "date_of_visit": " August 2016", "rating": "5", "title": "Great date venue!!", "comment": "In winter there is a wigwam on the room where you can roast marshmallows over fire pits and there is usually a BBQ, butter rum and mulled wine - great vibe! ", "date_of_review": "23 July 2017"}
{"review_id": 93, "restaurant_id": -10, "username": "clairekillick2018", "date_of_visit": " July 2017", "rating": "3", "title": "Dirty", "comment": "We went to the roof top terrace. The stairwell looks like some dodgy car park stairs. Once up there we managed to find ourselves a seat. Quite a relaxed atmosphere with a mixture of groups. The beer glasses were dirty so we got those changed. Plastic glasses aren't my thing so we only stayed for one. ", "date_of_review": "15 July 2017"}
{"review_id": 94, "restaurant_id": -10, "username": "Whadders", "date_of_visit": " July 2017", "rating": "4", "title": "Eclectic Roof Bar", "comment": "Went on a hot summer day up to the roof bar, it was busy and took a while to get served but I enjoyed the vibe and strange decor. Good sun trap as well but as a roof bar not a great view, still enjoyed it though, quite a few flights of stairs up to the roof bar.", "date_of_review": "10 July 2017"}
{"review_id": 95, "restaurant_id": -10, "username": "Metropolitan_Man", "date_of_visit": " July 2017", "rating": "4", "title": "RoofTop Cinema", "comment": "Visit to watch a film on the RoofTop terraces. Interesting concept and something different to try. The chairs are not the most comfortable and with any UK activity it did get a bit cold. However they were showing my favorite classic film so was not a problem for me. . .would consider returning.", "date_of_review": "24 July 2017"}
{"review_id": 96, "restaurant_id": -10, "username": "Will W", "date_of_visit": " April 2017", "rating": "4", "title": "Simultaneously incomparable and unpretentious", "comment": "Great atmosphere, from walking in the door you knew this wasn't going to be somewhere uptight or overly preppy. The customers match the bar, we got chatting to a few but unfortunately ended up losing at table football to them. It's ping pong meets East bar. Decent value without pretension.", "date_of_review": "7 September 2017"}
{"review_id": 97, "restaurant_id": -10, "username": "802sisselk", "date_of_visit": " August 2017", "rating": "4", "title": "Super cozy", "comment": "Really good and cozy bar. Very authentic and a nice place to hangout. Its even possible to buy food here in their rooftop bar. If the weather is good, its definitely a must to go visit. Check out if they still have their movie nights.", "date_of_review": "31 August 2017"}
{"review_id": 98, "restaurant_id": -10, "username": "jenjoeful", "date_of_visit": " September 2017", "rating": "1", "title": "Outdoor Cinema - Badly organised, too many people", "comment": "Booked for outdoor cinema to see Grease.  The prep for putting out the chairs went on past the time the move was supposed to start.  There were way too many people there, and when the people putting out the chairs told us to move back, we were very tight on space, it was pretty much a fire hazard the way it was organised. People were getting very annoyed. To be fair it wasn't the people that were putting out the chairs fault, it was the managements. It was really getting too packed up there while we waited to get our seats.  When we were allowed into our seats - it was an actual stampede of the woman. There was handbags flying all sides, woman's sense of territory was actually frightening. Everyone was shouting to make sure no one sat on \"their\" seats. Truly horrifying.  Movie was good - can't get much better than Grease. But the setup and organisation were awful!! The seats were so packed together, people bearly had room for their knees. Tickets were like £20 or more, it's a little bit selfish. Won't return, wouldn't recommend them as a cinema.  Oh and the white wine for sale (only one type?) was the worse vinegar I've ever tasted. Seriously only 1 wine, over priced and tasted so bad!!!", "date_of_review": "12 September 2017"}
{"review_id": 99, "restaurant_id": -10, "username": "LYMP27", "date_of_visit": " March 2017", "rating": "5", "title": "Bang on", "comment": "This place is bloody sick. I rocked up in the late evening at about 11ish and by the size of the queue it obviously showed quality. The queue moved nice and quickly, and once inside I had the best bloody night. The triple tiered club gives opportunities for everything. A quiet place to sit, a raving dance floor in the basement etc. Next time I come to London I shall be back at the Queen", "date_of_review": "5 March 2017"}
{"review_id": 100, "restaurant_id": -10, "username": "helenn142", "date_of_visit": " July 2017", "rating": "1", "title": "BE AWARE ", "comment": "Well that's a first! Being turned away from a pub! Yes a pub.... not a nightclub of repute or fancy restaurant.  Why .... apparently because I had open toed shoes on!  Its 27 degrees in London, why wouldn't I, I politely asked the doorman? No answer.  I can only think (as others were allowed in, wearing flip flops).... it because both my husband and I both had gay pride ️‍ rainbows adorning our bodies and faces.  Think about your door policy Queen of Hoxton. It's a big world out there! ", "date_of_review": "8 July 2017"}
{"review_id": 101, "restaurant_id": -10, "username": "jnsn890", "date_of_visit": " July 2017", "rating": "5", "title": "Love this bar", "comment": "The rooftop bar is just awesome! It's had two different themes since I've been going, it's a really clever layout and I've always loved the atmosphere. Definite recommend - summer and winter!", "date_of_review": "19 July 2017"}
{"review_id": 102, "restaurant_id": -10, "username": "Sheed888", "date_of_visit": " July 2017", "rating": "4", "title": "A rooftop gem", "comment": "I popped in when passing on a sunny Sunday afternoon and the vibe was chilling with people milling, drinking and eating with Cheshire Cat smiles on their face. The place is mulit-levelled but I believe everyone comes for he rooftop bar. Seating was limited so we sat on the fake grass with others and put the world's to rights. We paid about £18 for 2 double G&Ts so that's not too bad for the Big Smoke prices. Would I go again? Oh fo sho!", "date_of_review": "12 July 2017"}
{"review_id": 103, "restaurant_id": -10, "username": "iansP8137CU", "date_of_visit": " May 2017", "rating": "5", "title": "Love this place", "comment": "Came for after work drinks with friends and was up on the rooftop. The view is great of the skyline and can appreciate the sun when it is out. Has a good vibe and great place to get a drink. When it gets later on, the bar and club downstairs open which has great music and atmosphere", "date_of_review": "14 May 2017"}
{"review_id": 104, "restaurant_id": -10, "username": "AnumMir", "date_of_visit": " March 2017", "rating": "1", "title": "Change the staff and I may become a regular again.", "comment": "I have been a regular since the establishment since 2009. The past few times, I have been disgusted by the door staff. Not only are they sarcastic and impolite- ruining a perfectly good vibe but think it's ok to grab a customer's crotch in response to a question about being allowed to go to rooftop to smoke as bouncers wouldn't permit re-entry.  This is assault and of course a legal matter which will be dealt with.  But as a business, this place really needs to get staff that is better at what they do and train their teams the fundamentals of service. Will not be returning.", "date_of_review": "18 March 2017"}
{"review_id": 105, "restaurant_id": -10, "username": "391sanjs", "date_of_visit": " May 2017", "rating": "5", "title": "Nice Venue", "comment": "Nice Thursday evening visit after work! Great views, nice atmosphere & decently priced drinks! Would definitely recommend!! ", "date_of_review": "14 May 2017"}
{"review_id": 106, "restaurant_id": -10, "username": "nb_101", "date_of_visit": " May 2017", "rating": "2", "title": "Terrible bar service", "comment": "Visited on a Wednesday evening, it was busy because the weather was good but a 20 wait to get a drink is inexcusable. Badly trained bar staff who don't note who's next in line, glass collectors and food staff standing around doing nothing who are either not allowed or are unwilling to muck in and a general lethargy. ", "date_of_review": "25 May 2017"}
{"review_id": 107, "restaurant_id": -10, "username": "ldreolid", "date_of_visit": " May 2017", "rating": "4", "title": "Nice rooftop", "comment": "Came here last Saturday evening with some friends. Had a good time up in the rooftop even though they didn't have any music on. It would've been much better, at least some low chill out music.  Bar queues upstairs were a nightmare so had to go downstairs to pick the drinks and all the way up (long way through staircase). Ended up going down to listen to some music, basement was packed and music wasn't very good but I had a good time.", "date_of_review": "23 May 2017"}
{"review_id": 108, "restaurant_id": -10, "username": "mizzy_03", "date_of_visit": " May 2017", "rating": "1", "title": "Dirty", "comment": "Went to the roof top and it was full pack.... which is fine but its rubbish everywhere and the lavatories are disgusting ", "date_of_review": "31 May 2017"}
{"review_id": 109, "restaurant_id": -10, "username": "clamlo", "date_of_visit": " September 2016", "rating": "4", "title": "Good night out", "comment": "Went here with a group of friends for a few drinks. We sat in the roof top outside which was really nice. I really liked the decor as it was different from the usual places. We sat within a convertible car to have our drink! We had to queue for a little while to get drinks as it was very busy but this is expected. There is an entry fee but I can't remember what this was (around £5).", "date_of_review": "3 June 2017"}
{"review_id": 110, "restaurant_id": -10, "username": "Sophie H", "date_of_visit": " July 2017", "rating": "2", "title": "Great terrasse but extremely loud music and quality of drinks really average", "comment": "We went there around 8pm for drinks with some friends. The terrasse is great during summer but it was really busy when we arrived (hard to walk across the crowd to reach the bar). However, they ask you to come down very early, around 10pm if i remember correctly. The music is extremely loud both outside and inside so it is quite hard to have a conversation. The quality of the drinks and food is really average.", "date_of_review": "3 July 2017"}
{"review_id": 111, "restaurant_id": -10, "username": "Will W", "date_of_visit": " December 2016", "rating": "4", "title": "Super rooftop ", "comment": "Fantastic pub. When I visited it had a viking style lodge on the roof offering good food and drink. Well heated and great atmosphere.", "date_of_review": "2 March 2017"}
{"review_id": 112, "restaurant_id": -10, "username": "ludovinet", "date_of_visit": " January 2017", "rating": "4", "title": "Never fails to entertain", "comment": "A drink at the Queen of Hoxton is an experience in urban camping. Rooftop bonfires, delicious, warm cocktails and even the option of roasting your own marshmallows on a skewer! Don't wear your best outfit, though, if you don't want it smelling like a smokery. The downstairs area is quaint and always playing the best deep-house tunes. Worth a visit.", "date_of_review": "8 January 2017"}
{"review_id": 113, "restaurant_id": -10, "username": "EeeBot", "date_of_visit": " December 2016", "rating": "4", "title": "Good vibes", "comment": "The food and drinks are ok, but the atmosphere is amazing. The seasonal decor is everything! You completely forget you're in London. ", "date_of_review": "15 February 2017"}
{"review_id": 114, "restaurant_id": -10, "username": "hiltonsam", "date_of_visit": " January 2017", "rating": "4", "title": "Fun vibe", "comment": "So we had a weekend In London and picked queen of hoxton as our sat night destination! It was great! Drinks are not bad price, music was good, friendly people. Door staff were strict patted down people down and checked everyone's pockets and bags a lot of people were being turned away (drugs in pockets). You then pay 7 or 8 pounds to get in. Annoying thing was the smoking situation one in one out. Will return.", "date_of_review": "8 January 2017"}
{"review_id": 115, "restaurant_id": -10, "username": "Lisathenderson", "date_of_visit": " February 2017", "rating": "1", "title": "Rude Arrogant Bouncers ", "comment": "I had reserved an area for a party with our friends, when we arrived at around 8pm we were made to queue outside one of my friends was smoking and the bouncer aggressively told him - not asked him - to put it out my friend said that was a bit of an aggressive request and the bouncer said 'it's my queue you better have respect'. My friend was happy to put it out but the bouncer was down right rude and aggressive. I think considering they were making us queue on a public footpath and not on their property that's actually not within their right. Another one of my friends arrived later and did not have ID she is 34 years old and explained she was with my party - I appreciate it's within their right to ask for ID but again the bouncer was aggressive and rude towards her. Some of our friends later went out to smoke on the rooftop area and the same bouncer told them to keep the noise down?!? It's a bar which was playing loud music so it is beyond me why he was barking this at customers. It's a real shame as I've been to the venue before but the security staff this time around seemed to be on a power trip and really put a downer on our night. Myself and our group of 15 friends will not be back especially with an £8 entry fee there are so many better venues in the area with nice staff. ", "date_of_review": "26 February 2017"}
{"review_id": 116, "restaurant_id": -10, "username": "H0eb0", "date_of_visit": " February 2017", "rating": "3", "title": "Not really worth the visit", "comment": "I wanted to check out the rooftop bar as it was listed as being viking themed. It was average at best. The music was a mix of RnB and 80''s which was weird enough. The special cocktails weren't that great. The firepits were a nice touch but not enough seating. The toilets up there are disgusting as you'd expect. The staff were polite enough but the bouncers were quite rude. It's unlikely I'll bother going back.", "date_of_review": "27 February 2017"}
{"review_id": 117, "restaurant_id": -10, "username": "Francesco M", "date_of_visit": " February 2017", "rating": "1", "title": "Bad", "comment": "Not understand that place at all.  You have no choice on the beer (just 2/3 commercial kind) and you're in London.  You've no choice on the food, not usual in a city that offer so many kind of kitchen and different menù.  No waiters and no one to clear the table.  The toilet are underground and when you're in the only sense place (the rooftop) this will be a big problem.  Really... Why chose this place?", "date_of_review": "16 February 2017"}
{"review_id": 118, "restaurant_id": -10, "username": "Ross F", "date_of_visit": " February 2017", "rating": "4", "title": "Best rooftop bar in london iv been", "comment": "We arrived at about 4pm bouncer on the door seemed to like his job a bit to much and seemed to be out to make a name for himself but once we were in the atmosphere was super chilled out and laid back, really cool tipi on the roof and fire pits to roast marshmallows ", "date_of_review": "22 February 2017"}
{"review_id": 119, "restaurant_id": -10, "username": "DrSarah62", "date_of_visit": " December 2016", "rating": "4", "title": "Mad Entertainment Space", "comment": "Set on the roof on an old Hoxton warehouse there is a Viking Wigwam - or at least there is at this time of year. Sup warm mead from horns, or enjoy a Viking themed cocktail, or not so Viking themed glasses of wine. The bar is outside but the Wigwam itself is very well heated so take lots of layers. It hosts a variety of events including life drawing salons.", "date_of_review": "4 January 2017"}
{"review_id": 120, "restaurant_id": -10, "username": "Andreea A", "date_of_visit": " February 2017", "rating": "3", "title": "Pancake day", "comment": "We've been yesterday for the pancake day, is an alright place, they had fire on the roof for marshmallow toasting, tho we wanted to do that, we couldn't as I've forgot to buy them and I just didn't quite feel queuing another 30 minutes after the 30 min to order drinks and pancakes...which we had to que another 20 minutes for, to get the pancakes. So not quite good experience, I've had my both drinks while queuing. The only reason I'm not rating less is because the staff seemed nice, and you could see they were giving their best. Amazing blond bartender, and I'm saying it for the speed he was managing to serve the people, a couple more like him and there wouldn't have been a que, Good pancakes also!", "date_of_review": "1 March 2017"}
{"review_id": 121, "restaurant_id": -10, "username": "benny007", "date_of_visit": " February 2017", "rating": "1", "title": "Won't be back", "comment": "We thought we'd try somewhere new for a team night out, wish we hadn't bothered. The experience didn't start well with two stuck up bouncers on the door. We were all asked for ID, had our bags searched, i wasn't allowed to take in a small bottle of water and there were just rude. This was at about 6:30pm! It then took us 30mins to get drinks, only 3 bar staff on duty and 6 deep at the bar and everything is served in plastic glasses. We were then told they were no longer taking orders for pancakes, the main reason why we went there. So we left and went to the Singer bar around the corner, much nicer atmosphere, got served quickly (even though it was busy) and the drinks were in actual glasses.  I wouldn't bother going.", "date_of_review": "2 March 2017"}
{"review_id": 122, "restaurant_id": -10, "username": "Hotelinspector1234", "date_of_visit": " July 2016", "rating": "4", "title": "Pretty groovy place", "comment": "i prefer the bar atmosphere upstairs on one of the 3 nice days London get a year during the day to have a few beverages, later at night it gets a bit crowded down stairs. but oh my goodness the food up stairs is the one and they are always changing the theme upstairs in the garden which is daed cool seeing how they deck the place out! Staff are pretty cool as long as you don't piss them off and are a good human in general!", "date_of_review": "29 September 2016"}
{"review_id": 123, "restaurant_id": -10, "username": "embean27", "date_of_visit": " October 2015", "rating": "5", "title": "Rooftop cinema club ", "comment": "Attended a rooftop cinema club event and watched bird man. Had such a good time. Good vibes, good film and good food.  Will be returning! ", "date_of_review": "28 September 2016"}
{"review_id": 124, "restaurant_id": -10, "username": "CatarinaB43", "date_of_visit": " September 2016", "rating": "4", "title": "Unexpected bar scene", "comment": "Visited the Queen of Hoxton with friends after work. It is a really nice roof top bar! Amazing to find such a place in London. Drinks were good, and the food was also surprisingly good for being bar food. Will certainly come again. ", "date_of_review": "22 September 2016"}
{"review_id": 125, "restaurant_id": -10, "username": "Louiscne", "date_of_visit": " September 2016", "rating": "5", "title": "What a mad one!", "comment": "Electric is one of a better word for the vibe at the queen! What a mad night. It's that type of place where if you get in early, you just won't need to go anywhere else.  The food on the roof was lovely, especially the lamb burger and sweet potato fries (more like wedges, they're fat and they're great) and the staff were pretty cool man, very helpful.  I ordered and had to try the El Jimador slush puppies as well and not only were they good but they also packed a punch. Booming. Night moved on and I ended up in the basement, that funktion1 sound system blew my mind and I got on a mad one -- had a blast. Great staff, great venue, I'll be going there next weekend for sure! ", "date_of_review": "30 September 2016"}
{"review_id": 126, "restaurant_id": -10, "username": "Chaomianpian", "date_of_visit": " September 2016", "rating": "4", "title": "Great roof garden", "comment": "The pub is nice, nothing too special. What is great is the roof garden - outside space is at a real premium in this area of London.  The staff are friendly and they have decent drinks (there was a pale ale from Crate Brewery last time I visited).  If you're in the area and looking for somewhere to go for drinks this is a great option.", "date_of_review": "2 October 2016"}
{"review_id": 127, "restaurant_id": -10, "username": "J_Mary89", "date_of_visit": " November 2016", "rating": "4", "title": "Viking theme rooftop bar", "comment": "The rooftop bar has a Viking theme for the winter, which was really cool! It was busy, but as there was only 2 of us we shared a table with other people.  Drinks were standard price for London, around £5 for a pint of ale. The pork belly stew was very tasty too, and cheap at only £5 a portion!  There was also the opportunity to toast marshmallows on the fire, which was great as it was very chilly. ", "date_of_review": "16 November 2016"}
{"review_id": 128, "restaurant_id": -10, "username": "Sophie P", "date_of_visit": " October 2016", "rating": "2", "title": "Go if you like being treated like cattle", "comment": "Turned up at 6.30 on a Friday night. There were no seats anywhere and every table was reserved for parties. The rooftop Vikings themed bit was cool, but no one told us it closed at 10pm. We went downstairs to use the toilets & staff wouldn't let us back up, even to get our stuff. We were herded about like cattle. Won't be going back. ", "date_of_review": "29 October 2016"}
{"review_id": 129, "restaurant_id": -10, "username": "andrewfg7", "date_of_visit": " November 2016", "rating": "4", "title": "Very good night !", "comment": "Fun trendy place with a rooftop bar, main floor and basement. The queue on a Saturday night to hang up coats after 11 was quite long but the normal for London. Drinks were average price for London and it does have a great atmosphere, although the music on both floors on the night we went was not for our taste. Only a 7 minute walk from Liverpool Street tube. Staff were quick to serve drinks, overall a good experience. ", "date_of_review": "21 November 2016"}
{"review_id": 130, "restaurant_id": -10, "username": "Angeliki T", "date_of_visit": " December 2016", "rating": "4", "title": "Dance the night away", "comment": "Even though it was a rainy day, and the rooftop bar was shut we enjoyed a night of drinks and music on the ground floor. Busy as expected on a Saturday night, they charge £8 entrance fee, with the drinks being quite cheap (though also very light). Fun and hip bar for the 20+ with 90s music playing to remind us of our childhood :)", "date_of_review": "13 December 2016"}
{"review_id": 131, "restaurant_id": -10, "username": "bianca lee j", "date_of_visit": " July 2016", "rating": "3", "title": "Rooftop party!!", "comment": "Great atmosphere I came here with 7 friends for the supa dupa fly rooftop party  I love the decor the vibe is fresh and funky the rooftop bar is great!  Very pricey for drinks and food (although very tasty) make sure you try the tequila slush puppies they blew my head off  The music and the fun bar staff made up for the dent in my bank balance  The staff were super fast friendly and efficient  Very clean toilets also which is rare in a London pub lol  I will be back next summer great place!!", "date_of_review": "21 September 2016"}
{"review_id": 132, "restaurant_id": -10, "username": "chelsea d", "date_of_visit": " August 2016", "rating": "5", "title": "Enjoyed ", "comment": "Nice evening! Responsibly priced drinks! Shame about the one in one out for the rooftop bar, still nice drinking inside with music ", "date_of_review": "6 August 2016"}
{"review_id": 133, "restaurant_id": -10, "username": "HhfiwolgB", "date_of_visit": " August 2016", "rating": "4", "title": "Always good vibes", "comment": "Always have a good night at queen of hoxton - music in the main room is reliably decent and in the downstairs room there always seems to be something a bit edgy/different. Got a photo booth as well which is pretty fun - although it could give you more notice before it takes a picture! Would love to come back in the daytime as I've heard the roof garden is lovely then. ", "date_of_review": "7 August 2016"}
{"review_id": 134, "restaurant_id": -10, "username": "Sophie L", "date_of_visit": " July 2016", "rating": "4", "title": "Goodtimes Goooodtimesssss", "comment": "Always a chill place to go,one our fav in shoreditch for a chill drink or a quick one. Rooftop bar is great, overall really good vibes. Be sure to go when the weather is nice and on the right day because the rooftop isn't always open!", "date_of_review": "10 August 2016"}
{"review_id": 135, "restaurant_id": -10, "username": "Samantha I", "date_of_visit": " August 2016", "rating": "3", "title": "Good night with friends. ", "comment": "It's a good night and the cocktails are tasty but some of the bar staff didn't know how to make them so kept having to ask for help from others. Another made the wrong drink three times. Not their fault of course, if they are new but must have been hard for them on a busy Friday night.  Photo booth was excellent but you have to sit down to get a good picture!  I would go back but would hope that the bar service will be better. ", "date_of_review": "14 August 2016"}
{"review_id": 136, "restaurant_id": -10, "username": "LionKing1995", "date_of_visit": " August 2016", "rating": "5", "title": "Best night ever", "comment": "Josh and Jake at the bar were absolutely amazing (the glitter was sick boys) I had such a good night because of them! Also Taz I think it was outside with the water she was a doll! Will definitely be back love you guys :) ", "date_of_review": "19 August 2016"}
{"review_id": 137, "restaurant_id": -10, "username": "chiara94100", "date_of_visit": " August 2016", "rating": "5", "title": "The place to be in Shoreditch !", "comment": "So amazing place with amazing people. Great music, cocktails and the rooftop is great but overcrowded. Thanks to all staff for their kindness and smile  The best place to drink a nice cocktail with good snacks. In love with this place ", "date_of_review": "29 August 2016"}
{"review_id": 138, "restaurant_id": -10, "username": "nicolad999", "date_of_visit": " August 2016", "rating": "2", "title": "Don't bother ", "comment": "Decided to give this venue a try out as I was invited to a Birthday party. Have to say one of the worst places I have been too in a long time. I can't see what I was charged £8 for to be honest! No organisation at all. Long queues, staff with stinking attitude, no information (i.e stating that the roof is only open to smokers as the rest has been closed off) The venue itself is lacking, dark and dingy and could do with a refurbishment as for having 3 floors; only one main floor was open as the basement was closed and the roof was partly open. You could not go up on the roof to chill out as advertised as they had barricaded it off for noise reasons (fair enough, but have the decency to inform customers when your waiting 15 mins to get up there!). Queen of Hoxton seems to be a popular place for 18 year old son but for me personally if your over the age of 25 years don't bother! ", "date_of_review": "15 August 2016"}
{"review_id": 139, "restaurant_id": -10, "username": "Andy M", "date_of_visit": " August 2016", "rating": "4", "title": "Quirky venue for watching a film", "comment": "We went here on a hot summer's night to watch Die Hard on the roof terrace which is lovely and quirky. We got there around 15 mins early and they set-up the terrace for the film quickly and efficiently. It did get cold during the film but there seemed to be plenty of blankets to address that. The drinks and food were reasonably priced and the seating and screen were good enough to watch a longish film. It's a great view and very strange to be watching a film surrounded by office blocks, but definitely one to experience! The rest of the place is a bit grungy so we made a quick exit for the taxi once the film had finished!", "date_of_review": "1 September 2016"}
{"review_id": 140, "restaurant_id": -10, "username": "EMatthewsUK", "date_of_visit": " July 2016", "rating": "5", "title": "Company Away Day", "comment": "We celebrated our company away day here and it was just as fun and wild as expected! During the early evening it has a more relaxed open vibe, but after about 8/9 the party really starts, everyone flocks to the dance floor with a smile on their face and a drink in their hand. The DJ played some great tunes, but there was a lack of genre/style consistency; and they didn't have my request (Candy/Electric slide - who doesn't have this song?!) - other than that is was so good! The food too, we ordered a 20 person platter, which was so fresh, hot and filling! Loved it!", "date_of_review": "2 August 2016"}
{"review_id": 141, "restaurant_id": -10, "username": "SH05059", "date_of_visit": " September 2016", "rating": "4", "title": "Quirky bar", "comment": "We went here after a day out in Shoreditch as we have heard nothing but good things.  Great atmosphere, great music and great people.  Prices on drinks are reasonable and plenty of place to sit and have a drink if your not in the mood for getting your groove on!  Easy to find and close to transport (3 minute walk through Liverpool Street Station).  Can't wait to spend another night here.", "date_of_review": "5 September 2016"}
{"review_id": 142, "restaurant_id": -10, "username": "548angelah", "date_of_visit": " May 2016", "rating": "4", "title": "Hipsville", "comment": "This is a bar and club. It felt very entertaining with new film releases being shown, made you kinda too comfortable to leave!", "date_of_review": "14 May 2016"}
{"review_id": 143, "restaurant_id": -10, "username": "GEORGIE H", "date_of_visit": " June 2016", "rating": "5", "title": "Amazing rooftop bar", "comment": "The queen of hoxton is an incredible bar that caters for any type of night you are after. Late afternoons or casual drinks on their gorgeous rooftop, a nice vibey bar on the ground level or go underground to the basement and bop around to house music or even live music. These guys have planned this venue out extremely well and have filled it with great staff. I was served by a girl named Tari who was super friendly and fun. Cheep drinks and wacky cocktails. Only thing I would like to improve is their beer choices haha.", "date_of_review": "13 June 2016"}
{"review_id": 144, "restaurant_id": -10, "username": "Sdc90", "date_of_visit": " May 2016", "rating": "3", "title": "Nice Rooftop", "comment": "This place has a really nice rooftop serving good cocktails! worth a visit in the sunshine! downstairs is a bit dingy and dark though.", "date_of_review": "16 May 2016"}
{"review_id": 145, "restaurant_id": -10, "username": "B8385DWmichelleb", "date_of_visit": " May 2016", "rating": "4", "title": "Very 'hipster' vibe on rooftop patio", "comment": "The rooftop is amazing for a warm summer day with open views of the city, colourful walls and sculptures and scenery everywhere. The drinks were affordable and offered cocktails, beers/ciders and slushy drinks (although the slushies were not working when we were there). The line up for drinks was extremely long so it's ideal if you are in a rush for a quick drink before a meal,etc. We waited probably 20-30 minutes just to get our drinks. The vibe of the rooftop was all 20-30 somethings but very 'hipster' with people sitting on the grass areas because it was so crowded. ", "date_of_review": "8 May 2016"}
{"review_id": 146, "restaurant_id": -10, "username": "HelSlater", "date_of_visit": " June 2016", "rating": "5", "title": "Fun and funky", "comment": "Went for a quick afternoon cocktail or 2 one roof but it started to rain... Didn't change a thing, The Atmosphere was brilliant under cover on the roof top and ended up staying most of the evening. Think I would ask for the cocktails not to have extra soda water as ruined taste a little, otherwise , great place to go!", "date_of_review": "19 June 2016"}
{"review_id": 147, "restaurant_id": -10, "username": "threetypesofpea", "date_of_visit": " July 2016", "rating": "3", "title": "Rooftop bar - hot day - too busy", "comment": "The rooftop bar is a special place but on a very hot day, probably too many people up there... Music was not loud enough. It had the potential to be great but just too many people packed in like sardines... ", "date_of_review": "25 July 2016"}
{"review_id": 148, "restaurant_id": -10, "username": "Dia1dia", "date_of_visit": " August 2016", "rating": "5", "title": "The best Sunday roof party ever.", "comment": "We bought our tickets for Supa Dupa and what a brilliant silent disco on the roof, The atmosphere was amazing the people were friendly and staff were too. We came from Manchester and was well worth the trip, We arrived at 13:30 got a drink and probably the best Lamb Burger I have ever had. Only problem was towards at around 4pm the bar was crazy busy and the toilet q was very long, we couldn't even go downstairs it was that busy it was one in one out on the roof, But the best time I have had in London for a long time.", "date_of_review": "1 August 2016"}
{"review_id": 149, "restaurant_id": -10, "username": "tdcollier82", "date_of_visit": " July 2016", "rating": "5", "title": "Great place- even better team! ", "comment": "Reserved a section at the Queen of Hoxton for my girlfriends surprise 30th birthday party last week and I have to say the team who work there are amazing! So helpful, and really went out of there way to help make sure everything went smoothly.  Unfortunately i had to leave early without saying thank you to everyone who worked that night and helped me (enjoyed myself a little too much) so here is a massive thank you to you all!!", "date_of_review": "26 July 2016"}
{"review_id": 150, "restaurant_id": -10, "username": "lynnmZ2213AA", "date_of_visit": " May 2016", "rating": "5", "title": "try the gin genies", "comment": "Queued for roof terrace but got fed up waiting so found a good table after a few moves throughout the evening. Got busier and louder as the night went on but good atmosphere, great music and tasty gin genie cocktails served with slivers of cucumber. ", "date_of_review": "7 May 2016"}
{"review_id": 151, "restaurant_id": -10, "username": "ToniTrav", "date_of_visit": " January 2016", "rating": "5", "title": "Wonderful winter in the wigwam", "comment": "Popped in here on Friday night to experience the Wigwam that has been much written about in the press. Definitely not disappointed! The stairs are not as onerous as I had expected and it is well worth the climb to see the artwork on the walls alone. Once you step through the keyhole into the wigwam, it is warm and welcoming. Lots of winter drinks available as well as the usual drinks you would expect in a pub, and there is a relaxed vibe at the bar.  I would recommend a visit before it closes in March and turns into the summer rooftop, which I will be back to look at. ", "date_of_review": "24 January 2016"}
{"review_id": 152, "restaurant_id": -10, "username": "Jimmy D", "date_of_visit": " February 2016", "rating": "5", "title": "Great Friday Night Out", "comment": "What a refreshingly brilliant venue! Really great, stylish and cool crowd. Brilliant DJ and music. Helpful and friendly bar staff. Fed up of boring, soulless, grey city bars and venues? Well this is the place for you. Literally not even 4 mins walk from the city. The music is cool/hip/funky, the ratio between guys and girls seems 60/40 in the girls favour (good luck finding that in a city bar!). Further to this I had such a good night I left something very expensive at the venue in error. I assumed the item would be lost but after phoning up the guy running the place (Josh) went out of his way to help me and I ended up getting the item back as someone had handed it in. I think this speaks volumes about the place and the clientele that visit it. This is one of THE up and coming venues in Lodnon at the moment, pay it a visit with some friends, I absolutely guarantee you will not be disappointed. We’ll be back this Thursday!", "date_of_review": "16 February 2016"}
{"review_id": 153, "restaurant_id": -10, "username": "SisterWivesCo", "date_of_visit": " January 2016", "rating": "5", "title": "Great venue, music, food, drinks & atmosphere!", "comment": "One of London's gems that everyone should visit! We loved the WigWam rooftop. The food and drinks are tasty and they're not overpriced. The staff are also pleasant, which is an enormous plus! We will be back!", "date_of_review": "25 February 2016"}
{"review_id": 154, "restaurant_id": -10, "username": "benwright1988", "date_of_visit": " February 2016", "rating": "4", "title": "Multi floor bar / club / roof terrace", "comment": "Large bar nightclub venue with cool East London feeling big enough to fit hundreds across its several floors. We enjoyed a few pints (served in plastic cups) in its rooftop tipi.", "date_of_review": "1 August 2016"}
{"review_id": 155, "restaurant_id": -10, "username": "883wayneh", "date_of_visit": " March 2016", "rating": "4", "title": "Fire pit blast", "comment": "Wow, who would have thought it, a teepee in the middle of the city on a roof! Three fire pits and an awesome atmosphere. Drinks are a bit expensive but the setting is so cool.  Bar staff are friendly and David kept the fire going. Thought this was going to be the start to the night but enjoyed it so much we stayed for four hours. Really has the wow factor.", "date_of_review": "11 March 2016"}
{"review_id": 156, "restaurant_id": -10, "username": "oliviakwhite", "date_of_visit": " April 2016", "rating": "4", "title": "Friendly bar stuff, funky atmosphere", "comment": "Just another great reason to spend the night in Shoreditch. The QoH is fun, energetic, and quirky. I love a good bar/club that doesn't take itself too seriously. Makes for totally good vibes all around. The drinks were fine, not too pricey, and the bar staff was really friendly (and fast). A perfect place to go if you just want to dance like nobody's watching in a room full of people who are doing the same. I will definitely be back with friends who missed out the first time around.", "date_of_review": "9 April 2016"}
{"review_id": 157, "restaurant_id": -10, "username": "fabsite", "date_of_visit": " April 2016", "rating": "4", "title": "Trendy disco, probably best for under25", "comment": "The first time I heard of this club it was because of the rooftop cinema they host during the summer. Then, again we passed by while my friends and I were heading to another bar (long queues already at 11pm on Saturday). We finally stopped by for an hour of mindless dance around 0.30 last Friday. No specific event, friendly bouncer checking the id and £5 entrance fee. As I heard about the rooftop, we immediately went up the stairs but unfortunately it was under refurbishment for the incoming spring/summer season. My friends were impressed by the idea of a fully operative rooftop, though. Fair music selection, good sound system particularly downstairs (dance-techno) where it was less packed than at the ground level (r'n'b and hip hop). A photo booth was available in the back for a funny memory of the night. I felt the Queen of Hoxton suits 20-25 years old group of friends and couples having just fun. I frankly could not see any bored person around, that's a good sign despite the little space and large crowds. Very little prices: £5 entrance fee, 2 pints for £6, £1 for the cloakroom (free for bags). Lollipops handed out at the end of the night! I cannot give the full 5* rating because it probably wasn't my cup of tea and the venue was a tad sticky and dirty, compared to more popular and high-end venues. However, this is coherent with Shoreditch and the targeted customers. Keep up the good work, guys! See you next time", "date_of_review": "16 April 2016"}
{"review_id": 158, "restaurant_id": -10, "username": "Izzy M", "date_of_visit": " April 2016", "rating": "2", "title": "Roof Terrace not open", "comment": "I can see how it could be good with the roof terrace being open, but it was expensive for what it was. It felt like a restaurant with people dancing though.", "date_of_review": "20 April 2016"}
{"review_id": 159, "restaurant_id": -10, "username": "680joen", "date_of_visit": " April 2016", "rating": "5", "title": "31st Birthday Drinks", "comment": "Went here on Saturday with large group of friends and all had a great night. The rooftop had a few areas cornered off which was disappointing and the cash only entrance fee was unexpected, but the music and atmosphere really made up for it. DJ A. Skillz was playing some absolute bangers downstairs in the basement which soon got very busy. Really cool place and will definitely be visiting again later in the summer.", "date_of_review": "2 May 2016"}
{"review_id": 160, "restaurant_id": -10, "username": "luluxlou", "date_of_visit": " May 2016", "rating": "4", "title": "Roof top fun", "comment": "Popped in on the day of the rooftop opening for the summer. It was freezing so I didn't stay for long. But it was really busy. People drinking and chilling on the roof despite the cold. Once the weather heats up this will be a great spot. ", "date_of_review": "5 May 2016"}
{"review_id": 161, "restaurant_id": -10, "username": "JadePal_", "date_of_visit": " December 2015", "rating": "4", "title": "Great! ", "comment": "Lovely drinks and great atmosphere! Only came here for a few drinks but really enjoyed it :) staff are very nice and helpful too. ", "date_of_review": "15 December 2015"}
{"review_id": 162, "restaurant_id": -10, "username": "Kim F", "date_of_visit": " August 2015", "rating": "4", "title": "Friend's birthday night out", "comment": "I was glad I picked this venue for my friends birthday as the roof top terrace really is lovely and a big wow factor, however the music was very average and unfortunately the DJ did not have a huge selection of songs to choose from even though there was a specifc theme for the evening.", "date_of_review": "2 September 2015"}
{"review_id": 163, "restaurant_id": -10, "username": "991serenes", "date_of_visit": " September 2015", "rating": "5", "title": "Beautiful sunset, rooftop bar", "comment": "Enjoyed a couple of drinks up at the rooftop bar. The sky was pink, good one nature! Awesome art lines the wall of this corner venue. Very friendly staff and quick service ", "date_of_review": "10 September 2015"}
{"review_id": 164, "restaurant_id": -10, "username": "225veselinap", "date_of_visit": " September 2015", "rating": "4", "title": "Nice roof top", "comment": "We went with some friends on Friday evening, the roof top bar is nice, quick service at the bar, average prices for drinks,food is not bad at all. At 10pm they close,so you have to go downstairs in the club ", "date_of_review": "16 September 2015"}
{"review_id": 165, "restaurant_id": -10, "username": "Dayle H", "date_of_visit": " July 2015", "rating": "4", "title": "A well overdue catch up with a mate rooftop terrace style", "comment": "Working in London for a short while and having a few friends that now live there I arranged to catch up with a mate who worked by Liverpool St station. He mentioned this \"cool\" place we could go for a quick drink or two. Walking in and in didn't think much of the place really, dark, a little grubby and I was a little confused about the whole thing. Got ourselves a drink and then proceeded to the back where we climbed some stairs and some more stairs until we reached the rooftop terrace...what a delight that was. A nice big open space, that had some nice views, a drink in hand and in the sun. It doesn't get much better then this and so unexpected. There is a bar on the roof so don't worry you won't have to camber up and down the stairs everything you want a drink. They also serve some food that looked pretty tasty, however I didn't get the chance to eat there so I can't comment on it more then that. This is a great place for a sunny evening, loved it.", "date_of_review": "24 September 2015"}
{"review_id": 166, "restaurant_id": -10, "username": "Sabrina C", "date_of_visit": " October 2015", "rating": "5", "title": "rooftop secrets", "comment": "Ive been here a few times on the weekend with friends and have always had heaps of fun, good music and good vibes. But what a delight it was to go on a Tuesday .. Not expecting much me and a girlfriend climbed some stairs and then some more until we reached the roof and what a little hidden treasure it was! We sat around the open fire with marshmallows, wine and a bunch of the usual Shoreditch heads. To top it off the Manager and staff went above and beyond for me to retrieve my bank card when Me as clumsy as I am dropped it down the rooftop wooden floors! Defo thought it was a goner. Lets just say floorboards were taken up. What a lovely bunch! :) ", "date_of_review": "28 October 2015"}
{"review_id": 167, "restaurant_id": -10, "username": "kimmy19892015", "date_of_visit": " October 2015", "rating": "5", "title": "Absolutely Fantastic", "comment": "So I went to QOH last night (30th October 2015) and had the most amazing time my experience started off great with friendly bouncers at the door (which you don't normally experience in London) they were chatty and friendly but very professional! The great experience continued inside with great music and modest priced drinks! It did get a little busy but such great fun! I will definatly be going back in the near future", "date_of_review": "31 October 2015"}
{"review_id": 168, "restaurant_id": -10, "username": "jasonbR9585XT", "date_of_visit": " October 2015", "rating": "5", "title": "Brilliant!!!", "comment": "We visited while the big canvas was up top and a street food counter. Food was incredible and of good value. Very quirky place and will be going again to whatever is happening on the roof top.", "date_of_review": "30 October 2015"}
{"review_id": 169, "restaurant_id": -10, "username": "LP26", "date_of_visit": " November 2015", "rating": "4", "title": "Friendly staff and great night", "comment": "Firstly, the team are really friendly. My boyfriend lost his coat jacket and house keys, they had been handed in (thank goodness) and the staff were very helpful in getting them back to him. So thanks guys. Secondly, quite nice bouncers willing to have a chat and be reasonable too - great work! Good vibe! Small issue with black dirt on all of our shoes when we first attended, and also the second time but the manager is aware of this and was very pleasant in dealing with him. Thanks for another great night! Twice in one month - speaks for itself really, we'll be back soon", "date_of_review": "2 December 2015"}
{"review_id": 170, "restaurant_id": -10, "username": "lauraoS4032LL", "date_of_visit": " October 2015", "rating": "2", "title": "Average ", "comment": "Went there with my friends for Halloween but the evening wasn't great too many pushy people awful smell from the toilets and music wasn't very good", "date_of_review": "15 November 2015"}
{"review_id": 171, "restaurant_id": -10, "username": "I7651TMkellyg", "date_of_visit": " June 2015", "rating": "5", "title": "Little oasis", "comment": "What a beautiful, unpretentious little place the roof garden is. A really lovely view, drinks are reasonable and its really relaxed.", "date_of_review": "10 July 2015"}
{"review_id": 172, "restaurant_id": -10, "username": "bernicer96", "date_of_visit": " July 2015", "rating": "5", "title": "Afternoon drinks on rooftop terrace", "comment": "We visited Queen of Hoxton because we had heard great things about the roof terrace. Luckily it was a gorgeous sunny day and the terrace was open (and very busy)! Great atmosphere. There was actually a 'Pongathon' ping pong tournament (very entertaining) taking place which meant less space to sit or stand but it wasn't too much of a problem. I think Queen of Hoxton often has different quirky events going on on certain days so it's work checking their website or Twitter before! There was a bar towards the back of the rooftop area although we only used the downstairs bar. Staff were friendly. Great drinks and reasonably priced. We'll definitely visit again!", "date_of_review": "15 July 2015"}
{"review_id": 173, "restaurant_id": -10, "username": "180Ray", "date_of_visit": " July 2015", "rating": "5", "title": "Great day and night", "comment": "Started on roof terrace around 5pm Finally left downstairs club at 230am. Had a great time. 15 of us all male no crap from any of bouncers which is unusual for this area. Bar staff on roof terrace need more training they are loosing money with people waiting to long due to chaotic nature of service. Too many people spending to much time making time consuming cocktails without any sense of urgency. Apart from this minor annoyance had a great time. I will recommend to others and return myself. Ray", "date_of_review": "19 July 2015"}
{"review_id": 174, "restaurant_id": -10, "username": "Glenda S", "date_of_visit": " July 2015", "rating": "4", "title": "procceco on rooftop", "comment": "After catching our breath going up all the stairs (not that bad) we reached the rooftop terrace which looked like stepping in to cuban beach bar good atmosphere in the heart of shoreditch you need to get there early it you want to get seat as being friday it got really busy by 5.30 great place to chill out in the sunshine the only negative we found is that we fancied some nibble nuts etc to go with out procceco but they didn't have anythng like that to have snack on...............", "date_of_review": "22 July 2015"}
{"review_id": 175, "restaurant_id": -10, "username": "callmetommy", "date_of_visit": " August 2015", "rating": "5", "title": "Thank you", "comment": "I've been at Queen of Hoxton yesterday for my very first time and I'd like to thanks all of because I really spent a lovely night. The place is nice, with different musics and beautiful atmosphere. Special thanks to Lauren (the blonde girl of leafleting) to helped to find the place, Laura at the door for her professional service and for being very helpful and Alessio, the Italian bartender for his amazing customer service and made my friends and I laugh all night long.  I rated you 5 stars, just because you deserve it. I will definitely come back soon. ", "date_of_review": "2 August 2015"}
{"review_id": 176, "restaurant_id": -10, "username": "Ellie S", "date_of_visit": " August 2015", "rating": "1", "title": "Complete rip off!!! Waste of money and utterly dissapointing!", "comment": "We had heard great things about the Queen of Hoxton - but when we went it was a complete and utter disappointment!!! I ordered a 'Cherry Frozen Daiquiri' for £7.50. Not only did I have to pay and then get pointed to wait at a very crowded area whilst everyone else got their drinks immediately - but the drink itself was HORRIFIC. It was basically frozen ice - the colour was so pale that it basically looked like a glass of crushed ice. It was not the Cherry flavour or colour I had expected. The alcohol was extremely weak and basically the whole drink tasted like tap water! For the price of £7.50 I expected much more! I did not expect a very weak, watery drink. I immediately went back to get the attention of the bar staff and I said that it tasted like water. She rudely took it back and chucked it in the bin in a strop. I do not expect such service from any bar staff anywhere especially when the drinks they were selling were of such poor quality. The replacement Cherry Daiquiri I was given was really no better - it was still its pale, watery self. I am thoroughly disappointed. I was going to recommend this place to all of my work colleagues who work so close to the Queen of Hoxton - now I will tell them to beware. A complete waste of £7.50 for a utterly unsatisfactory cocktail!", "date_of_review": "7 August 2015"}
{"review_id": 177, "restaurant_id": -10, "username": "Richard N", "date_of_visit": " August 2015", "rating": "4", "title": "Great cinematic experience", "comment": "I went to watch an open-air cinema showing on the rooftop with a friend in the pouring rain. It was a great atmosphere amongst the backdrop of the city! Rugs, ponchos and state of the art headphones were supplied and even though it was very cold, the surround sound in the system meant I was completely engrossed. Staff were very well informed and friendly and the showing started at it's stated time.", "date_of_review": "28 August 2015"}
{"review_id": 178, "restaurant_id": -10, "username": "chellebella_x", "date_of_visit": " July 2015", "rating": "2", "title": "Rooftop Cinema", "comment": "Me and my sister decided to go and see 'It Follows' at the Queen of Hoxton to experience the rooftop cinema as we had missed it before in the normal cinemas and this has always been the type of thing we would like to try. It was an experience that I personally think could have been done a lot better.  We arrived at about 8.15 as you are told that anyone not there for the cinema will leave the terrace by 8.30, this was fine, however by 8.30 they begin taking the old chairs away and your just left to stand there cluttered in the corner while you wait for them to be finished. This takes about 30 minutes which can seem like quite a while, while your trying to hold popcorn, a blanket, drinks and some malteasers. The set up of the chairs was appalling, firstly I expected a type of deck chair type of seating but instead there was something less comfortable.  Once they had finished setting up, a man shouted 'ok go' so everyone began to make a dash for the chairs like we were in school. They were so close together and if you are small like me this made it incredibly hard to actually see the film without peoples heads been in the way. The girls in front of me were drunk and continued to take snapchats of themselves while watching the film which meant every so often I would just be staring at the back of two heads. Beware if you are a non smoker, we had a man sitting next to us who probably went through about 5 cigarettes while the film was on, he was also becoming quite drunk and fidgety.  Overall it was an experience, it could have been done a lot better. For example, having the chairs set up before anyone for the cinema arrived even if it means closing the terrace for 10/20 minutes. Potentially having less seating, so it was less crammed. Me and my sister both mentioned we would have paid more just for it to be a little more spacious, this would also mean you have more of a chance to actually see the film. I also believe they should have a no phone policy like normal cinemas. I understand its meant to be quite a laidback experience but it would be better for those who actually wanted to see the film, to not hear facebook notifications every 5 minutes and been featured in others snapchats!", "date_of_review": "21 July 2015"}
{"review_id": 179, "restaurant_id": -10, "username": "misspoonamsurani", "date_of_visit": " August 2015", "rating": "5", "title": "Love the Queen! ", "comment": "Went there with a large group and they couldn't have made it easier for me to make sure they were all happy. Alotta love for the guys at QOH!! Great vibe- 3 floors. Beautiful x", "date_of_review": "31 August 2015"}
{"review_id": 180, "restaurant_id": -10, "username": "Katie B", "date_of_visit": " August 2015", "rating": "4", "title": "great roof top bar", "comment": "Great price on drinks especially for london. Great atmosphere very bohemian. Downside was played alot of r n b not really my type of music but worth a visit all the same even just for the rooftop bar.", "date_of_review": "31 August 2015"}
{"review_id": 181, "restaurant_id": -10, "username": "jawawa78", "date_of_visit": " June 2015", "rating": "4", "title": "A Nice Date", "comment": "Watched Predator on the rooftop cinema.  Stuff I liked: -View from the rooftop. -Blanket was given to keep warm. -Staff were very friendly. -Cool interior. -Headset was comfortable/easy to use. Stuff I didn't like: -Uncomfortable seating. -Expensive beer (from around the £4.50 mark). -Was cold, even though I had a jumper/jacket/blanket. 15/06/2015", "date_of_review": "17 June 2015"}
{"review_id": 182, "restaurant_id": -10, "username": "ophelinhap", "date_of_visit": " July 2015", "rating": "3", "title": "Great cocktails", "comment": "The place is nothing much, but the cocktail I tried - Holiday romance, a concoction of coconut and strawberry, with a tad of mint - was really delish.", "date_of_review": "9 July 2015"}
{"review_id": 183, "restaurant_id": -10, "username": "MilankaB", "date_of_visit": " June 2015", "rating": "5", "title": "Exceptional service and really friendly staff!!", "comment": "Saturday nights in Shoreditch are busy and hectic at the best of times - BUT my recent experience at the Queen of Hoxton was absolutely brilliant and the service was so prompt and personal...  I was out with a group of girls, and we were standing on the rooftop bar (great views by the way) when I dropped my pendant from my necklace, which is a family heirloom and ridiculously important. It fell straight through the cracks in the floorboards, and within minutes the manager JOSH was there to help. Not only was he reassuring and incredibly patient (despite the crowds filling the club) but he promised me he and his team would life up all the floorboards in the area to search for it, which they absolutely did. It's all too easy to be short and dismissive in loud and demanding situations like that, but Josh and his team could not have bene more polite, friendly and helpful. It's rare to see that kind of service these days, so if you're after a nice drink, or a dance in a great Shoreditch location then go and enjoy yourselves at Queen of Hoxton! Just watch out for the cracks...", "date_of_review": "24 June 2015"}
{"review_id": 184, "restaurant_id": -10, "username": "unbricabrac", "date_of_visit": " June 2015", "rating": "5", "title": "Crazy Night at the Queen !!", "comment": "I Went to the Queen with some friends. This place is really nice and the cuban atmosphere of the roof is unique (lots of colors, even an half car !!) ! We shared a jug of Pimms and ate a delicious cubanos sandwich!  Then, at 10, we went downstairs, the bar was a bit crowded but the atmosphere was in! Good music/ dj with some old school songs as everybody like. Very good experience for me and my friends, i will recommended this place for sur ! Also, cocktails are delicious ;)", "date_of_review": "8 June 2015"}
{"review_id": 185, "restaurant_id": -10, "username": "michKent", "date_of_visit": " June 2015", "rating": "4", "title": "cool place to visit", "comment": "this was the first place on a afternoon roof top pub crawl that myself and a friend decided to visit.The whole building is very cool and trendy.You need a drink by the time you`ve climbed all the stairs to the roof but it does not disappoint.We went when it had just opened and the crowd there were mixed .We both had a cuban milkshake which was £6 each and really nice .Food smelt good but we didnt eat.The only down side for us is being london we forgot how noisy it could be and it was hard to talk over the sound of emergency services sirens and a annoying helicopter .Its quite a big space but i can imagine it getting very busy.Its worth a visit though.", "date_of_review": "22 June 2015"}
{"review_id": 186, "restaurant_id": -10, "username": "Alexis S", "date_of_visit": " June 2015", "rating": "5", "title": "amazing venue!", "comment": "I went to the queen of Hoxton last week with some friends and had an awesome time! The staff are super friendly and were great in helping us chose one of their house cocktails! Not too expensive for London either! We then went to the rooftop which you have to climb a few sets of stairs but is well worth it when you get to the rooftop! It has a cuban theme and some great views as well as amazing food and some different yet really tasty cuban cocktails! Could definitely recommend this place to anyone!", "date_of_review": "24 June 2015"}
{"review_id": 187, "restaurant_id": -10, "username": "Aimee S", "date_of_visit": " June 2015", "rating": "4", "title": "Fun in the sun!", "comment": "Really lovely rooftop! Particularly in the sun. Not your classic rooftop bar as you cannot see London cause the walls are so high but lots of character and great drinks - recommend the guava rum milkshake! Good prices but slow service. Food is delicious typical bbq meat place.", "date_of_review": "30 June 2015"}
{"review_id": 188, "restaurant_id": -10, "username": "Jsit123", "date_of_visit": " June 2015", "rating": "1", "title": "Bouncers are racist and rude! don't go there", "comment": "We were in the queue to get in and it was getting towards the maximum capacity. They decided to close the queue and bouncer called 'Big Charlie' decided to close the queue right infront of us which was ok but they he decided to let two white people through who were behind us. Was not impressed by his rude explanation and we decided to take our money somewhere else.  Big Charlie should learn how to speak and learn how to do his job properly without be biased!", "date_of_review": "29 June 2015"}
{"review_id": 189, "restaurant_id": -10, "username": "D_West1992", "date_of_visit": " June 2015", "rating": "4", "title": "Cool!", "comment": "Really cool place for a drink, the rooftop bar is especially awesome, though the drinks are a little bit pricey, would definitely recommend!", "date_of_review": "30 June 2015"}
{"review_id": 190, "restaurant_id": -10, "username": "Arnaud-Gandolo", "date_of_visit": " June 2015", "rating": "4", "title": "Rooftop terrace", "comment": "If you are around shoreditch and the sun is shinning, Queen of Hoxton is the place to come for a drink on their rooftop terrace. Some evenings they use it as a cinema with their big screen. Downstairs there is a small club but music is good in a nice atmosphere", "date_of_review": "7 July 2015"}
{"review_id": 191, "restaurant_id": -10, "username": "BronMatt", "date_of_visit": " January 2015", "rating": "1", "title": "filthy toilets - no water - over crowded", "comment": "I have been to the Queen of Hoxton a few times now, the most recent visit will certainly be the last. the queue to get in was long, the staff were rude, once we got in after paying an entrance fee we had to wait to order a drink for ages. The queues for the toilets took even longer, only to discover, overflowing disgusting toilets with no running water! the toilets didn't flush the entire night and the taps had no running water either. We complained twice to bar staff who just acted confused and uninterested and carried on with what they were doing, one even commented, its always like that, im not sure what that is supposed to mean, but im surprised it is allowed operating without running water? There was actually a tap behind the bar that was constantly running over ice and dirty glasses, but then nothing in the toilets.", "date_of_review": "26 January 2015"}
{"review_id": 192, "restaurant_id": -10, "username": "esm_el2015", "date_of_visit": " January 2015", "rating": "4", "title": "A fun, funky work do! ", "comment": "Visited here for the first time for my work do. It's pretty average inside, but we had our own private section of the bar, thankfully, with an entertaining ukelele group. There were no drinks on tap nor anything decent in bottled, except for cider. The cocktails were pricey, but nice, though. Ping Pong table lost its little white ball, so my colleague & I ended up with a little blue ball, which we couldn't even see, so it spoiled the game. At least it was only a £5 deposit. Toilets were clean. Good. We went upstairs for a BBQ, which was delicious, and the mulled spiced rum was worth walking up all those stairs to Mount Doom. Fire pits were so warm. Great for burning marshmallows & lighting cigarettes. Overall, it was a greatly enjoyable night!", "date_of_review": "19 January 2015"}
{"review_id": 193, "restaurant_id": -10, "username": "Yvonne W", "date_of_visit": " January 2015", "rating": "4", "title": "Fun and crazy place, but nice.", "comment": "Recently had a few (too many) drinks here. Great place with good selection and friendly staff. Will return.", "date_of_review": "20 February 2015"}
{"review_id": 194, "restaurant_id": -10, "username": "samb10", "date_of_visit": " January 2015", "rating": "2", "title": "Give it a miss ", "comment": "Went for their promoted Australia Day party and it was a huge let down. The supposed \"ultimate Aussie burger\" took 15 mins to line up for as did every drink, then 10 mins in the BBQ line, then told to come back in 10 mins to collect my tiny dinner roll with an ostrich patty and lettuce nothing else. Also no sign of the countdown that was supposed to be playing. Staff avoided the questions when we asked. Kind of ok vibe but there's way better options. Wouldn't recommend. ", "date_of_review": "26 January 2015"}
{"review_id": 195, "restaurant_id": -10, "username": "WestbourneJ", "date_of_visit": " May 2015", "rating": "1", "title": "Been a while I have been to such a rubbish place", "comment": "The crowd, the place, the bar. All rubbish. You can't take your drink to the roof garden. Don't even get me started on the roof garden. Someone stole my drink (it was 3/4 full). Ordered another beer and it tasted like water. Got it replaced by nagging a lot. The replacement drink made me nearly sick after few sips. Come on people, there are many other places that serve a lot better drinks in the area. And its not like drinks are cheap in this club (compared to the rest of the standard it offers, of course).", "date_of_review": "7 June 2015"}
{"review_id": 196, "restaurant_id": -10, "username": "mamman2015", "date_of_visit": " February 2015", "rating": "4", "title": "Gospeloke at Queen of Hoxton", "comment": "This monthly sing a long night is the best fun Ive had in ages. A full on gospel choir providing backing vocals so even the most tone deaf singer can karaoke away without a care in the world as the fantastic singing troupe behind make everything sound wunderbar. This fun venue is so close to the city but not full of suits. Clean loos. Friendly staff. having read some of the other reviews here they have obviously taken notice of the comments and made some changes.", "date_of_review": "6 March 2015"}
{"review_id": 197, "restaurant_id": -10, "username": "Anda-Anghel", "date_of_visit": " February 2015", "rating": "1", "title": "Extremely rude bouncers", "comment": "It was my friend's bday and 15-20 of us had really bad experience with the bouncers here. They treated everyone like animals. We are not fussy, but these guys really hate their job (except a guy called Sunny I think and a lady that was standing outside).", "date_of_review": "28 March 2015"}
{"review_id": 198, "restaurant_id": -10, "username": "273puic", "date_of_visit": " May 2015", "rating": "1", "title": "Hated every thing about It.", "comment": "Rude staff, Rude security, rammed with people to the point where you can't even walk. They just keep letting more and more people in. Friend came here for her birthday however none of us had a good time due to the rudeness of people and staff so we stayed for an hour and left to go somewhere else. Toilets queue were long, there were no toilet tissue and there were no water in the taps to wash your hands. Would never return even if they paid me.", "date_of_review": "10 May 2015"}
{"review_id": 199, "restaurant_id": -10, "username": "iAntonyH", "date_of_visit": " May 2015", "rating": "1", "title": "Evening ruined by bouncers", "comment": "After travelling a long way to come to the queen of hoxton we was rudely rejected entry by cocky bouncers who said we can't come in as we were a group of six boys and had no girls. They had no interest in listening that we had traveled a long way to come and repeatedly told us to move away. I would not advise anyone to visit somewhere that don't care about you and are able to carry on laughing after they have ruined people's nights.", "date_of_review": "11 May 2015"}
{"review_id": 200, "restaurant_id": -10, "username": "sweet_krisstina", "date_of_visit": " May 2015", "rating": "1", "title": "Humiliated and discriminated against by bouncers", "comment": "What was planned as a fun night for my brother in law's birthday, turned into a night of humiliation because of the bouncers. Together with a group of friends, amongst which my brother in law who was celebrating his bday, we decided to go to Queen of Hoxton as I had been there before and had fun. We were told to go in the queue if we didn't have reservations and as I was the first one in the queue from our group, I showed my I'D, si did my girl friend behind me, after which we were asked how many of us we were, we said 5 and we were told by the bouncer that it was a private event and because we did not have reservations, we couldn't go in. Funny enough he only decided that after having seen our Romanian IT'S. When we challenged him in the kind of \"pruvate\" party, the second bouncer started becoming aggressive with us and told us that we will not be allowed in because I was being aggressive (by asking them why we can't go in when everyone else in the queue was allowed in, even though none of them had reservations) and that they worry if someone says something to me in the bar, I would start a fight ( I barely weight 52 kg and measure 1.65m). A lady who heard the conversation and who had organised the entertainment programme for the night heard the conversation and said to us it wasn't a private party and the bouncers should let us in, then tried to get us in and the bouncers said they will not let us in. The manager came outside as well and instead of first listening to us, being the customers and the ones humiliated in front of everyone there, he had a good 10 min char with the bouncer and came to tell us the same story that the bouncer started: what if we were going to start a fight in there. He finally listened to our story as well and he apologised but instead of letting us in, he went on the other side of the street with the bouncer to \"investigate\".  I have been to many clubs and bars in London and worldwide, but never before I was not let in because of my nationality. It's a shame that this still happens in London in the 21st century. After having read previous reviews of the place, I'm disgusted to see that there have been other people having incidents with the bouncers there and that the management is doing nothing about it. This shows that they don't care about their reputation nor their customers. Never ever I will go back there and I will make sure that every possible website where this place is on will have a copy and paste of my review from here.", "date_of_review": "31 May 2015"}
{"review_id": 201, "restaurant_id": -10, "username": "Disgruntled_amy", "date_of_visit": " January 2015", "rating": "2", "title": "Shame that it was ruined by the staff", "comment": "I find that the queen of hoxton is in general a fun night, but I was disappointed today to find that the staff were rude and obnoxious. A real shame to have what could have been a decent experienice ruined", "date_of_review": "17 January 2015"}
{"review_id": 202, "restaurant_id": -10, "username": "TalithaMM", "date_of_visit": " September 2014", "rating": "4", "title": "Cool nightclub", "comment": "There's a rooftop, which was closed unfortunately except for the smokers...walking a million steps to get there, which was good, cause I stopped smoking that night haha. The bar itself is quite big, there's a downstairs as well, super warm in there, but good music. Same goes for upstairs. Lots of standing tables but also plenty of room to dance. Nice variety in people as well.", "date_of_review": "17 September 2014"}
{"review_id": 203, "restaurant_id": -10, "username": "James M", "date_of_visit": " November 2014", "rating": "1", "title": "Very disappointing - avoid!", "comment": "I went there for a birthday. The music was awful, no acts turned up, the bar service was slow, the roof terrace was closed at random intervals and when we were finally allowed up it was completely cordoned off and dead. Staff were completely unhelpful. Avoid!", "date_of_review": "2 November 2014"}
{"review_id": 204, "restaurant_id": -10, "username": "urvashisretreat", "date_of_visit": " May 2014", "rating": "4", "title": "Badger fest aye aye!", "comment": "Their badger fest was lots of fun with lots of good food and reasonably priced drinks. We loved the Photo Booth and the live band. A Queen indeed!", "date_of_review": "13 November 2014"}
{"review_id": 205, "restaurant_id": -10, "username": "rachelgE2680LP", "date_of_visit": " November 2014", "rating": "4", "title": "Great place! Fun for birthday celebrations!", "comment": "A group of 11 of us visited here on Saturday for my birthday celebrations it a great place with a good atmosphere. The two rooms was great as they provided different music to choose from.  A special mention to one of the doorman (who's name I have not got unfortunately) at the end of the evening he ensured we were able to sort out transport home before asking us to move on so a big thank you to you! Only issue to mention is the bar was very busy, we would have spent a lot more if the queue hadn't been as long!  Overall great place! ", "date_of_review": "10 November 2014"}
{"review_id": 206, "restaurant_id": -10, "username": "AngelUndies", "date_of_visit": " May 2014", "rating": "4", "title": "Tippity top roof top", "comment": "If you find yourself in shoreditch, thinking 'I really want to go camping and have some awesome hot alchomaholic cocktails' your incredibly esoteric taste has now been met. The roof top of the queen of hoxton boasts a Tippity top roof top bar called 'wigwambam' With a massive teepee, open fire pits and the best hot cocktails I've had in a long long time. Best enjoyed with a group of mates, and about £30 of spending cash, you'll have a great time here.  Apart from there being very few places to sit, it's the perfect place to while away a cold winter evening!", "date_of_review": "15 November 2014"}
{"review_id": 207, "restaurant_id": -10, "username": "HAYNESIS", "date_of_visit": " November 2014", "rating": "4", "title": "Very trendy , roof bar = nice tent with BBQ, mid is pop/r n b/down is garagey", "comment": "Went here with friends tonight, cocktails about 8quid, roof bar nice views and heated from bbq inside teppee. downstairs photobooth an ping pong until it turns into dance floor. will go again 3,50 a shot of sambuca, most cocktails 8 the roof is up 8 flights of stairs , as in two then two then two then two so heels may be a bit mean to you. Also upstairs is these little hut toilets, nice enough but as a guy I have never qued for a toilet before we were all shocked. girls laughed", "date_of_review": "21 November 2014"}
{"review_id": 208, "restaurant_id": -10, "username": "KellyH12345678", "date_of_visit": " December 2014", "rating": "1", "title": "Big expectations, very disappointed", "comment": "We'd heard a lot of good things about this place, but were really disappointed. The main rooms were odd - the ground floor the stair-case in the middle, which took up most of the space, making little room to dance. The basement was similar, and very overcrowded, especially when someone threw up on the stairs and no one was allowed up/down. The toilets were horrific, the worst I've ever seen in any bar/ club - just 5 cubicles, none of which had loo-roll, 2 of which were blocked to the point of almost flooding, the whole room smelt like a sewer, and to top it off - NO RUNNING WATER from any of the taps?! Dozens of girls were just peeing and then leaving with dirty, unwashed hands, it was disgusting! Considering we had to pay entry, we should have asked for our money back. The only good thing was the free-lollipops handed out by staff at the end.", "date_of_review": "6 December 2014"}
{"review_id": 209, "restaurant_id": -10, "username": "Fish_chips_gravy", "date_of_visit": " November 2014", "rating": "4", "title": "WigWamBam in Woodlandia - Why not", "comment": "We went for the Woodlandia pop-up and it was great. The rooftop bar was lovely, nice enough food from the open grill (the friendly female chef was run off her feet, poor lass - no one appeared to be helping her). We loved buying marshmallows and roasting them on the fire, and the hot festive cocktails -eggsnog (a house eggnog) hot toddy etc were yummy.  The set up was great, bark on the floor, log seats, open fires, all giving it a cosy Alpine feel. So why only 4/5? There are just a few bits that didn't fit quite right - we had to go to three different places to get our stuff - one bar for cold drinks, one for hot drinks and one for food - meant that we spent most of our time hopping from bar to bar before we could relax.  The staff were friendly but a bit pre-occupied - with their phones, gregarious 'mwah-mwah darling' regulars or whatever came next.  Overall, a really nice effort, and I will definitely recommend this to any of my mates heading down south this December.", "date_of_review": "5 December 2014"}
{"review_id": 210, "restaurant_id": -10, "username": "bleepblink", "date_of_visit": " December 2014", "rating": "5", "title": "It's all about the roof garden", "comment": "This place has one major asset and that's the roof garden, which is set amongst the gleaming office buildings in the city. The roof garden has the atmosphere and decor of a music festival and in the winter there's a large wigwam which provides a cosy and surreal drinking den. I would definitely recommend visiting the Queen of Hoxton but only for it's quirky and unique rooftop hideaway.", "date_of_review": "5 January 2015"}
{"review_id": 211, "restaurant_id": -10, "username": "Dave N", "date_of_visit": " September 2014", "rating": "4", "title": "Cool rooftop", "comment": "went here with a group of friends on a lovely sunny Sunday afternoon. Looks pretty shabby from the outside but the climb to the roof terrace is worth it. The japanese beer was pretty good and the guy behind the bar was brilliant, Ginger guy sorry didnt get his name, very helpful and knowledgeable. you want to sit in the sun on a roof and drink japanese beer go to the queen of hoxton.", "date_of_review": "8 September 2014"}
{"review_id": 212, "restaurant_id": -10, "username": "Carolyn F", "date_of_visit": " July 2014", "rating": "4", "title": "Hip and Quirky rooftop bar", "comment": "Have been to this rooftop bar a few times, the rooftop has a very hip and quirky vibe to it, cute decoration and setting, with skyscrappers in the background. Drinks and food are resonable bar prices.", "date_of_review": "3 July 2014"}
{"review_id": 213, "restaurant_id": -10, "username": "Mills_AU", "date_of_visit": " June 2014", "rating": "2", "title": "Compares badly to other venues in this area", "comment": "Visiting London in June, the rooftop here was suggested to me by a friend as a venue for my birthday drinks. It's a rooftop alright but that is about the only positive thing I could say about it. 4-5 flights of stairs to the top, a limited number of bathrooms, tiny crowded bar, absolutely no view, and seemed to attract A LOT of smokers. We went to the bar downstairs after a while and there's not much to write about that experience. Average. Shoreditch has a lot better. I wouldn't bother with the Queen of Hoxton.", "date_of_review": "22 June 2014"}
{"review_id": 214, "restaurant_id": -10, "username": "Brian S", "date_of_visit": " July 2014", "rating": "3", "title": "Ad-hox?", "comment": "I only wandered into this club because I was invited to an event there. The basement was where I spent most of my time, the dance floor was somewhat epic, besides the herds of hipsters grazing on their G&Ts. The place is called the 'Queen of Hoxton' but it didn't even serve Hoxton Gin, which is the best gin in London. The accessibility of the bar was suspect and we were charged a cover of 7 pounds which was outrageous considering how empty the place was. Yet, the laser show on the bottom floor and the DJ were an excellent synesthetic experience. All in all, not worth seven pounds, especially without decent gin and in the throes of hipster mating season nontheless.", "date_of_review": "10 July 2014"}
{"review_id": 215, "restaurant_id": -10, "username": "MatteoDonn", "date_of_visit": " July 2014", "rating": "3", "title": "Hipster?", "comment": "a cocktail £12 (double vodka and lemonade= £16)and £5 a beer ( they serve only Japanese beer to pretend to be alternative). I don't like this place at all. 6 floors without lift to arrive on a roof top that serve only Asahi beer. Ridiculous isn't it?", "date_of_review": "9 July 2014"}
{"review_id": 216, "restaurant_id": -10, "username": "charlie_994", "date_of_visit": " July 2014", "rating": "3", "title": "Rooftop is great in summer", "comment": "nice place to have a few drinks on the roof after work. Unfortunately, the queues get hideously long for drinks, and when i was there the draught beer (asahi) was stopped as the taps were not working. bit of a let down. food looked good from the bbq, as did the cocktails.", "date_of_review": "18 July 2014"}
{"review_id": 217, "restaurant_id": -10, "username": "DomDani", "date_of_visit": " July 2014", "rating": "3", "title": "Slow service of warm drinks", "comment": "Headed here on a glorious Friday afternoon, getting in around 5:30, by which time the roof was already pretty full. It only got fuller... and smokier. Drinks service on the roof was very slow and the only beer offering (with the Asahi taps being out of commission) was warm steel bottles of Heineken... which we ended up drinking out of plastic cups with ice. We opted to have our second drink downstairs in the aircon where it was also starting to fill up as there was now a queue to get upstairs. Unfortunately drinks are also served in plastic down here.  Its clearly nailed the setting and this is what attracts the crowds of 20's and 30's and it will continue to pull them in, but, unless we head here for one of the movie nights, we're unlikely to come back", "date_of_review": "20 July 2014"}
{"review_id": 218, "restaurant_id": -10, "username": "sam186460", "date_of_visit": " July 2014", "rating": "1", "title": "Horrible. Go eles where", "comment": "My cider glass was filthy. Lip stick all over the edge with bit of fruit dryed to the glass. When I asked to replace it he just poured my cider into another glass then toped my cider with beer! Staff need better training. Also they placed my buger ontop of my coleslaw making my burger bun sogie! ", "date_of_review": "9 August 2014"}
{"review_id": 219, "restaurant_id": -10, "username": "303Anna", "date_of_visit": " August 2014", "rating": "1", "title": "never go there !", "comment": "Very bad service !!! The staff is rude ! We went there to go to the rooftop, paid 5£ each to go inside a place with bad music and really expensive drinks. And we were finally told that the rooftop was closed! No refund of course!  Don't waste your money there!", "date_of_review": "24 August 2014"}
{"review_id": 220, "restaurant_id": -10, "username": "worldtravela69", "date_of_visit": " July 2014", "rating": "4", "title": "get there early for a decent spot on the roof", "comment": "on a sunny day its a fun place to be but gets crowded quickly. nothing special in terms of drinks so no reason to stay too long either", "date_of_review": "31 July 2014"}
{"review_id": 221, "restaurant_id": -10, "username": "CeliaMartin2014", "date_of_visit": " June 2014", "rating": "1", "title": "Paid to be kicked out", "comment": "Bad service - we had to pay to get in - when we specifically said we wanted to go to the rooftodp and only after paying we were advised we couldn't go up. No refund because we reclaimed about the bad service - that's a RIP OFF", "date_of_review": "20 June 2014"}
{"review_id": 222, "restaurant_id": -10, "username": "discododo", "date_of_visit": " September 2013", "rating": "1", "title": "Kicked out by a touchy matthew horne", "comment": "I was out for a friends 23rd and it was shaping up to be a good night. Whilst getting a drink at the ground floor bar, i saw this 'DJ' madly twiddling nobs on the mixer channel which was at zero volume. Being a DJ myself i was intrigued, so i watched him for a while. The guy did not even attempt to mix. There was a track running and he literally just played with idle controls whilst dancing about like a moron. I've never seen such a pretentious display of fakery in my life. I've seen some terrible DJ's, but none as bad as this.  I decided to talk to him. A few times i pointed out that he was using controls on a silent channel - no response. I then said he was a crap DJ. When he looked up, i realised it was Matt Horne (the guy from gavin and stacey). I was a little starstruck and stopped what i was doing to go tell my friends. As i pointed him out he was reeling of some trap to the bouncers about how i had assaulted him over the decks. They then grabbed me and took me out. I asked the bouncer why i'd been kicked out, i was told i 'shouldn't have pushed the DJ'. I paid £5 to get into that club and my night was over because Gavin can't accept the fact that he's a poser. The whole situation was hilarious. Seriously matt - stop kidding yourself and stick to the acting & whilst you're at it, don't ruin peoples evenings unnecessarily. Grow up. You're not a princess, and you're certainly not a DJ.", "date_of_review": "22 September 2013"}
{"review_id": 223, "restaurant_id": -10, "username": "Bobbyboysabout", "date_of_visit": " September 2013", "rating": "2", "title": "Ain't no Queen.. ", "comment": "My friend and I decided that to finish out dual birthday eve we would try the queen of Hoxton. Silly idea considering we had never been but we had seen some images and thought it looked worth a go.  The bar was ok. But avoid the cocktail menu as most the ones we tried were super badly done.  Bar staff were nice but the door men are way ott. They wouldn't let us smoke outside on the ground floor. So we had to keep going up insane amounts of staircases to reach the roof terrace, that whilst was cool in ok weather it was pouring with rain plus you couldn't take a drink with you and they had closed the bar up there. Because of this our mate tried to smoke outside downstairs and when she asked the doormen if that was ok and she'd be quick she got kicked out and wasn't even allowed back in to tell us and get her stuff. By the time we realised this, as we thought she was on the roof terrace, she'd gone home!! Total joke!  The basement music was utter rubbish and you could tell this by the lack of people down there. The band was a bad choice. Ground floor music started out ok until a dj came on and continually played the same kinda tunes over and over that you could tell only appealed to the 'spring breakers' in the room. Shame they didn't get the basement going with better tunes.  The crowd is young, and full of bad drunks, pretentious and fixated on trying to be cool but forgetting to have fun.  The toilets are just beyond disgusting with no one looking after them. Literally horrific!!  I'm moaning as most of the QoH is just not my bag, but a little more cleanliness, some common sense from the DJs (check your crowd), another room with alternative music to the main room and lighter touch doormen would dramatically better this place. Oh and ditch the cocktails as you can't make them!  Not for me... ", "date_of_review": "3 November 2013"}
{"review_id": 224, "restaurant_id": -10, "username": "CatherineF1987", "date_of_visit": " October 2013", "rating": "3", "title": "Good and bad?", "comment": "Good music on a Friday night, sometimes on a Saturday too if the DJ is alright. But it gets too hot and crowded later on, is ridiculously overpriced, and as others have said, the staff can be rude (though not all).  The upstairs bar shuts far too early. The system for the smoking area after the upstairs bar has shut is unworkable - I've had my drinks stolen numerous times because they won't let you go up with a drink.  Bouncers tried to block 2 of my friends re-entering the last time we were there, just because they went out front to make a phone call - they had told one of the bouncers what they were doing. So yes, signal can be poor in there, you have been warned. I'd probably give QoH 2 stars, but I've had some good nights in there merely due to good music/DJ and excellent company. PS. if pretentious music and alt bands are your thing, try the downstairs bar.", "date_of_review": "26 November 2013"}
{"review_id": 225, "restaurant_id": -10, "username": "bradp13", "date_of_visit": " December 2013", "rating": "1", "title": "Unprofessional staff, incredibly rude manager", "comment": "We got tickets for Queen of Hoxton for New Year and overall I actually had quite a good night. Unfortunately, the rude and unprofessional staff ruined it for me. At 11.30, we decided to get a few drinks in ready to toast in the new year at midnight, knowing the bar would be busy. However, we waited for half an hour to get served. Now I appreciate how busy it was, but here was no order at the bar to who was being served; time and again we were ignored by the staff who all crammed at one end of the bar, serving others before us who had clearly only been at the bar a matter of minutes. It was completely random who they picked, and I found this very frustrating. However, we got served just at midnight which, although annoyed at the wait, was simply relieved to get a drink for midnight. Yet halfway through our order, she demanded we pay and wouldn't get the rest of the drinks we'd asked for, saying the bar was shut at midnight for 15 minutes. I was incredibly annoyed about this; how unbelievably unprofessional! I understand bar staff should get a drink at midnight - I have worked New Year's Eve in a bar and didn't get a chance to toast at midnight which was disappointing - but to just cut us off half way through and then walk away was incredibly rude. When I tried to get any other members to complain, they just pointed to the sign that the bar was shut and walked away. Eventually I managed to get hold of the manager and tell him that we shouldn't have been cut off half way through - to which he simply shrugged and said 'oh well' before walking off. He clearly did not care at all. So much for 'the customer is always right'. I worked in several bars across 5 years, so above all common sense, to be dismissed and ignored in such a way was unprofessional, rude and disrespectful. Do not go here until they have a change of manager who actually knows how to treat the customers properly.", "date_of_review": "2 March 2014"}
{"review_id": 226, "restaurant_id": -10, "username": "BriFantana", "date_of_visit": " January 2014", "rating": "4", "title": "Rooftop bar makes this place!", "comment": "First visit to the Queen of Hoxton. We came on a friday evening just as the work crowd was turning up and stayed for a few hours. The bar seemed pretty average but we settled in round a fire pit up on the rooftop. The rooftop is fantastic, we said we'd have to come back in the summer as I can image that's when it really comes alive. Until the next visit!", "date_of_review": "29 January 2014"}
{"review_id": 227, "restaurant_id": -10, "username": "VivaMiVida", "date_of_visit": " May 2014", "rating": "2", "title": "No service?", "comment": "We went for an after work drink on a Tuesday but didn't get to sample any as there was such bad service. We waited at the bar for 20 minutes (it was particually busy) but no one bothered to serve us. As we got up to leave, someone finally noticed but made no effort to get us to stay. It's got a nice look about the place but can't justify it's prices. It's a shame, I was looking forward to seeing ever the fuss was about. Up your game guys. ", "date_of_review": "20 May 2014"}
{"review_id": 228, "restaurant_id": -10, "username": "Cherise S", "date_of_visit": " May 2014", "rating": "3", "title": "Very average, shame about the rooftop being closed after 10pm.", "comment": "Came here yesterday, so a Friday night, heard some great things about the place but it wasn't all that. Wouldn't really recommend going there if you're looking for a clubbing/bar night out. Girls - What to wear: My friends and I arrived at the venue at maybe 11pm-ish, and everyone was very casual. Some people still in their work clothes, shirts and skirts, sandals, ballet pumps, others in jeans and tops. Do not bother wearing dresses/skirts/embellished tops or heels to this venue, it's VERY casual. Vans/Converses are definitely appropriate in case anyone is wondering.  Music: If you're into trancy/house music then downstairs is perfect for you. Lots of strobe lights and all that. The music upstairs is a mixture of current, old school r&b, hip hop but for me personally, it wasn't a consistent stream of good music, enough to keep me dancing all night. And I couldn't really hear what songs were playing sometimes, way too crowded.  PROS: 1. The cloakroom is £1 and bags are free. 2. I ordered a single Vodka orange and it was only £4.50 3. There's a photobooth and for £2 you get 4 photos, printed & e-mailed. This was great! There's also a foosball table but the ball was missing and a pinball machine but I think it was broken or something because no one was using it.  4. There's air-conditioning on the 1st floor, this was so handy as its a very crowded venue. 5. On the right hand side of the venue there is quite a few seats and tables, this again was handy as the dancing area was really crowded. CONS: 1. The girls bathroom was absolutely baking and extremely claustrophobic, only 4 toilets and no toilet paper in all but one cubicle.  2. The music was a little disappointing, a weird combination all mixed together that didn't really flow.  3. The rooftop - the picnic tables, the slushie bar and the swings were all cordoned off. We were told by a member of staff that their license only allows them to have those facilities open from 12pm-10pm. So remember, if you're coming for a night out at QOH, you can't use any of those things. Also you need to climb about 6 flights of stairs to get there. Very disappointing but I understand that's not the venue's fault.  Overall, I wouldn't return to Queen of Hoxton, the music wasn't great and the atmosphere wasn't right, but it all depends on your personal taste. The fact that all the quirky things about the rooftop were cordoned off was really disappointing, after seeing the pictures on here we were really looking forward to it. We didn't have a problem with the staff, they weren't overtly nice but they weren't rude either. The crowd was mid to late 20s, some right doucge bag guys there but again that's not the venues fault. Such a shame really because on paper it sounds like a wicked place, with all its quirky features, but it really isn't all that.", "date_of_review": "31 May 2014"}
{"review_id": 229, "restaurant_id": -10, "username": "Resort422635", "date_of_visit": " May 2014", "rating": "1", "title": "I have never been treated so badly by staff in all my life. ", "comment": "Was there to celebrate a birthday, I'm standing at the bar waiting to order drinks, when one of the glorified waiters comes up to me and says \"stay away from here, you're too close to these people.\" Then goes to the women next to me and says \"watch your bags\" all this while I have my Amex platinum card in hand wearing a £3000 watch!!!!! What a great place. Always good to treat your paying customers as thieves and publicly embarrass them!!", "date_of_review": "20 June 2014"}
{"review_id": 230, "restaurant_id": -10, "username": "Alison W", "date_of_visit": " August 2013", "rating": "3", "title": "Good in the Summer", "comment": "Brilliant rooftop bar for drinks in the summer or a sunny day but be warned if you are not in the best of shape or have trouble climbing stairs the first time you venture to the roof feels like an endless journey. The selection of drinks on the roof is limited so if your normal is something unusual, ask the bartender downstairs on the ground floor before heading up. Food is fairly basic but well made, after the roof closes which is not really that late in the evening the lower floor can get incredibly packed and a bit of a nightmare to get a drink and the service seems to just take a rapid decline. If Queen of Hox didn't have the rooftop I’d have given it a poor rating, its too expensive for what it is and doesn't really deliver for me.", "date_of_review": "3 December 2013"}
{"review_id": 231, "restaurant_id": -10, "username": "Fatsjxsq", "date_of_visit": " August 2013", "rating": "4", "title": "Good rooftop movie ambience, average good and drinks.", "comment": "Great movie night out at the rooftop. Wireless headsets, good crowd. Blankets provided. Food and drinks are only average though. Locarion is very near liverpool st station. ", "date_of_review": "7 August 2013"}
{"review_id": 232, "restaurant_id": -10, "username": "Anthony P", "date_of_visit": " February 2013", "rating": "4", "title": "Hipster, Fun, Awesome Roof Space", "comment": "Quick note to all, I would not say that Queen of Hoxton is a restaurant. What it is is an alternative bar that plays good music, hosts pretty big club nights on Friday and Saturday nights and has a really cool roofspace. Whether it's the 'WigWamBam' (on til end of March!) which consists of an enormous tipi, very cosy, with warm drinks and campfires, the Rooftop Cinema or it's Summer Rooftop Garden, Queen of Hoxton will not fail to entertain. For a more thorough review, check out: http://anthonypulsford.com/2013/02/21/queen-of-hoxton-home-of-hipster-royalty/", "date_of_review": "19 March 2013"}
{"review_id": 233, "restaurant_id": -10, "username": "rkjlondon", "date_of_visit": " May 2013", "rating": "3", "title": "Rooftop cinema...what's the point...?", "comment": "Booked some seats for the rooftop cinema...we had food and drinks first and that was good...the burgers were pretty tasty...however, at about 8:30 all non cinema ticket holders are asked to leave...you then have to huddle in a corner whilst they bring out all the seating... They give you cordless headphones...these work well...and there are blankets...there is a canopy overhead...just in case it rains...it is sort of fun but it is not really sociable...I'm glad I went...however, it is unlikely that I will be returning...I'll go to a proper cinema that is warm and where I can take my coat off...", "date_of_review": "27 May 2013"}
{"review_id": 234, "restaurant_id": -10, "username": "Crazy_Jim_83", "date_of_visit": " May 2013", "rating": "2", "title": "errr 'trendy'", "comment": "pffffffff, bar downstairs, lots of steps to get to roof bar. Once there, its a decent space in the summer with a couple of bars to get drinks from and some BBQ food. Prepare for queues. They do live music of different genres on Friday and Saturday nights and if you're lucky you may find something good, but there's also a lot of dross played there.  This all misses the point though, because its not about the offering, the space and the good times, its one of those places to be seen. Full of trendy kinds who in their desperate attempts to look unique, all end up looking alike. I can't really explain it beyond saying it has a huge middle class projection of 'cool' but if you scrape beneath the surface its just comfortbaly vaccuous. So the actual club trys hard and is ok, there's some originality to what is on show but the superficiality of its patrons is really yuk, dunno how else to explain it. Remember to dress trendy to really make an impact.....", "date_of_review": "27 May 2013"}
{"review_id": 235, "restaurant_id": -10, "username": "zoe A", "date_of_visit": " June 2013", "rating": "1", "title": "Awful", "comment": "I just have to comment on how rude the staff are at this venue. Walk in to what I can only describe as a youth club for adults. All drinks served in plastic glasses, like they don't trust their customers. The bouncers are all over the place and even after a trek to the roof garden, which is a lot better than the bar area, bouncers still surly. You are treated like an annoying teenager by them (regardless of your age) and I am knocking on a bit! At 10pm your all told you have to leave the roof garden - even on a Friday night and then escorted like cattle downstairs. But not even into the main bar but down into the cellar - I felt like I was at Auschwitz and something untoward was going to happen to us all down there! But no they obviously still wanted our custom so shepherded us into this dingy bar area. Sorry my first route was to find the exit and escape! I will most certainly not be returning to this awful bar as the atmosphere and service of the staff was awful! Don't go unless you would like to be treated in this way! Not me!", "date_of_review": "22 June 2013"}
{"review_id": 236, "restaurant_id": -10, "username": "SiobhanSE18", "date_of_visit": " July 2013", "rating": "2", "title": "Cheaper to rent a movie", "comment": "First time at the Queen of Hoxton, partner and I came to see a film on the roof terrace, was looking forward to having an ice-cream float, as advertised on their website and on the board on the terrace, i was advised these are only served on a tuesday ???, got the impression the bar staff coudn't be bothered, half way through the film I was feeling a little peckish both the popcorn stand and the bbq had now closed. Not the greatest of nights out.", "date_of_review": "2 July 2013"}
{"review_id": 237, "restaurant_id": -10, "username": "Natt_C12", "date_of_visit": " July 2013", "rating": "3", "title": "The rooftop terrace is worth it", "comment": "While the bar downstairs is not great, the rooftop terrace is wonderful on summer days/evenings. It's nicely arrange and offers drinks at reasonable prices (for London), although I wouldn't recommend the BBQ. Both the meat and vegetarian burgers were average and pretty pricey.  Still, a nice and breezy open space near the City. The different workshops on offer can also be quite entertaining (I tried the Origami making one and was not disappointed).", "date_of_review": "11 July 2013"}
{"review_id": 238, "restaurant_id": -10, "username": "Lbrighton86", "date_of_visit": " August 2013", "rating": "1", "title": "Awful customer service and brutality of security guards", "comment": "Last night I visited the Queen of Hoxton for a friends birthday. The bar and club wasn't too bad and we were enjoying a night out in the trendy area of East London. However, several things hapenned at the end of the night which ruined the night for us; Firstly, we were unable to finish the drinks we had brought at 1.55 am (bairmad did not tell us bar was shutting at 2am) and promtly at 2am we were told by the bouncers we had to leave and couldn't finish our drinks. However, the worst thing about the night was the brutality which I experienced first hand from the bouncers. I was assulted by one of the bouncers who used extreme physical force to steal my camera from me because I had filmed them asssulting another punter and pushing them down a steep staircase. I had to wait until the police arrived to retrieve my camera back. The bouncers are aggressive thugs and it ruined the atmosphere.  A very dissapointing end to a friends birthday and definitely not somewhere we will be visiting again (particularly as I later learned from the police this is a regular occurence with the bouncers at this bar).", "date_of_review": "4 August 2013"}
{"review_id": 239, "restaurant_id": -10, "username": "1Nice_GuyUK", "date_of_visit": " July 2012", "rating": "4", "title": "Excellent Place to Drink on a Hot Sunny Day in London", "comment": "I've just visited this pub for the first time, to attend a leaving 'do' for a work colleague. I was favourably impressed with this place. The staff were professional, friendly, and best of all, they have a fantastic roof terrace, making it the perfect place to go for a beverage on a hot, sunny London afternoon.", "date_of_review": "24 July 2012"}
{"review_id": 240, "restaurant_id": -10, "username": "kkrez", "date_of_visit": " August 2013", "rating": "4", "title": "Good Atmosphere", "comment": "This is a perfect bar for young people (students and young professionals). The vibe was awesome, the drinks were dirt cheap and delicious, there was a \"clubbing\" floor and a \"bar\" floor and there was an awesome smoking rooftop. Definitely make a stop here on a night out. You're guaranteed a good time!", "date_of_review": "4 August 2013"}
{"review_id": 241, "restaurant_id": -10, "username": "AndrewCNewbury", "date_of_visit": " November 2012", "rating": "4", "title": "Cool roof terrace", "comment": "Go all the way up the flights of stairs and out onto the roof, where the wigwam bar is. They have transformed the roof terrace to a really cool venue with food on open BBQ and mulled drinks available (try the monkey shoulder and hot fudge!!!). Great place to while away the hours. Just be carefully on he stairs on he way down...", "date_of_review": "20 January 2013"}
{"review_id": 242, "restaurant_id": -10, "username": "dolcementesprucida", "date_of_visit": " August 2012", "rating": "4", "title": "Nice Place", "comment": "Nice roof terrace. Book well in advance if you want to join the cinema on the weekdays. They have sold out 20 days in advance!", "date_of_review": "20 August 2012"}
{"review_id": 243, "restaurant_id": -10, "username": "AmieeC_07", "date_of_visit": " August 2012", "rating": "4", "title": "Great Little Venue", "comment": "Came tonight for a show. The venue was fantastic. Very lively, even upstairs in the main area was very lively. Downer would be the bartender was quite rude to me when my card wasn't responding in the machine, she was also very rough when sliding it through the strip reader so no wonder why it didn't work.  But as for live music venue it was great, very glad I went .", "date_of_review": "11 September 2012"}
{"review_id": 244, "restaurant_id": -10, "username": "mooreao", "date_of_visit": " July 2013", "rating": "4", "title": "Awesome rooftop...", "comment": "We went to the Queen of Hoxton for some birthday drinks on a warm, sunny Saturday. We arrived at 2pm, pretty close to when they opened and they were already pretty busy. There is a lot of seating, so getting enough chairs and space for about 15 people wasn't a problem. There isn't much shade at all except by the BBQ and bar, and only enough room for one small table. However, since the sun hardly ever shines in London, this isn't too big of a problem.  Drink prices weren't too bad and the wait wasn't bad at first. The bar is very small and only two bar staff were working so once it got busy, the wait time for a drink was around 15 minutes. The BBQ was a bit pricey and the burger was average at best. Apparently friends who ordered the chicken, thought it was pretty good.  Later in the afternoon it started to rain and since there was no cover on the roof, most people moved downstairs, which is not great. If you are coming to the Queen of Hoxton, come on a sunny day and hit the roof terrace!  All in all, I rate it a very good, because we did have a good time on the roof terrace and would go back on more sunny days.", "date_of_review": "31 July 2013"}
{"review_id": 245, "restaurant_id": -10, "username": "nicolecostello", "date_of_visit": " August 2012", "rating": "4", "title": "great roof terrace!", "comment": "Watched 'when harry met sally' a week ago on the roof terrace & absolutely loved it! It's a pity this is only a summer venue and a pity the rainy weather in the UK affects the showings because it was just magical. Fairy lights & flags, cute deck chairs, great outdoor BBQ food, good drinks, great crowd - all in all a very enjoyable evening. I'll be booking early next year!", "date_of_review": "28 August 2012"}
{"review_id": 246, "restaurant_id": -10, "username": "mrapr", "date_of_visit": " September 2012", "rating": "5", "title": "Nice little rooftop cinema.", "comment": "having reviewed over 26 different rooftop Cinemas, I can say with authority that this was one of the best. Shame it was sooo damn cold. ", "date_of_review": "20 September 2012"}
{"review_id": 247, "restaurant_id": -10, "username": "HelenaHD", "date_of_visit": " October 2012", "rating": "3", "title": "Expensive beers", "comment": "This bar has a wonderful reputation and I must say I was not that impressed when I went on Halloween FRIDAY night. Firstly the 5 pound entry fee, then 9 pounds for 2 beers (no beers on tap). The floor is so dirty and sticky my shoes got stuck on the floor. The bouncers are a bit to heavy handed, even patting down my male friends. I was outside smoking a hand rolled cigarette I was accused of smoking a joint and told I was not allowed back in. When I pointed out it was a cigarette, he would not believe me and I had to let him smell it and look at my tobacco and have a long discussion about letting me back in, no apology. Inside the atmosphere was very merry, but the DJ was changing from 80's, to current club hits to rock etc very mix mash. Perhaps next time I should check out the movie night on the terrace.", "date_of_review": "27 October 2012"}
{"review_id": 248, "restaurant_id": -10, "username": "CorinneM828", "date_of_visit": " December 2012", "rating": "2", "title": "Staff did not treat our party well", "comment": "We had a private party on the rooftop of this bar and I found the staff incredibly rude, especially considering the money they must have got out of us! One of the \"bouncers\" nearly trapped my arm in the fire door leading to the stairs up to our party as he tried to slam it on my face. He did not even give me a chance to show him my wristband to show that I was allowed up there! This was really dangerous and extremely rude. The cloakroom topped my night off. I have never been to such a disorganised cloakroom in my life. The hatch was so small that only one person could be seen at a time and the \"queue\" blocked off the whole hallway leading to the toilets. As there were only two members of staff in the cloakroom, we all ended up waiting for about half an hour for our coats when we just wanted to get out of the place!", "date_of_review": "18 December 2012"}
{"review_id": 249, "restaurant_id": -10, "username": "545MichaelB", "date_of_visit": null, "rating": "4", "title": "Paradox", "comment": "Downstairs doesn't look up to much and the stairs up to the wigwam feel like an NCP car park, but what a transformation when you walk through the door! Into the wigwam and out onto the roof terrace to the \"beach bar\" is great. Will definitely go back.", "date_of_review": "1 April 2012"}
