{"review_id": 99992, "restaurant_id": 294, "username": "MHodge_13", "date_of_visit": " August 2020", "rating": "1", "title": "Sadly disappointed with service", "comment": "I’ve been to Gezi Park numerous times and I really like the food. So I took my friend there this week to have the cold meze after a long walk. We sat outside due to the social distancing and ordered our food. The service so far seemed ok and nothing to complain about. As we began eating the various dishes I noticed that the hummus tasted funny and I asked my friend what she thought. She said it tasted ‘fizzy’ which meant it was ‘old’ and I agreed. We didn’t eat any more of it and called the waiter over and told him. He said ‘ok’ and disappeared inside to the restaurant- we thought to get fresh hummus. He didn’t return. So then I called the waitress over and told her the same thing. She said ‘ok I tell’ and she disappeared off inside. She didn’t come back either. We soon finished the rest of the food and asked for the bill assuming that the complaint re the hummus would be reflected in the total of the bill. She brought the bill and said nothing about the hummus and there was no reduction in the cost. She went to get the card machine and when she returned I asked her to take off the service charge because we couldn’t eat the hummus. She said ‘service charge is automatic’ so I said ‘as we couldn’t eat the hummus and you didn’t replace Or apologise for it we won’t be paying for it’ She was very hostile and grabbed my friends card from her Hand and muttered something while shoving it into the machine. We were really taken aback. My friend asked for the receipt and the waitress literally threw it in front of her on the table!  As we got up to leave the waitress whipped the remaining dishes off the table and gave us the dirtiest looks almost throwing us out. My friend has the receipt but to be honest we didn’t even check if she took off a couple of Quid (service charge £2.30) as we were so relieved just to leave at that point.  I emailed the restaurant later explaining how surprised we were at this hostile treatment and asking for a manager to contact me but had no reply whatsoever.  I’d like to think that if a manager knew that one of his staff treated customers in such a manner they would be reprimanded as it shouldn’t bring the reputation of the whole business into disrepute  However I have no evidence that anyone bothered to pick up on the issues.  So with that in mind - much as I like the food - I won’t be returning", "date_of_review": "23 August 2020"}
{"review_id": 99993, "restaurant_id": 294, "username": "nicolerF7738ZE", "date_of_visit": " August 2020", "rating": "4", "title": "Perfect Birthday Take Away!", "comment": "Picked up a take away, staff were friendly and let us sit inside to wait for it. I had a lovely vegetarian kebab, the vegetables were nice and chunky and the sauce was gorgeous!, The birthday boy had a chicken and lamb Shish kebab and wasn’t disappointed. Both meals came with salad, rice and bread. Perfect meal.", "date_of_review": "28 August 2020"}
{"review_id": 99994, "restaurant_id": 294, "username": "John C", "date_of_visit": " July 2020", "rating": "5", "title": "Lovely Friday night ", "comment": "Enjoyed a lovely meal, excellent value and very good quality. well presented, nice service and a lively buzz around the restaurant ", "date_of_review": "31 July 2020"}
{"review_id": 99995, "restaurant_id": 294, "username": "brw4444", "date_of_visit": " July 2020", "rating": "4", "title": "been here 5 or 6 times . . .", "comment": "I will say this is not exactly cheap but we have never had a bad meal in here. We generally always visit on the off chance when passing by. It is mostly always busy, if you are going after 7 you definitely need to book. We visited at 6 on Saturday and went for the fish option, salmon and sea bass, it really was so lovely. They did not rush us out either. Service is added to your bill, I think they should bring the change no matter how small just out of courtesy but overall this is worth visiting.", "date_of_review": "16 July 2020"}
{"review_id": 99996, "restaurant_id": 294, "username": "Victoria W", "date_of_visit": " July 2020", "rating": "5", "title": "Fantastic food & fantastic service", "comment": "We had an amazing dinner here, the service was outstanding and the food was melt in the mouth!! Couldnt have asked for better size portions. The waiting staff were on point and never let us have an empty glass, very attentive and friendly. Serving the bill in the little box was such a lovely touch!! Will certainly be going back.", "date_of_review": "12 July 2020"}
{"review_id": 99997, "restaurant_id": 294, "username": "B3139JLlorrainec", "date_of_visit": " July 2020", "rating": "5", "title": "SATURDAY NIGHT MEAL", "comment": "Enjoyed a lovely meal, top quality, Good menu choice, well presented authentic cuisine, very nice service, lovely ambience well worth a visit", "date_of_review": "19 July 2020"}
{"review_id": 99998, "restaurant_id": 294, "username": "junehooke", "date_of_visit": " September 2020", "rating": "2", "title": "Not Covid-19 Ready", "comment": "If you have any anxiety to covid 19, this is not the restaurant for you as this restaurant is not complying to government rules. Non of the waiting staff are wearing face masks. Most customers are coming into the restaurant with no face masks on, whilst being taken to their tables.  Whilst we where sat at our pre booked table, another 2 people came in to eat without a booking. No contact details where taken from them. I was very surprised the waitress allowed them to chose the table to sit at. They chose a table next to us, which they had to squeeze past behind us, whist not wearing a face covering. This table did not allow the right amount of distance from our table, which caused me and my husband to have to move up along our table, whilst we were eating. We also noticed seated areas where not sanitised after use. I spoke to a member of staff regards these situations, which they knew they were breaking the rules but felt they could not work with following the rules. My husband and I , paid for the food we ate, then left the restaurant as we did not feel safe.  Shame the starter we had we enjoyed. Would I go back again, no. The food maybe lovely but the restaurant has no ambience or style that add to diners enjoyment.", "date_of_review": "1 September 2020"}
{"review_id": 99999, "restaurant_id": 294, "username": "P9029LLmattw", "date_of_visit": " August 2020", "rating": "2", "title": "Good food but misleading", "comment": "This is a review of their takeaway. The food is very good. But the bill was more than expected and its now very expensive. The lady told me the prices on the menu you see online are very out of date. There was no apology, and they were pretty dismissive - apparently the website has been out of date for years! I left feeling ripped off. A shame because like I say the food is good but there are lots of good Turkish restaurants and I wont be going back to Gezi Park.", "date_of_review": "26 August 2020"}
{"review_id": 100000, "restaurant_id": 294, "username": "U5823ZMclaireb", "date_of_visit": " November 2020", "rating": "1", "title": "Absolute disgrace no social", "comment": "Absolute disgrace no social distancing on the night before the 2nd lockdown they sat people 50cm apart and even used tables with red crosses on! When I challenged this they said it didn’t matter it was the last night!!!! Very irresponsible. The food is bland and overpriced the service is negligent. I would strongly recommend you avoid this overpriced excuse for a restaurant. ", "date_of_review": "4 November 2020"}
{"review_id": 100001, "restaurant_id": 294, "username": "Elliobelliobobo", "date_of_visit": " September 2020", "rating": "2", "title": "Overpriced, stingy portions", "comment": "I have previously ordered from here and it was just ok, but noticed the babaganoush was mostly yoghurt (cheap) and v little aubergine (more expensive ingredient). We decided to give it one more try and ordered a shish kebab with rice, some falafel, some tabule and bread and it came to £30, which seems excessive. On impulse we bought baklava when collecting the take away too - £3 for 3 tiny pieces (the foil tray is an extra small one). Feels like a waste of money and won’t be coming back.", "date_of_review": "25 September 2020"}
{"review_id": 100002, "restaurant_id": 294, "username": "IjeB", "date_of_visit": " May 2020", "rating": "2", "title": "Distinctly average ", "comment": "Distinctly average  Had a delivery on a Thursday evening. The food was luke warm and absolutely no fresh salad or parsley, which I thought would be a standard accompaniment to the lamb kebabs. The lamb was tasty and tender but the hot meze was a little on the greasy side. ", "date_of_review": "18 May 2020"}
{"review_id": 100003, "restaurant_id": 294, "username": "Apjozzy", "date_of_visit": " November 2019", "rating": "4", "title": "Excellent food and service ", "comment": "We dined here with friends on a Sunday lunch time. The food was very good and they catered for both vegetarian and our 2 year old very well. Good customer service too .", "date_of_review": "24 December 2019"}
{"review_id": 100004, "restaurant_id": 294, "username": "LadyEveNoir", "date_of_visit": " January 2020", "rating": "5", "title": "2nd times a charm!", "comment": "This was our second visit and a large last minute birthday booking. We had a superb lunch there yesterday. Honestly everything was seamless and it’s so refreshing to have found such a special place. 17 of us had a great celebration and we were really taken care of. The team there are so friendly, so helpful and the service is amazing. The food is delicious, extremely tasty and very reasonably priced. My nephew has severe allergies but they were able to accommodate him and ensure he has something to eat which he thoroughly enjoyed. A huge thank you to the Gezi Park Team for looking after us and providing exceptional service and food. We all had a wonderful time and will definitely be back (we will hopefully give you a little more notice next time)  There is nothing not to love about this place, if you have not tried it yet you are missing out!", "date_of_review": "27 January 2020"}
{"review_id": 100005, "restaurant_id": 294, "username": "usha80", "date_of_visit": " December 2019", "rating": "5", "title": "A Turkish gem in Wanstead", "comment": "I have lunched many times with friends at Gezi Park and the food is divinely delicious. The halloumi cheese starter and the chicken sish just melts in your mouth . Good sized portions and plenty of pepper chili sauce on the house. The staff are welcoming and very obliging . Strongly recommend Gezi Park . You will be returning again and again", "date_of_review": "17 December 2019"}
{"review_id": 100006, "restaurant_id": 294, "username": "ibrahimc", "date_of_visit": " February 2020", "rating": "5", "title": "Family dinner", "comment": "Best Turkish restaurant ever friendly staff,friendly owner super atmosphere,highly recommended.Lovely food", "date_of_review": "15 February 2020"}
{"review_id": 100007, "restaurant_id": 294, "username": "lindacC1669CY", "date_of_visit": " February 2020", "rating": "1", "title": "Very disappointing Valentines meal", "comment": "Set menu £27.50 pp. This has been a favourite restaurant of ours so we’re really disappointed by the whole experience. Restaurant had a “Special” menu but nothing special about the experience. Candles on table which were not even lit. Food took ages. Hot Meze starter was a plate of fried food, even halloumi was fried. Meat platter uninspiring. Such a shame . Next time we will need to check if they have a special menu and avoid.", "date_of_review": "14 February 2020"}
{"review_id": 100008, "restaurant_id": 294, "username": "GeorgeR2087", "date_of_visit": " January 2020", "rating": "5", "title": "Getzi is our ideal romantic evening", "comment": "The staff are always welcoming and attentive without being intrusive. Delicious food and wine/ coffee. The music adds to the fantastic ambience❤", "date_of_review": "26 January 2020"}
{"review_id": 100009, "restaurant_id": 294, "username": "JiaKaur", "date_of_visit": " February 2020", "rating": "5", "title": "Best Restaurant on Wanstead High Street", "comment": "Great food, great flavour, great service! The ambience is great, atmosphere is friendly and it’s just a wonderful place to dine. Having been to all the restaurants on the high street, this is the best!", "date_of_review": "25 February 2020"}
{"review_id": 100010, "restaurant_id": 294, "username": "Mizj87", "date_of_visit": " February 2020", "rating": "1", "title": "service", "comment": "The food was good no complain, the disappointment was the different treatment. We had to call the severes few times to get our drinks or even starters but the table next to us were treated better plus they were at their beck and call while we had to wait several times to get their attention, towards the end I notice they offered them drinks on the house ( the restaurant is very tight in space so they are right beside us) and gave them a card to give reviews, even then we had to call them to get our bill and to pay as well we had to keep getting their attention I m not bothered about the free drinks it’s just the different treatment for us being Asians I felt quite uncomfortable. I never have experienced this before, and it’s not nice to be that spot, for this reason I will never go again. Ps we spent the same money as the table beside us.", "date_of_review": "29 February 2020"}
{"review_id": 100011, "restaurant_id": 294, "username": "choudara", "date_of_visit": " May 2020", "rating": "1", "title": "Repulsive old rancid food", "comment": "Repulsive old rancid food - ordered a delivery from here as we are in lockdown and it was absolutely disgusting and cost over £40 for 3 dishes and houmous. The main was just one kebab and a bit of rice. Other restaurants do an entire platter for £20. But I thought since I like this place when I eat in it will be worth the £9-12 per dish I was paying. It was not. The salad was out of a bag, with nothing else added to it not even lemon juice, it was just leaves, not the usual you get when you eat in with carrots, pomegranates etc. The meat was dry and horrible as if it was cooked a long time ago not freshly. And then there was the ‘home made’ baklawa. It was OLD. It had gone off, I took a bite and had to spit it out. It was soft smelt and tasted like cheese that had gone off. Absolutely repulsive. It was also £4.50 for 3 pieces. How can they send food like that to people? It was not home made and had clearly been laying around for a LONG time. The order arrived far too quickly as well so it was clear it wasn’t freshly cooked. I do not recommend this place at all. Hygiene isn’t up to scratch during these coronavirus times clearly. Which is just dangerous. I will never order or eat in here again.", "date_of_review": "2 May 2020"}
{"review_id": 100012, "restaurant_id": 294, "username": "Joeboy1949", "date_of_visit": " October 2019", "rating": "5", "title": "Great service and ambiance", "comment": "My wife and I together with our two daughters had lunch.Great service. Lovely ambiance.Helpful staff.", "date_of_review": "29 October 2019"}
{"review_id": 100013, "restaurant_id": 294, "username": "Cristina B", "date_of_visit": " November 2019", "rating": "5", "title": "Mrs", "comment": "Tonight was the best night spent in a Turkish restaurant ever!  I have had family members invited for dinner, and we all have been so happy about the food and all we have been pampered!  Especially from the beginning we have been greeted by Hassan and he looked after us so professionally from the beginning till the end! We will recommend this restaurant to my family members, and we definitely are coming back! Food was delicious and served with a big smile!", "date_of_review": "22 November 2019"}
{"review_id": 100014, "restaurant_id": 294, "username": "nohypetoday", "date_of_visit": " October 2019", "rating": "4", "title": "Reliably good charcoal grilled yumminess.", "comment": "I've been to Gezi many times and it is consistenly my favourite restaurant in Wanstead. It just does what a good place should do - reliably serving delicious plates of food (along with good service) every time - in this case, delicious charcoal grilled meats.", "date_of_review": "20 November 2019"}
{"review_id": 100015, "restaurant_id": 294, "username": "Ruthly", "date_of_visit": " December 2019", "rating": "4", "title": "Great restaurant", "comment": "Have been here a few times now, good food and the staff are attentive and pleasant. It’s very clean and has s nice atmosphere. Worth a visit", "date_of_review": "9 December 2019"}
{"review_id": 100016, "restaurant_id": 294, "username": "Ada469965", "date_of_visit": " December 2019", "rating": "5", "title": "selected dishes...❤️", "comment": "If you look for one romantic night , for delicious food and for warm service, I recommend 100% gezy park , I was many times and I can’t wait to going again , thank you very to Ana for the nice atmosphere and nice service !", "date_of_review": "3 December 2019"}
{"review_id": 100017, "restaurant_id": 294, "username": "Jacksololoman1", "date_of_visit": " December 2019", "rating": "5", "title": "Great staff great restaurant", "comment": "Hey guys, looking for lovely dinner delicious food exceptional service and brilliant atmosphere there is only one I recommend to you that is gezi park well recommended you won't be disappointed", "date_of_review": "5 December 2019"}
{"review_id": 100018, "restaurant_id": 294, "username": "jonnes458", "date_of_visit": " December 2019", "rating": "5", "title": "Joanne", "comment": "We had a special occasion with the family last saturday at Gezi Park and the service was superb, the food was excellent and the staff especially the manager Hassan, waitress Anna were both brilliant. Ofcourse i dont have to mention Alex what a great man! Definitely will be back soon!", "date_of_review": "4 December 2019"}
{"review_id": 100019, "restaurant_id": 294, "username": "Sue19643", "date_of_visit": " December 2019", "rating": "5", "title": "Wow!!", "comment": "This place is amazing, the best Turkish food , the best atmosphere (relaxing music) . I eat combination sish wich was delicious , portion is big and nice looking plate. Attentive staff and friendly! Thank you very much Gezi park team!!", "date_of_review": "3 December 2019"}
{"review_id": 100020, "restaurant_id": 294, "username": "steverX7241PV", "date_of_visit": " December 2019", "rating": "5", "title": "Great evening", "comment": "Was there last night with some friends, the food and atmosphere was amazing,thanks Alex for the great service. Will be back soon.", "date_of_review": "4 December 2019"}
{"review_id": 100021, "restaurant_id": 294, "username": "clarbie", "date_of_visit": " September 2019", "rating": "5", "title": "Delicious", "comment": "Can’t say i’ve tried Turkish food other than a late night greasy kebab, but this was lunch and so delicious, a revelation! Well priced, well presented, delicious and filling, thank goodness I didn’t have to work afterwards. Great staff, attentive and good with kids. Overall very impressed, thank you for a wonderful experience.", "date_of_review": "9 September 2019"}
{"review_id": 100022, "restaurant_id": 294, "username": "Charlenegocmen", "date_of_visit": " December 2019", "rating": "5", "title": ":)", "comment": "I highly recommend this restaurant It is my favourite restaurant so far to visit with family and friends, it has an amazing atmosphere with delicious food and not to mention the staff are always so accommodating Will definitely be back. :)", "date_of_review": "4 December 2019"}
{"review_id": 100023, "restaurant_id": 294, "username": "Daciana F", "date_of_visit": " October 2019", "rating": "5", "title": "Wow!", "comment": "Today I visited this great Turkish restaurant with my boyfriend and we had a fantastic time. The food was delicious, the atmosphere very relaxing (excellent playlist, by the way), the staff super friendly and the bread, in particular, was outstanding. I cannot wait to go back! Thank you, Gezi Park!", "date_of_review": "13 October 2019"}
{"review_id": 100024, "restaurant_id": 294, "username": "Amy S", "date_of_visit": " September 2019", "rating": "5", "title": "Amazing food", "comment": "Amazing food, friendly staff & very welcoming.  Best Turkish restaurant in wanstead. Definitely visiting again", "date_of_review": "22 September 2019"}
{"review_id": 100025, "restaurant_id": 294, "username": "filiceg2016", "date_of_visit": " September 2019", "rating": "5", "title": "Oh my god! ", "comment": "Well, what can I say. My first ever visit to a Turkish restaurant and I am blown away. The bread alone is unbelievable, add a salad and a mixed kebab and now Turkish food is my favourite food. Where has this been all my life. Please try this restaurant, it’s quite frankly superb", "date_of_review": "12 September 2019"}
{"review_id": 100026, "restaurant_id": 294, "username": "chauhanLondon", "date_of_visit": " September 2019", "rating": "5", "title": "Best Turkish food ever ", "comment": "We ate here for the 1st time having travelled from Buckinghamshire especially to me up with friends. We all loved the ambience, good and the hospitality was excellent. Big thanks to our beautiful and friendly waitress Ana for the excellent service with a smile. We are vegetarian so all the dishes we ordered were so so tasty  My absolutely favourite was Mucver with yoghurt -fried mounds of grated courgette,herbs and cheese served with strained yoghurt ! Will definitely travel all the way back here for a meal ", "date_of_review": "20 September 2019"}
{"review_id": 100027, "restaurant_id": 294, "username": "SindyV940", "date_of_visit": " September 2019", "rating": "4", "title": "Lovely food ", "comment": "I went with my friend and her daughter. The atmosphere is nice.  I ordered Albanian liver which was very nice. The chicken shish was nice. My friend had the calamari main n she enjoyed it. The bread and buttery rice they serve you can’t stop eating! You probably don’t need starters.  The mint tea was nice but probably doesn’t need lemon added to it. The liqueur coffee was lovely. My friend enjoyed her rose wine.  Service charge is added. 3 ppl bill was £85.  Customer service was nice but when we stayed longer than others we got a sense they wanted us to leave. But we ignored that n just enjoyed ourselves so I dropped a star for that. No one likes feeling their welcome has ended. ", "date_of_review": "22 September 2019"}
{"review_id": 100028, "restaurant_id": 294, "username": "DapperTom", "date_of_visit": " September 2019", "rating": "5", "title": "Fantastic visit", "comment": "Amazing food. Absolutely amazing. Very friendly staff. They moved tables to make room for our pram with our baby sleeping on a Friday night so week could enjoy a much needed dinner out. Thank you.", "date_of_review": "20 September 2019"}
{"review_id": 100029, "restaurant_id": 294, "username": "mythbirtthedragon", "date_of_visit": " September 2019", "rating": "5", "title": "Made my day ", "comment": "We went here for a quiet birthday lunch, first time we’ve visited. Staff were very friendly, looked after us well and lunchtime deal was a bargain. Mentioned in passing when I ordered my coffee that it was my birthday and look what arrived with it. Thanks ", "date_of_review": "24 September 2019"}
{"review_id": 100030, "restaurant_id": 294, "username": "Adrian_Swain", "date_of_visit": " September 2019", "rating": "5", "title": "Lunch in the park", "comment": "Went here for lunch and really couldn’t fault anything. The food was excellent, beautifully cooked and generously portioned given the low price. Can’t wait to go again, thoroughly revommended", "date_of_review": "27 September 2019"}
{"review_id": 100031, "restaurant_id": 294, "username": "camilemm", "date_of_visit": " October 2019", "rating": "2", "title": "I don’t recommend", "comment": "Very expensive restaurant. Medium quality food. They charge for Service charge. I don’t recommend. .", "date_of_review": "6 October 2019"}
{"review_id": 100032, "restaurant_id": 294, "username": "roay", "date_of_visit": " July 2019", "rating": "5", "title": "Amazing food, atmosphere and staff", "comment": "We visited with friends to gezi park we ordered a variety of food from the menu and sides. It was all beautiful. We enjoyed every single moment highly recommend and will definitely visit again. Very welcoming staff too lovely place ", "date_of_review": "10 July 2019"}
{"review_id": 100033, "restaurant_id": 294, "username": "Sara M", "date_of_visit": " March 2019", "rating": "4", "title": "Nice Turkish restaurant on the high road", "comment": "Very nice food. Pleasant atmosphere (big aquarium for the kids to enjoy!) and good service. Good value for money.", "date_of_review": "4 September 2019"}
{"review_id": 100034, "restaurant_id": 294, "username": "Ashantival", "date_of_visit": " June 2019", "rating": "5", "title": "Delicious food and friendly service", "comment": "We really enjoyed our Meal! Food was flavousom and plentiful. Highly recommend the fish platter. Great swift service.", "date_of_review": "22 June 2019"}
{"review_id": 100035, "restaurant_id": 294, "username": "Jean_Marie40", "date_of_visit": " July 2019", "rating": "5", "title": "Family friendly", "comment": "Great food. Always feel welcome. We love it here! Hassan always ensures we are being looked after.  Family friendly restaurant, highly recommended.", "date_of_review": "21 July 2019"}
{"review_id": 100036, "restaurant_id": 294, "username": "Tatyana N", "date_of_visit": " August 2019", "rating": "5", "title": "Great Turkish restaurant ", "comment": "It's a lovely Turkish restaurant. Delicious food and great customer service. Me and my boyfriend have been couple of times and we would highly recommended.", "date_of_review": "26 August 2019"}
{"review_id": 100037, "restaurant_id": 294, "username": "Carl P", "date_of_visit": " August 2019", "rating": "5", "title": "Great meal", "comment": "Always made to feel welcome by the friendly staff, food is always on point with a great selection. Highly recommended.", "date_of_review": "23 August 2019"}
{"review_id": 100038, "restaurant_id": 294, "username": "LadyEveNoir", "date_of_visit": " August 2019", "rating": "5", "title": "Last minute celebration & the perfect choice", "comment": "Booked a last minute table for a family birthday this evening, more people turned up than we expected however the staff were quick to move a few tables to accommodate us all without issue. We ordered the Gezi platter 3 for all of us, 6 platters in fact and the food was absolutely delicious! Everyone was super impressed. The meats were all soft and tender, very flavoursome and so much to go around. We ended up taking several take away boxes as we just could not finish it all there! My nephew is 3 and is allergic to egg, after ordering him some nuggets and chips we soon realised they were dipped in egg. The chef makes the nuggets in house, he quickly whipped up some chicken shish and it was a great hit with the kids! Plenty of warm bread to go around and they kept on replenishing the bread baskets, you certainly won’t ever leave hungry! A massive thank you to our waitress Anna, she looked after us so well and nothing was too much trouble. She really was fantastic and made us feel very welcome and valued as customers. Real service at its best, she is a real credit and it did not go unnoticed. I know sometimes such a large group like ours can be a bit of a handful, but she did not break a sweat and all with a smile on her face.   If you are thinking of visiting, don’t think twice. I know we will be back, was a great place for our celebrations and Gezi Park really was the perfect choice for us, I’m sure it will be for you too!", "date_of_review": "11 August 2019"}
{"review_id": 100039, "restaurant_id": 294, "username": "pedro s", "date_of_visit": " July 2019", "rating": "5", "title": "Terrific Turkish", "comment": "The Turkish hotspot of Wanstead, great range of drinks and even better food, watch out for Hassan one of the beat managers in Wanstead ensuring his staff provide excellent quality of service. Gezi Park is a must if you are passing through wanstead !!!", "date_of_review": "24 July 2019"}
{"review_id": 100040, "restaurant_id": 294, "username": "barbarelli", "date_of_visit": " August 2019", "rating": "2", "title": "Gezi Park restaurant Wanstead", "comment": "disappointing food my lamb shank tasted boiled rather then oven cooked swimming in an acidic sauce soggy potatoes im sure it had been cooked earlier and microwaved . I did ask and answer was no ..friends fish she said was ok the other two said food was dry no one finished their meal .we had wine and other drinks I feel overpriced for the quality of the food,and the drinks probably priced same as other restaurants.. theres a good choice in Wanstead. i will avoid this place in future although the staff were good and no complaints about them .disappointing experience", "date_of_review": "20 August 2019"}
{"review_id": 100041, "restaurant_id": 294, "username": "G272GXrachell", "date_of_visit": " April 2019", "rating": "4", "title": "Amazing food but lack of disabled facilities ", "comment": "The food is great quality, meat was moist and delicious even the salad vinaigrette was so good. Staff are very friendly and helpful and the decor was lovely. Only thing from giving a 5 star was that it was extremely difficult getting my dad to the toilet since he is disabled and the toilet can only be accessed via stairs. I would suggest even getting another banister on the left to make it more accessible to others less able to walk as my dad does not have full mobility of his right arm and leg. ", "date_of_review": "21 April 2019"}
{"review_id": 100042, "restaurant_id": 294, "username": "Peterk1307", "date_of_visit": " August 2019", "rating": "5", "title": "Great Turkish Restaurant!", "comment": "Visiting the area, this was a fantastic family find. Fabulous Turkish food and friendly staff. Would definitely return. ", "date_of_review": "30 August 2019"}
{"review_id": 100043, "restaurant_id": 294, "username": "MrsPhiDaQueenB", "date_of_visit": " June 2019", "rating": "5", "title": "Great food, great service", "comment": "The staff are very friendly and welcoming. The food is really tasty. I recommend the prawns. The restaurant is clean and comfortable.", "date_of_review": "21 June 2019"}
{"review_id": 100044, "restaurant_id": 294, "username": "Austin K", "date_of_visit": " April 2019", "rating": "4", "title": "Gezi...Gezi...Gezi!", "comment": "Had a wonderful time, food was on point. Staff first wonderful! Large portions so make space in your fridge!", "date_of_review": "15 April 2019"}
{"review_id": 100045, "restaurant_id": 294, "username": "johntowell6", "date_of_visit": " April 2019", "rating": "5", "title": "Another lovely meal", "comment": "Always try to visit here when we stay with our daughter in Wanstead. As usual, the food was excellent as are the staff", "date_of_review": "23 April 2019"}
{"review_id": 100046, "restaurant_id": 294, "username": "732ruthf", "date_of_visit": " May 2019", "rating": "5", "title": "...the Best...", "comment": "...always was the best, still is, and always will be. If we could get the lamb chops delivered in Cornwall, we would do. Tender favoured meat that tastes sublime and melts in the mouth. Great value, great service. ", "date_of_review": "5 May 2019"}
{"review_id": 100047, "restaurant_id": 294, "username": "cherryvelour", "date_of_visit": " May 2019", "rating": "5", "title": "My favourite Turkish restaurant in London!", "comment": "I have been coming to Gezi Park for around 4 years now and try to come at least once a month, more often if I can.  We love the Gezi platters as there is so much variety on offer. Service is great and always friendly Hassan and the staff. It is definitely our favourite Turkish restaurant in London. ", "date_of_review": "19 May 2019"}
{"review_id": 100048, "restaurant_id": 294, "username": "London Snaresbr... T", "date_of_visit": " May 2019", "rating": "5", "title": "Best", "comment": "Best kebab in the area! Friendly staff. Fresh bread, good quality meat, desserts and e salads . Taste food. Most importantly great owners who are always happy and welcoming. Recommend 100% :)", "date_of_review": "25 May 2019"}
{"review_id": 100049, "restaurant_id": 294, "username": "DoctorXRay", "date_of_visit": " June 2019", "rating": "5", "title": "Best One in the town ", "comment": "Great food, and excellent customer service. Will be coming back with friends next time again for sure. Thank you very much ", "date_of_review": "3 June 2019"}
{"review_id": 100050, "restaurant_id": 294, "username": "Fearless276274", "date_of_visit": " June 2019", "rating": "5", "title": "Amazing", "comment": "From Door they deliver the best customer service, the food is always fresh, humus is the best in town :) the restaurant is beautiful inside out, can wait for the weather to get better to enjoy Some beers at their terrace.", "date_of_review": "13 June 2019"}
{"review_id": 100051, "restaurant_id": 294, "username": "kellann d", "date_of_visit": " May 2019", "rating": "3", "title": "It's okay", "comment": "The food taste really good the price wasn't bad. The ambiance was quite snug. The staff was friendly. My only disappointments were: the food portion was small and the salad wasn't the regular Turkish type salad. There was pommegranate in the salad and whilst I liked the look of it and I do like pommegranate, it's tough to eat it in a salad and have to spit the seeds out.", "date_of_review": "9 May 2019"}
{"review_id": 100052, "restaurant_id": 294, "username": "Philip D", "date_of_visit": " March 2019", "rating": "4", "title": "Quality!", "comment": "The atmosphere is always romantic and the staff and owner are continually welcoming. The starters and drinks are served quickly, even if the restaurant is completely full. I have tried a few of there main courses and the portions are very well sized and well cooked. I can't really talk about the desert as the starter and the main is so delicious that i never leave room for it ! They have just finished refurbishing their outside decking which looks very cool. I am looking forward to sitting out with my wife in the summer.", "date_of_review": "28 March 2019"}
{"review_id": 100053, "restaurant_id": 294, "username": "GeorgeR2087", "date_of_visit": " February 2019", "rating": "5", "title": "Perfect venue for romance", "comment": "Gezi Park has the perfect ambience for a couple's romantic evening,the turkish music,candles,friendly and welcoming waiting sfaff together with mouthwatering cuisine and wine have peruaded us to become enthusiastic regular visitors to Gezi ❤", "date_of_review": "27 February 2019"}
{"review_id": 100054, "restaurant_id": 294, "username": "LennonS_12", "date_of_visit": " February 2019", "rating": "5", "title": "Dinner", "comment": "Just had a lovely dinner here, its always great, i keep coming back they have realy good food and service.", "date_of_review": "24 February 2019"}
{"review_id": 100055, "restaurant_id": 294, "username": "Harry S", "date_of_visit": " February 2019", "rating": "4", "title": "Always great value and good food", "comment": "Love the £9.95 Lunch offer although I am not sure who eats the rice pudding and Barclava I am normally stuffed after 2 courses.", "date_of_review": "25 February 2019"}
{"review_id": 100056, "restaurant_id": 294, "username": "tommyhez", "date_of_visit": " February 2019", "rating": "5", "title": "Unrivalled Experience", "comment": "As a former resident of Wanstead I used to often eat at Gezi park; and on my return to the area it was my number one choice for dinner. I have never had a bad meal at this restaurant; my only hard decision is deciding what to choose. Every meal starts with complimentary bread and dips (which they give to you after you've chosen your meal) - so be aware if you have small appetites. I usually opt for a Meze platter to start - both the hot and cold platters are sublime. The food is cooked authentically right in the heart of the restaurant with a glass window for all to see. As a frequent visitor to Turkey I can honestly say that the food is good, honest with and authentic with a slight European twist. The portions are hearty and there is never the notion of wanting more. I expect that the dessert menu is usually chosen - I have never got that far yet!", "date_of_review": "8 March 2019"}
{"review_id": 100057, "restaurant_id": 294, "username": "Vicky08Uk", "date_of_visit": " March 2019", "rating": "5", "title": "Perfect food :) perfect hosts ", "comment": "We’ve been eating here for years & never had a bad meal. The food is delicious & all cooked fresh. The service is great & friendly. We’ve moved out of the area & still come back regularly to eat here :) ", "date_of_review": "8 March 2019"}
{"review_id": 100058, "restaurant_id": 294, "username": "finley210", "date_of_visit": " March 2019", "rating": "5", "title": "Catered for a group of 20 plus no problem", "comment": "We had a works retirement meal here in the week, early afternoon. We were all seated at the rear of the restaurant in a quiet area, the service was awesome as was the food, really really enjoyed the whole afternoon. We were all made very welcome by Hassan and his colleagues. I’ve eaten in various Turkish restaurants in Stoke Newington having worked there for many years, Gezi Park was as good if not better! Thank you for contributing and making the day a memorable one for our retired colleague! ", "date_of_review": "9 March 2019"}
{"review_id": 100059, "restaurant_id": 294, "username": "33asilaa", "date_of_visit": " October 2018", "rating": "5", "title": "Lovely dinner ", "comment": "I have been there in dinner with my friend who is from Germany and we had lamb casserole and lamb shish it was lovely and we had complementary tea and dessert as well he was very thankful and the service was an excellent!!!", "date_of_review": "2 December 2018"}
{"review_id": 100060, "restaurant_id": 294, "username": "Marysw1w", "date_of_visit": " March 2019", "rating": "5", "title": "Simply the best!!!!!", "comment": "This one overtakes every other Turkish restaurant I have gone too by a mile. We ordered the platter for 2 and my goodness, the meat was succulent and the seasoning to die for. It was my first time to have lamb ribs (most Turkish do shish, lamb chops) the ribs were mouthwatering. No1 place!! my trip from central London was worth it. Oh nearly forgot, the service and team are the friendliest and happiest bunch in a very busy place!", "date_of_review": "17 March 2019"}
{"review_id": 100061, "restaurant_id": 294, "username": "TypingMountain", "date_of_visit": " March 2019", "rating": "5", "title": "Still the best Turkish food in east London...", "comment": "...in our humble opinion. We've tried a number of Turkish restaurants in the area over the years. But we keep coming back to Gezi Park. The food is so fresh, much of it cooked over an open fire a few steps from your table. And the staff is unbelievably thoughtful and friendly -- the host in particular. We've never had an experience that was anything less than stellar.", "date_of_review": "16 March 2019"}
{"review_id": 100062, "restaurant_id": 294, "username": "Spanglee", "date_of_visit": " December 2018", "rating": "5", "title": "Great food at good prices", "comment": "Came with colleagues for our Christmas celebrations. Polite and attentive staff. Really tasty food and generous portions. I had the prawn skewers and I couldn't believe how much I was given. Fresh and delicious. I like the huge fish tank! ", "date_of_review": "19 January 2019"}
{"review_id": 100063, "restaurant_id": 294, "username": "agl1979", "date_of_visit": " December 2018", "rating": "5", "title": "Warm reception and lovely food!", "comment": "We’ve been coming to Gezi park regularly for almost two years now. The food is easily the best quality Turkish cuisine I’ve had in the area (and there is quite a lot of competition) but what puts Gezi Park above the rest is the service. Hassan and the waiting staff always make us feel special and looked after. If you’re after a place with a warm, family feel, this is the place for you.", "date_of_review": "15 December 2018"}
{"review_id": 100064, "restaurant_id": 294, "username": "_kbaillieu", "date_of_visit": " January 2019", "rating": "5", "title": "Brilliant night", "comment": "Amazing Turkish restaurant in the middle of Wanstead. Staff are incredibly attentive, the food is good quality and it has a very good vibe. Been there three times and had the same brilliant each time. Highly recommended.", "date_of_review": "25 January 2019"}
{"review_id": 100065, "restaurant_id": 294, "username": "31jinr", "date_of_visit": " March 2018", "rating": "3", "title": "Fantastic Service... Average food!", "comment": "We came here after work on recommendation from a friend. We were greeted by the maître d who was very friendly and definitely added to the dining experience. The service was also very good from the outset, we had our daughter with us and we were provided with a high chair immediately. The restaurant definitely had a family friendly atmosphere. Unfortunately I found the food to just be average and a little more expensive than some of the other local turkish restaurants that have more flavoursome food.  I would go back because the restaurant was family friendly with good service.", "date_of_review": "3 February 2019"}
{"review_id": 100066, "restaurant_id": 294, "username": "Dauly", "date_of_visit": " February 2019", "rating": "5", "title": "Cold meze platter is the best!", "comment": "I am a fan of Turkish cuisine, and always in search for the best Turkish restaurants. I can confidently say that this place is one of the best places I have eaten at.. not only is the quality of the food good, but the service is amazing. We travelled 30 minutes to get here, and it’s our 2nd time here. Bon appetite ladies and gents!", "date_of_review": "12 February 2019"}
{"review_id": 100067, "restaurant_id": 294, "username": "billhE5922KP", "date_of_visit": " January 2019", "rating": "5", "title": "Great", "comment": "Having eaten outside for lunch here a few times I finally made It in for an evening meal and couldn't have been happier. Great value, great service, great food.", "date_of_review": "7 February 2019"}
{"review_id": 100068, "restaurant_id": 294, "username": "732ruthf", "date_of_visit": " February 2019", "rating": "5", "title": "...the Best...", "comment": "...always was the best, still is, and always will be. If we could get the lamb chops delivered in Cornwall, we would do. Tender favoured meat that tastes sublime and melts in the mouth. Great value, great service. The Best.", "date_of_review": "19 February 2019"}
{"review_id": 100069, "restaurant_id": 294, "username": "Dd1991x", "date_of_visit": " February 2019", "rating": "5", "title": "10/10 Turkish... Staff, Service and food all amazing!!", "comment": "Me and my boyfriend come to Gezi Park every week! The food is always spot on! My favourite is the lamb sheesh, although on the odd occasion I get the sea bass and it is also really good! The service is always great and the staff are all so welcoming! It is also very reasonably priced! Gezi Park is the best Turkish restaurant I have been too! Thank you for always taking care of us! X", "date_of_review": "20 February 2019"}
{"review_id": 100070, "restaurant_id": 294, "username": "837kellev", "date_of_visit": " February 2019", "rating": "5", "title": "Dinner", "comment": "Great food, great service, I’m a regular in this restorant for sometime and will continue,  Thank you", "date_of_review": "24 February 2019"}
{"review_id": 100071, "restaurant_id": 294, "username": "AdamG4442", "date_of_visit": " March 2019", "rating": "5", "title": "Highly recommended amazing food service ", "comment": "Very clean restaurant the staff is amazingly welcoming and helpful the food is always very tasteful and well presented ", "date_of_review": "22 March 2019"}
{"review_id": 100072, "restaurant_id": 294, "username": "Nilufer_izmir", "date_of_visit": " June 2018", "rating": "5", "title": "Excellent ", "comment": "Had mix chicken and lamb sis kebab served with rice and salad. It was well cooked,absolutely tasty. Also turkish red wine perfectly comlemented with the dish. Our little daughter had turkish pizza and she was thrilled at the taste of it.  Gorgeous place excellent service, friendly staff at all times. 5 star hygiene rate restaurant.You feel like home.  We'll done to the chef.  We all had a wonderful Fathers day dinner. Thank you to the friendly owner of the restaurant Erdogan. ", "date_of_review": "17 June 2018"}
{"review_id": 100073, "restaurant_id": 294, "username": "Polonius45", "date_of_visit": " June 2018", "rating": "5", "title": "Delicioius, friendly and reasonably priced", "comment": "Gezi Park is a lovely, family-run Turkish restaurant. The staff are charming, and the food fresh and delicious. Their 3 course set lunch for £9.95 is excellent.", "date_of_review": "18 June 2018"}
{"review_id": 100074, "restaurant_id": 294, "username": "amnah2015", "date_of_visit": " May 2018", "rating": "5", "title": "Great food at a great price", "comment": "I've been a handful of times and it's always lovely! The service is great - very attentive, they know the menu inside and out, they're happy to offer suggestions for what to eat or make amendments to dishes (I'm lactose intolerant), and the food always comes out quickly. They have a great lunch deal!", "date_of_review": "19 June 2018"}
{"review_id": 100075, "restaurant_id": 294, "username": "86frenchie", "date_of_visit": " June 2018", "rating": "4", "title": "great food at a great price", "comment": "One of my favorites in Wanstead high street. The service is always great and welcoming. The food is good at a reasonable price. If you like turkish food, go there.", "date_of_review": "13 August 2018"}
{"review_id": 100076, "restaurant_id": 294, "username": "mongreladam", "date_of_visit": " July 2018", "rating": "5", "title": "Very impressed ", "comment": "Taking our clients out for an end of term lunch they were insistent we brought them here, travelling 30 miles to have a great meal Impressed by friendly staff on arrival we had a full choice of seating, whether it was inside or out and were seated very promptly The lunch menu is particularly good value, with a huge selection to choose from and plenty of things to tickle your tastebuds  The whole experience was great, in clean and modern surroundings and the feature fish tank inside is particularly impressive If you need a good place for a lovely lunch or dinner then make sure you come here! 10/10", "date_of_review": "20 July 2018"}
{"review_id": 100077, "restaurant_id": 294, "username": "RedJuly50", "date_of_visit": " July 2018", "rating": "5", "title": "Birthday Meal", "comment": "Visited Saturday early eve. We booked a table. The resturant was reasonably busy during our meal. The food was really good. We felt there could have been a little more rice on the plates but the meat was plentyful and very tender. Food being delivered to tables around us looked equallly as good as ours and gave us a few menu choice ideas for future visits. We ordered the little jug of lime cordial for £1.50 and received jugs of tap water so that we could dilute to our taste which was really nice to have as an option. Looking forward to our next visit. Thinking about trying the lunch deal too.", "date_of_review": "16 July 2018"}
{"review_id": 100078, "restaurant_id": 294, "username": "Ben B", "date_of_visit": " August 2018", "rating": "5", "title": "A most enjoyable dinner", "comment": "A very friendly welcome and an outdoor table set the scene for a very enjoyable dinner. Delicious bread and olives came while we were ordering, and the calamari and stuffed aubergine were perfect starters. We both enjoyed the mixed (chicken and lamb) sis, which came with rice and a salad. Everything was fresh and delicious, and the staff were warm and welcoming. Highly recommended.", "date_of_review": "21 August 2018"}
{"review_id": 100079, "restaurant_id": 294, "username": "Lindsey T", "date_of_visit": " June 2018", "rating": "4", "title": "Great casual dinner.", "comment": "We sat outside on a beautiful summer's night and had a delicious meal at this restaurant. We shared some dips and bread to start and also shared the Imam Bayildi with prawns, halloumi and salad. All the food was of a high standard and tasted amazing. We will definitely visit again.", "date_of_review": "18 September 2018"}
{"review_id": 100080, "restaurant_id": 294, "username": "aycizzle", "date_of_visit": " March 2018", "rating": "5", "title": "Lovely traditional Turkish food!", "comment": "Great little Turkish restaurant with a good atmosphere. Lovely staff who are very accommodating and everything I've tried to date has been very tasty.", "date_of_review": "6 April 2018"}
{"review_id": 100081, "restaurant_id": 294, "username": "theonelikefranco", "date_of_visit": " March 2018", "rating": "4", "title": "Very good Turkish food", "comment": "Visited on Friday night and the place was packed. We could sense the waiting staff were very busy when we arrived but we were seated after a few minutes and table service was efficient even though it was busy. The food and service were very good, definitely no room for dessert. The complementary olives could be bit nicer and maybe some hummus but otherwise everything was good.", "date_of_review": "26 March 2018"}
{"review_id": 100082, "restaurant_id": 294, "username": "969ruthh", "date_of_visit": " May 2018", "rating": "5", "title": "Wonderful", "comment": "Maintains its game. Fabulous food: the lamb is exquisite and pomegranate tabulleh fresh as a daisy. Good value, great staff. Go. ", "date_of_review": "6 May 2018"}
{"review_id": 100083, "restaurant_id": 294, "username": "kellymichalopoulou", "date_of_visit": " May 2018", "rating": "5", "title": "Amazing food great costumer service", "comment": "Lovely atmosphere, delicious food and the costumer service it was amazing the name of the waitor was Hasan he was helpful with the menu and he really take care of us ....thank you guys we will definitely come back again", "date_of_review": "14 May 2018"}
{"review_id": 100084, "restaurant_id": 294, "username": "hl349", "date_of_visit": " April 2018", "rating": "5", "title": "Excellent food and service ", "comment": "We popped in on a Sunday evening. We were very pleased with our cold mixed mezze which was delicious and good value. The homemade bread is to die for. Highly recommended ", "date_of_review": "22 April 2018"}
{"review_id": 100085, "restaurant_id": 294, "username": "Vegefoodie", "date_of_visit": " May 2018", "rating": "3", "title": "Okay but food was too oily", "comment": "I came here with friends for a quick bite. We sat outside which is a great spot on a sunny day. The staff generally were very decent but there was one staff member that wasn't too friendly.  We ordered some meze and a salmon dish and asked for all of them to be brought out at the same time - the meze was brought first and the fish course 10 minutes later! The halloumi was on the salty side, the houmous was very nice, the aubergine dish we ordered was drenched in oil and the bread was drenched in oil. My friend enjoyed her fish course.  I wouldn't come here again. There are much better restaurants with better quality meze", "date_of_review": "21 May 2018"}
{"review_id": 100086, "restaurant_id": 294, "username": "lauralamont", "date_of_visit": " April 2018", "rating": "5", "title": "Best Turkish restaurant in London", "comment": "I cannot speak highly enough of this place. The service is outstanding, the food is authentic, delicious and excellent value. I have lived in the area for a few months and already this has become one of my favourite restaurants in London. Superb takeaway service too. If they delivered it would be dangerous, according to my husband. ", "date_of_review": "10 April 2018"}
{"review_id": 100087, "restaurant_id": 294, "username": "shandy2828", "date_of_visit": " May 2018", "rating": "5", "title": "Shandy 28", "comment": "Really enjoyed our evening, the staff were very welcoming & friendly. The food was amazing especially the king prawns. My second visit but the first time for my family. Will definitely be going back.", "date_of_review": "16 May 2018"}
{"review_id": 100088, "restaurant_id": 294, "username": "nevintnv", "date_of_visit": " May 2018", "rating": "5", "title": "Great and amazing Turkish food", "comment": "Highly recommended by me.pls do visit this place.so friendly customer service clean and neat.the fish tank is really beautiful.we ordered sharing platter worth for the money.food is so tasty,the bread and the dips are hot which really goes with the bread.trust me n do visit this place ", "date_of_review": "29 May 2018"}
{"review_id": 100089, "restaurant_id": 294, "username": "P4377ZHjanetw", "date_of_visit": " May 2018", "rating": "5", "title": "Great restaurant ", "comment": "Been here several times now. They have a great choice on the menu and it’s reasonably priced. Nice and pleasant service. You can also see the chefs cooking. Very good will definitely teturn", "date_of_review": "26 May 2018"}
{"review_id": 100090, "restaurant_id": 294, "username": "Karen S", "date_of_visit": " October 2018", "rating": "5", "title": "What a Gem of a Find!", "comment": "27 people with 2 weeks notice? No problem! We just had a terrific 80th birthday party dinner here for 27. Food was amazingly good, and terrific value. I'm surprised some of us got past the starters, there was such a great choice. And the chocies were just as plentiful for the mains. The lamb was generously portioned and meltingly succulent. The fish was a delight for the birthday girl. Our veggies were suitably impressed by the stuffed aubergine and moussaka. Staff were attentive but unobtrusive and nothing was too much trouble. Beautiful breads, salads olives. problem was we were all too full for desserts, so will have to pop back another time for that experience too. Thank you for looking after us all so well.", "date_of_review": "7 October 2018"}
{"review_id": 100091, "restaurant_id": 294, "username": "Ladybaber", "date_of_visit": " November 2018", "rating": "5", "title": "Excellent food and service", "comment": "Me and my partner eat at this restaurant  Was very impressed with the lovely food and service was amazing  The meze was to die for  I had the special and I would definitely recommend this place.", "date_of_review": "13 November 2018"}
{"review_id": 100092, "restaurant_id": 294, "username": "TrueBrit_10", "date_of_visit": " January 2018", "rating": "5", "title": "Delicious food", "comment": "If you like delicious Turkish food look no further than this restaurant. The mains portions are very generous and my two daughters and I were very full on a sharing starter of dips with salad followed by two mains! Great atmosphere with good and friendly service too.", "date_of_review": "14 January 2018"}
{"review_id": 100093, "restaurant_id": 294, "username": "kevwest", "date_of_visit": " January 2018", "rating": "4", "title": "First time, won't be the last", "comment": "Went here on a Friday night? Reserved but a few spaces. Prompt service, extensive menu. Not cheap , but very tasty , Halep kebab was Great. Very clean toilets. Nice atmosphere , fish tank helped. Staff could have been a bit more friendly but they were busy. Overall a nice meal and will be back. ", "date_of_review": "26 January 2018"}
{"review_id": 100094, "restaurant_id": 294, "username": "D_West1992", "date_of_visit": " January 2018", "rating": "5", "title": "Trust the reviews!!", "comment": "The reviews are not wrong about this place! Delicious food, friendly service and you even get a few complimentary bits with your meal, always a winner! Will definitely be coming back! PS: Love the fish tank!", "date_of_review": "27 January 2018"}
{"review_id": 100095, "restaurant_id": 294, "username": "JeffH4216", "date_of_visit": " December 2017", "rating": "4", "title": "Great food", "comment": "This place offers great food and service at a very reasonable price. The only let down is the decor, the place is certainly due a full renovation. If you can see past that, it is certainly worth a visit.", "date_of_review": "28 January 2018"}
{"review_id": 100096, "restaurant_id": 294, "username": "antoniomartin87", "date_of_visit": " January 2018", "rating": "5", "title": "The quality of the food is as good as always", "comment": "I came here with my friend a bit late, but that wasn't a problem. Having been here many times, we knew we were going to have a great dinner. We chose one of the big mezze platters, full of meat and rice. Delicious! We enjoyed the dinner with a Rioja Red Wine. Service was outstanding and friendly as always! The only complain is the music, a bit loud and more suitable for a club, in my opinion.", "date_of_review": "1 February 2018"}
{"review_id": 100097, "restaurant_id": 294, "username": "Sam B", "date_of_visit": " February 2018", "rating": "5", "title": "Fantastic", "comment": "On Friday night my friend and I went out for a bite to eat and a chat. GEZI PARK was perfect. The food was fantastic and the portions were huge.  The staff were all really friendly and attentive without being overwhelming.  GEZI PARK is an absolute must for families looking for a very unreasonably priced midweek treat or a weekend family occasion.  We most definitely will be back.", "date_of_review": "4 February 2018"}
{"review_id": 100098, "restaurant_id": 294, "username": "antoniomartin87", "date_of_visit": " March 2018", "rating": "5", "title": "Excellent Lunch Set Menu", "comment": "I normally come here once a week to enjoy the excellent lunch menu that they provide from Monday to Friday for just £9.95. The menu has multiple choices for all the tastes. I have tried several starters and main dishes and they are all very tasty, and the portions are huge. They also give you bread with some dips, so you definitely don't leave the restaurant hungry! The staff is very well-trained by the owner, as they are all very polite, friendly and very efficient. See you soon.", "date_of_review": "15 March 2018"}
{"review_id": 100099, "restaurant_id": 294, "username": "Pipspatch1", "date_of_visit": " October 2017", "rating": "5", "title": "Superb food", "comment": "The service and the food were excellent - and the staff made sure everyone had something great to eat including those who were vegetarian or had food intolerances.", "date_of_review": "28 October 2017"}
{"review_id": 100100, "restaurant_id": 294, "username": "LTStone", "date_of_visit": " February 2018", "rating": "4", "title": "Good value", "comment": "Food was fine. I'm sure there is better Turkish food out there, but I'm also sure there is a lot worse. The lunchtime set menu (£9.95 for actually 3 courses, though online the menu says 2 courses) is exceptionally good value in my opinion. Service was good, unobtrusive but timely, and the restaurant itself, décor wise, was okay. Toilets very clean and well appointed - always a positive sign in a restaurant, I think.  Additionally, a service charge was NOT automatically added to our bill. Payment for service (cash, or added to the card) was left up to us - an excellent practice, that I wish more restaurants adopted.", "date_of_review": "14 February 2018"}
{"review_id": 100101, "restaurant_id": 294, "username": "Jag C", "date_of_visit": " April 2017", "rating": "5", "title": "great service and value", "comment": "I have been a couple of times now and I would highly recommend. We came here last night and I must say the service was really good. My wife ordered something which she did not like the look of, however they offered to make something else for her at no extra cost which was very generous and much appreciated. The food is really good quality and the portions a good size, and all at a very decent price too. One of the best Turkish restaurants in the area, I would recommend.", "date_of_review": "24 March 2018"}
{"review_id": 100102, "restaurant_id": 294, "username": "holidaylover00", "date_of_visit": " February 2018", "rating": "5", "title": "Consistent food service and value", "comment": "We use this place quite frequently for its £9.95 lunch which is very good value, so far all our selections have been excellent ", "date_of_review": "16 February 2018"}
{"review_id": 100103, "restaurant_id": 294, "username": "giles1964", "date_of_visit": " October 2017", "rating": "5", "title": "Great food!", "comment": "Good quality Turkish Restaurant with a wide choice of food. Friendly staff. Nice location. Reasonable prices.", "date_of_review": "2 October 2017"}
{"review_id": 100104, "restaurant_id": 294, "username": "MrMarkBennett", "date_of_visit": " December 2017", "rating": "4", "title": "Beautifully Marinated ", "comment": "Whilst perusing the Christmas Market on Wanstead High St we were recommended this Turkish Restaurant so popped in for lunch. Although clearly popular with locals we managed to get a table and quickly decided the grilled platter for two sounded perfect. We were given complimentary flat breads with dips and olives which were lovely and took the edge off our hunger.Just as we finished the breads our platter of pork, chicken, koftas and chicken wings arrived on a bed of rice. The meat was marinated beautifully, tasted great and having soaked up the juices the rice complimented it well. With a side of fries and a green salad we couldn’t manage dessert and left agreeing how it had been one of the best Turkish meals we’d had. ", "date_of_review": "3 December 2017"}
{"review_id": 100105, "restaurant_id": 294, "username": "Ruhat A", "date_of_visit": " December 2017", "rating": "5", "title": "Great restaurant for Nice food", "comment": "I have been there many times. All the mezes and main courses are really delicious. Every food is fresh. Service is very fast. You can enjoy your time in Gezi Park restaurant with your friends with their relaxing atmosphere. I strongly recommend lamb shish and lamb ribs. ", "date_of_review": "5 December 2017"}
{"review_id": 100106, "restaurant_id": 294, "username": "chrisdw7", "date_of_visit": " June 2017", "rating": "4", "title": "Good quality food at good prices", "comment": "Had dinner with my wife here one evening.  Good quality food and reasonably priced. Nice level of service with a good atmosphere", "date_of_review": "3 December 2017"}
{"review_id": 100107, "restaurant_id": 294, "username": "LoughtonGuy", "date_of_visit": " December 2017", "rating": "5", "title": "Very nice Turkish restaurant", "comment": "About 20% cheaper than central London, this Wanstead High Street Restaurant has a good selection, keeping both Veggies and meat eaters satisfied.Lovely food. There is a large, well maintained fish-tank with beautiful fish to look at while waiting for you food. Fully licensed.", "date_of_review": "18 December 2017"}
{"review_id": 100108, "restaurant_id": 294, "username": "Birol K", "date_of_visit": " December 2017", "rating": "5", "title": "Strongly recommend ", "comment": "Great food brilliant taste very friendly service would recommended Lamb shish very very much it will be the best you have ever tasted. Also I have to underline that prices are very reasonable comparing to other restaurants. ", "date_of_review": "5 December 2017"}
{"review_id": 100109, "restaurant_id": 294, "username": "Jakkles2", "date_of_visit": " January 2018", "rating": "5", "title": "Good food, great service", "comment": "Popped in here at 3.30 as had been sales shopping and missed lunch. Olives, and dips brought up with hot bread, lovely. We both ordered the chicken shish which was superb, really succulent. I think this is a really good family run restuarant.", "date_of_review": "4 January 2018"}
{"review_id": 100110, "restaurant_id": 294, "username": "al3xand3rth3g8", "date_of_visit": " December 2017", "rating": "5", "title": "The best Turkish Restaurant in Essex!!!", "comment": "Thank you Gezi park for the lovely evening The food was Delicious full of flavour specially  Lamb Liver and KingPrawn Casserole which I had and even my wife was happy with the whole sea bass. Great food  Highly Recommend ⭐️⭐️⭐️⭐️⭐️", "date_of_review": "4 January 2018"}
{"review_id": 100111, "restaurant_id": 294, "username": "Rob M", "date_of_visit": " December 2017", "rating": "5", "title": "Fantastic Turkish Restaurant ", "comment": "Great food cooked brilliantly, service was excellent. Take away available as well and is just as good. ", "date_of_review": "20 December 2017"}
{"review_id": 100112, "restaurant_id": 294, "username": "MartiniGold", "date_of_visit": " September 2016", "rating": "2", "title": "ok but not that great", "comment": "didn't really enjoy the meal.this was properly 2 yrs ago but i guess maybe i will try the restaurant again one day . ", "date_of_review": "23 August 2017"}
{"review_id": 100113, "restaurant_id": 294, "username": "DaPedro", "date_of_visit": " July 2017", "rating": "1", "title": "NEVER ORDER TAKEAWAY ", "comment": "It's with regret that I'm writing this, as I have had good food on the past. But as I usually always order takeaway I have found that more than half these times there are issues with my orders.  Usually its just a forgotten dish like bread or rice, which I can live with. But today I was waiting in the restaurant for more than 10 mins while my food was sitting on a table near the kitchen with no one checking to see if it was mine.  When I eventually got it and asked why no one checked the food, a waiter told me he didn't take the order on the phone and so it wasn't his fault. I said that's unprofessional as they're all from the same establishment, but she said he didn't care and blamed it on the chefs.  When I got home my food was cold and the portions were small.  I won't go there again, there are amazing Turkish restaurants on JustEat and Hungry House, plus they deliver! ", "date_of_review": "7 July 2017"}
{"review_id": 100114, "restaurant_id": 294, "username": "Lisa M", "date_of_visit": " July 2017", "rating": "5", "title": "Brilliant Restaurant", "comment": "The food is really tasty (the veggie mousakka and the mixed grill are especially recommended). The restaurant is nice inside and has some seating outside, if the weather permits. Also do takeaway which is equally good. Good price for quality.", "date_of_review": "19 July 2017"}
{"review_id": 100115, "restaurant_id": 294, "username": "Andrew S", "date_of_visit": " July 2017", "rating": "5", "title": "Fantastic food", "comment": "Stopping local and just wandering around found this gem of a place. Food really good quality, top value for money and helpful pleasant staff and you could just tell from the moment i arrived they would go the extra mile to assist. The restaurant itself is really clean and I will definitely be back when in town.", "date_of_review": "4 July 2017"}
{"review_id": 100116, "restaurant_id": 294, "username": "AllisonB1478", "date_of_visit": " June 2017", "rating": "3", "title": "Miserable waiter", "comment": "Visited on a warm evening and the restaurant was fairly busy with lots eating outside.  We sat inside - ordered starters and mains and bottle of wine. Reasonable price of £30 per head including tip.  The food was enjoyable however the experience was spoiled by a waiter who just looked really fed up and looked like he was enjoying his job. When 1 of my friends asked for an extra sauce he didn't even crack a smile.  I'm not saying I enjoy overbearing waiters however I thought a smile and asking 'if everything is okay' is normally common practice?  We nearly went to other Turkish restaurant - Otto - up the road but I'd suggested this one as I'd been a few times before. We will probably go there next time. ", "date_of_review": "15 June 2017"}
{"review_id": 100117, "restaurant_id": 294, "username": "holidaybuzz12", "date_of_visit": " July 2017", "rating": "5", "title": "Amazing food", "comment": "We booked a table here. Wow what a fab place. We ordered a platter which had kebabs.. chicken wings.. chicken breast chunks..lamb cubes on a bed of rice and salad. Was lovely. Reasonably priced too. Lovely staff. Will deffo return next time we are down south.", "date_of_review": "19 July 2017"}
{"review_id": 100118, "restaurant_id": 294, "username": "NorthernLinda", "date_of_visit": " July 2017", "rating": "5", "title": "Tasty Lamb Shish", "comment": "Have been numerous times before and last night was very enjoyable. A friendly welcome on arrival, served drinks and given menu without delay. Yakut house red wine most acceptable. Powerful chilli, olives, yoghurt dip and tasty flatbread brought to table whilst we waited (not long) for our food. Falafel crunchy to hard exterior, Kisir salad very tasty and fresh. Good portion of lamb in shish, guessing it must have been marinaded as well tender with excellent charring from the grill. (Hardworking grill station with efficient extraction). Rice moist with separate grains. Unexpected salad. Excellent meal, very good friendly service- will go again. Note to self: As a non-smoker I must remember to sit well within the room as sitting near the open door I could smell cigarette smoke from folks on the outside decking", "date_of_review": "28 July 2017"}
{"review_id": 100119, "restaurant_id": 294, "username": "Cornelio_Rel", "date_of_visit": " August 2017", "rating": "4", "title": "good service ", "comment": "I've been here once, the food was good, friendly stuff, nothing to complain. all good, I would recommend it", "date_of_review": "22 August 2017"}
{"review_id": 100120, "restaurant_id": 294, "username": "CJ170776", "date_of_visit": " August 2017", "rating": "1", "title": "Terrible Service", "comment": "I'm a vegetarian and occasionally restaurants mix up their orders and serve me a meat variety of the vegetarian meal I've ordered. This is pretty upsetting but in my experience, the manager usually appears, apologises a lot and does everything possible to make the evening enjoyable, despite the fact they've just accidentally made me eat a mouthful of meat.  Sadly this was not the case at Gezi Park, the waiter said a rather half hearted sorry & then left me watching my friend eating during the long wait until my replacement meal arrived, which then came with the wrong side! He bought us some complimentary halloumi & salad to make up for this 2nd mistake, but we were charged the full amount on the bill & no one checked we'd enjoyed our meal or apologised again. I would never go back and would advise vegetarians to avoid!", "date_of_review": "5 August 2017"}
{"review_id": 100121, "restaurant_id": 294, "username": "Ishvinder G", "date_of_visit": " August 2017", "rating": "4", "title": "Review of Gezi Park", "comment": "I came here midweek with some friends. I'd probably come again, bearing in mind I am vegetarian, the offerings were reasonable. My friends who had meat, said it was good and from what I saw it I'd probably say it looked better than the vegi I had. On the whole a good place to eat. ", "date_of_review": "9 August 2017"}
{"review_id": 100122, "restaurant_id": 294, "username": "alicev233", "date_of_visit": " June 2017", "rating": "5", "title": "Lovely meal ", "comment": "Went to this recently on 4th June had the hot meze to start contain calamari and cheese parcel thing and all different things had a small and it shared perfect between 2 there was 3 of us and also tried some of the Albanian liver.then for the main had the Gezi park palater of meat and rice for 3 people there was lots and lots of meat the rice was so nice and the bread given table at the start was so nice too.  Also had chips and salad with the main too. ", "date_of_review": "13 June 2017"}
{"review_id": 100123, "restaurant_id": 294, "username": "Natalie P", "date_of_visit": " February 2017", "rating": "5", "title": "Amazing, friendly service, and very tasty, delicious fresh Turkish food.", "comment": "My friend and I had a meal here last night, and I have to say, on my trip to London it has been the best meal out I've had.  The food really was superb and delicious, with complimentary hot breads and dips. I had the lamb casserole and my friend had the vegetable moussaka, both were prepared promptly and were well received by two hungry diners.  What really blew us away was the service in this restaurant - my friend recommended it as she lives in this area and has been many times - this was my first visit and what a delight it was. Sarah, one of the serving staff, was an absolute joy and really went above and beyond the call of duty! I lost a parking ticket and went to retrieve it after leaving, and she literally put her gloves on and rooted around the bins for me, and it was found, thankfully. I've been to many top restaurants In my life and I can safely say that Gezi Park is up there with the best in terms of service.  On top of all that, it's very friendly, welcoming, relaxed and inviting decor, and the food is genuinely delicious, plus it's very very reasonable in price.", "date_of_review": "28 February 2017"}
{"review_id": 100124, "restaurant_id": 294, "username": "antoniomartin87", "date_of_visit": " March 2017", "rating": "5", "title": "Good value for money", "comment": "I came here on a Saturday for lunch as my friends from Spain wanted to try something different. I had been here a few times and never been disappointed, so I knew this place was a win. We had Falafel and Humous as starters, and then we chose different things like Kebab, Moussaka, Princess Casserole with some beers. The price was very cheap, something very rare in the area these days! The service was outstanding as always. Definitely coming back soon!", "date_of_review": "13 March 2017"}
{"review_id": 100125, "restaurant_id": 294, "username": "c_1_x_m_", "date_of_visit": " April 2017", "rating": "5", "title": "wow superb kind people and perfect food", "comment": "i really love their Kebabs, My friends also love their foods.I have been there nearly 6 times and I strongly recommend their salads and \"kaburga (ribs)\" kebabs. The owners and all the staff are superb kinds... enjoy..it is ideal or friends, families, business or couples because the design of the restaurant is unique and smile:) it is to one of the best Turkish and Mediterranean restaurants I ever been in the UK", "date_of_review": "26 April 2017"}
{"review_id": 100126, "restaurant_id": 294, "username": "ipekersin", "date_of_visit": " March 2017", "rating": "5", "title": "Lovely restaurant", "comment": "I have been to this restaurant a good few times now and its amazing.. I would say best turkish place I have been to so far. The food is delicious, especially the lamb shish and the grilled prawns. Also the atmosphere and staff are all friendly and welcoming. I will definitely go back again soon..", "date_of_review": "31 March 2017"}
{"review_id": 100127, "restaurant_id": 294, "username": "Shen C", "date_of_visit": " March 2017", "rating": "5", "title": "I love this place!", "comment": "Gezi Park is defiantly the place to come to if you would love traditional Turkish food. I found this place about a year ago and I've never been disappointed. The customer service is amazing and all the staff are so friendly, I'm always greeted in seconds when walking in, which makes the atmosphere very pleasant to be in. There lahmacun and adana kofte is out of this world. I've been served by Sara on more then one occasion, and she's great and her job, very polite and efficient, but its the whole team that makes this place great.", "date_of_review": "8 March 2017"}
{"review_id": 100128, "restaurant_id": 294, "username": "ahseekT", "date_of_visit": " May 2017", "rating": "4", "title": "Always A Treat", "comment": "Always a pleasure eating here whether solo or with friends. The food has never let me down and I believe I've only sat indoors once, always eating on the deck outside and people watching. The staff is always pleasant and the prices are reasonable. ", "date_of_review": "16 May 2017"}
{"review_id": 100129, "restaurant_id": 294, "username": "905DaveA", "date_of_visit": " May 2017", "rating": "4", "title": "Saturday night and still good service ", "comment": "Ok the starters were very good and the service was pretty good I had the lamb casserole which was average but the other 3 of us had better food was told salad came with everything but it was a small salad  Reasonable prices and pretty good overall slightly better quality of food and you would get 5 stars ", "date_of_review": "7 May 2017"}
{"review_id": 100130, "restaurant_id": 294, "username": "Cocoarchitects", "date_of_visit": " May 2017", "rating": "5", "title": "Amazing menu!", "comment": "Pari one of the Waitresses suggested me the menu! And it was amazing, nice two dishes for very good price!!! And my Son get some chicken and he enjoyed like me!!!! Good for a father single day!!! ", "date_of_review": "23 May 2017"}
{"review_id": 100131, "restaurant_id": 294, "username": "Ola F", "date_of_visit": " May 2017", "rating": "5", "title": "Beutiful food", "comment": "I've been there already twice. And I'm sure I became regular. This place it's just great. Food is full of taste, you don't need anything else. Service is very polite, friendly and very.. quick.. sometimes too quick haha. Usually you can find this place as a busy and I'm not suprise.", "date_of_review": "8 June 2017"}
{"review_id": 100132, "restaurant_id": 294, "username": "T_Hotel_Inspectors", "date_of_visit": " January 2017", "rating": "3", "title": "standard turkish", "comment": "The seating make this much more of a restaurant with a seperate rear are carrying about 7 tables The only issue we found is the qualty of the chicken isn't notable neither is the small portions, but it doesn't pretend to be anything else", "date_of_review": "26 February 2017"}
{"review_id": 100133, "restaurant_id": 294, "username": "DavidO4450", "date_of_visit": " November 2016", "rating": "5", "title": "Review", "comment": "The food was fantastic and the staff were brilliant. I went on a Saturday afternoon around 16:00. I parked in the car park adjacent to Co Op supermarket. The price is very good too and I thoroughly recommend it to anybody considering it. It is clean and I ate Turkish food as they sell food from other countries.", "date_of_review": "14 November 2016"}
{"review_id": 100134, "restaurant_id": 294, "username": "LondonDebbieN", "date_of_visit": " December 2016", "rating": "4", "title": "Very good", "comment": "A good Turkish restaurant in Wanstead - tasty & succulent meats, lovely fresh bread and salads...basically what you would expect of a Turkish restaurant! Would happily return - Wanstead is a nice area too.", "date_of_review": "10 December 2016"}
{"review_id": 100135, "restaurant_id": 294, "username": "Chrissyh1time", "date_of_visit": " December 2016", "rating": "5", "title": "We eat here once a week at least!!", "comment": "Excellent food, always go for the chicken shish kebab, juicy and tender.  excellent staff, reasonably priced! You get all the added extras as you would expect from a meze- always eat more than we wanted to and come out absolutely full to the brim. Come here at least once a week. Love it!", "date_of_review": "10 December 2016"}
{"review_id": 100136, "restaurant_id": 294, "username": "m_brown0273", "date_of_visit": " November 2016", "rating": "5", "title": "Great grilled meats", "comment": "We go here regularly if I want a bit of a meat feast. The staff are polite and friendly, service is normally quick and efficient. I normally have the same thing, mixed grill and lamb chops. The meat is always superbly cooked, the lamb in particular is outstanding. The sides, e.g. variety of salads, hummus, Turkish bread, chilli sauce are also excellent, and the Turkish house wine is also decent. Possibly not the cheapest, but is still value for money, as the portions are a good size. I normally order too much, and take the remainder with me for breakfast the following day.", "date_of_review": "26 November 2016"}
{"review_id": 100137, "restaurant_id": 294, "username": "Sara M", "date_of_visit": " December 2016", "rating": "5", "title": "AWESOME!", "comment": "thank you so much for everything guys! it was just awesome!  amazing food and the environment is so cozy and the best place to stay in after a hard day at work.  I was really surprised about the professionalism from staff even on busiest times.  I will recommend this place to anyone who wants to spend theirs free short time after work and time off. ", "date_of_review": "17 December 2016"}
{"review_id": 100138, "restaurant_id": 294, "username": "nickywellington", "date_of_visit": " February 2017", "rating": "5", "title": "Stunning birthday dinner", "comment": "I decided to ask Gezi Park to host our mum's 80th dinner and it was one of my better decisions: the care and attention by Charlie, Sara, Hussein and the other staff was second to none and their welcome and warmth very touching. They helped us to decorate our private space and attended to our every need, including table layout, decoration, music and specific dietary needs. The food, as ever, was plentiful and magnificent, and the suggested wine worked beautifully with the yummy dishes. All our guests pronounced the night a great success! Thanks so much again to the team - we will be back!", "date_of_review": "20 February 2017"}
{"review_id": 100139, "restaurant_id": 294, "username": "Will L", "date_of_visit": " February 2017", "rating": "5", "title": "Fantastic food, service and atmosphere!", "comment": "Been to Gezi Park numerous times over the past few years and have always been delighted about the food, service and atmosphere.  Luckily for me I can walk to the restaurant from home however I would happily travel if I had to! I would recommend this restaurant for meals with mates, family and with partners, as well as the occasional take away which are just as good.  Also, great portion sizes! Always go home full! Thanks guys!", "date_of_review": "18 February 2017"}
{"review_id": 100140, "restaurant_id": 294, "username": "trickydickdicky", "date_of_visit": " January 2017", "rating": "5", "title": "Best Turkish food around", "comment": "Absolutely love this place. The food is tasty, the portions are great and I don't know how they do it but the accompanying salads are delicious. And, I'm not a big fan of Turkish food, generally it's just meat and rice but these guys go out of there way to impress.", "date_of_review": "31 January 2017"}
{"review_id": 100141, "restaurant_id": 294, "username": "gpd202", "date_of_visit": " February 2017", "rating": "2", "title": "Not so good", "comment": "We have visited a few times before as we enjoy Turkish food. Not a good experience this time. Service was friendly but patchy as 2 very large and noisy parties arrived. Food was hit and miss. the misses were a cold Turkish pizza and a seriously stale salad with putrid red cabbage that I couldnt even swallow accompanied by a rock hard old quarter of lemon that had turned brown. Mixed meze were like Iceland foods freezer selection. Its a cheap place no doubt but we will not return. There are now so many amazing places to eat in Wanstead that this is not in contention.", "date_of_review": "20 February 2017"}
{"review_id": 100142, "restaurant_id": 294, "username": "Fferffee", "date_of_visit": " August 2016", "rating": "4", "title": "Great Hummus", "comment": "The hummus was excellent and the service very friendly. Rest of the meal was pretty good as well. Nice evening out on the patio.", "date_of_review": "24 August 2016"}
{"review_id": 100143, "restaurant_id": 294, "username": "kelwells", "date_of_visit": " August 2016", "rating": "4", "title": "Good value lunch", "comment": "Visited with a friend for a lunch on lovely sunny day. The set lunch menu for 2 courses was great value. I had pide for starter and chicken beyti for main. Both were delicious and served quickly and pipping hot. With a soft drink worked out at £10 excellent value.", "date_of_review": "12 September 2016"}
{"review_id": 100144, "restaurant_id": 294, "username": "JustineV25", "date_of_visit": " September 2016", "rating": "4", "title": "Tasty and lots of it!", "comment": "I'm not usually a fan of Turkish food but at a business dinner I could not fault the food here. We had vegetarian starters of numerous sharing plates which included some feta parcels in filo pastry which were utterly delicious. Most had chicken or lamb for main courses and were pleased with their dishes - I had fish which was perfectly cooked. The service was excellent. We weren't rushed despite it being a busy a Friday evening. There's a good feel in the restaurant- it's casual; there were also a few loan diners who seems very content. ", "date_of_review": "4 September 2016"}
{"review_id": 100145, "restaurant_id": 294, "username": "suki_007_12", "date_of_visit": " November 2016", "rating": "5", "title": "EXCELLENT", "comment": "Had lunch here today after awful experience in The Cuckfield, two door down. Had a lovely lunch and staff were excellent, they even provide free food for homeless people which was lovely to see.", "date_of_review": "9 November 2016"}
{"review_id": 100146, "restaurant_id": 294, "username": "H3165KInicolac", "date_of_visit": " October 2016", "rating": "4", "title": "Excellent service great food", "comment": "We had a mix of starters and kebabs for main , everything was really good. Great taste, lots of options, really good service. I would definitely go back.", "date_of_review": "5 October 2016"}
{"review_id": 100147, "restaurant_id": 294, "username": "Clairerobbi", "date_of_visit": " September 2016", "rating": "5", "title": "great local restaurant", "comment": "Eat from Gezi Park regularly, either take away or inside. Staff are great, really friendly food is always excellent, haven't got a bad word to say about them. Now they have a banner saying free food for homeless people, so they are involved in charitable acts which makes them even better in my opinion. The Mousakka is my good, all kebabs tasty and the bread is fantastic.", "date_of_review": "26 September 2016"}
{"review_id": 100148, "restaurant_id": 294, "username": "Romdormer", "date_of_visit": " October 2016", "rating": "5", "title": "Late night feast", "comment": "Called in very late with some friends just arrived from France ... it was really finished for the night, yet we were made welcome, served delicious food ... all with a smile!  First class service AND delicious food!", "date_of_review": "7 October 2016"}
{"review_id": 100149, "restaurant_id": 294, "username": "388evelynr", "date_of_visit": " October 2016", "rating": "4", "title": "Good food", "comment": "GREat value and really good. I especially recommend the lamb shish. Staff are really friendly. Service was good. Worth a try!", "date_of_review": "24 October 2016"}
{"review_id": 100150, "restaurant_id": 294, "username": "Paul H", "date_of_visit": " September 2016", "rating": "4", "title": "Good value mezzes - friendly", "comment": "Saturday lunch time so only a handful of people in what is quite a large restaurant. Good mixed hot mezzes to share and decent house wine. Service friendly and efficient. Patio outside front would be great on a warm sunny day - people watching on the busy high street!", "date_of_review": "19 October 2016"}
{"review_id": 100151, "restaurant_id": 294, "username": "WhyNotHelp", "date_of_visit": " October 2016", "rating": "5", "title": "Meze", "comment": "Can't beat this place on quality or quantity in Wanstead. Defo try the calamari and the meze meatfests.", "date_of_review": "24 October 2016"}
{"review_id": 100152, "restaurant_id": 294, "username": "dilarap0lat", "date_of_visit": " August 2016", "rating": "5", "title": "amazing food and wonderful service", "comment": "Gezi park is definitely one of the best turkish restaurants i've been to, they have a good service with kind staff and delicious food. All in one. what more can a customer ask for? i highly recommend gezi park for everyone. it's the best place for birthdays, friends and family meals.", "date_of_review": "21 August 2016"}
{"review_id": 100153, "restaurant_id": 294, "username": "301susb", "date_of_visit": " July 2016", "rating": "5", "title": "The best Turkish food in London!", "comment": "My colleague is turkish and he took me and some other girls for what he called \"heavenly lamb ribs.\" I used to live near finsbury park where there is a big turkish community and hence many restaurants which i thought were really good. But after tonight it has totally changed and I loved every bit of all the dishes they served whole heartedly.  Succulent lamb ribs that had a lot to bite on, fresh salad, bread was sprinkled with oil and they also served really spicy turkish Chilly I loved so much. Service was great, they constantly checked on us and everything was presented nicely and the restaurant was clean. Good ventilation so its authentic charcoal grill didn't soak your clothes with bbq fumes.  What's more, I was never into turkish sweets as they normally come soaked in sugar/honey syrup but this one was different and i recommend everyone to try for sure. My colleague said it's home made style and they make it on the premise and it's very hard to come by in London. I had a great night with gorgeous food. If I lived close by i'd definitely come every week!", "date_of_review": "11 July 2016"}
{"review_id": 100154, "restaurant_id": 294, "username": "TypingMountain", "date_of_visit": " June 2016", "rating": "5", "title": "A good reason to visit Wanstead", "comment": "We've been to Gezi Park more than a dozen times over the past two years, and the experience is so consistently excellent that we're ashamed for not having written a review yet. This is one of a few great restaurants on the Wanstead High Street, but if you're seeking excellent Turkish in London, it's well worth the tube fare to E11. A versatile menu, expertise behind the grill and thoughtful service make this place unique. It's also great value.  Before any of the dishes arrive, there's fresh pita with olives and sauces -- the chilli sauce is just the right kind of spicy. The salad is always pleasantly surprising. Try the halloumi and sucuk and the albanian liver if that's your speed, but the mezze menu is extensive with plenty of tamer options. The kebabs are a lot of food for a couple -- we usually order one meat and one vegetarian dish. My mouth is literally watering as I think of the lamb. We're not into dessert, and yet we always order the baklava.  The hard-working staff are friendly and accommodating, although I can't imagine needing anything that isn't happily given already. Many months ago, we once watched a troublesome table hassle the waiter for something that was their own fault. I mention this only because the waiter and manager responded with impeccable grace. I was already sold on the food, but it was nice to catch a glimpse of the character of the business.  Gezi Park got deservedly busier after winning the Guardian Food Awards, so call for a table. Early in the night tends to be a better bet for a walk-in meal.", "date_of_review": "9 July 2016"}
{"review_id": 100155, "restaurant_id": 294, "username": "N7271HKsaraht", "date_of_visit": " July 2016", "rating": "5", "title": "Birthday meal ", "comment": "Lovely resturant. amazing food cooked beautifully. gorgeous settings. will defo be coming here again. Food was reasonably priced too. yum!", "date_of_review": "16 July 2016"}
{"review_id": 100156, "restaurant_id": 294, "username": "Alina A", "date_of_visit": " July 2016", "rating": "5", "title": "Excellent service, comprehensive menu", "comment": "I love how cozy and welcoming the place is. It's in a quite posh area and it definitely meets the standards. Lovely fish tank that completes the relaxing atmosphere. Plenty of vegetarian dishes to choose from, too. The food is delicious, the prices accessible and the staff are very polite and professional. ", "date_of_review": "14 July 2016"}
{"review_id": 100157, "restaurant_id": 294, "username": "Kimmi T", "date_of_visit": " July 2016", "rating": "5", "title": "Great food and service!", "comment": "Great food and great service. Starters were fab (had the mix cold starters) and the main was the yoghurt kofte which I would reccommend. Would definitely go back there!", "date_of_review": "25 July 2016"}
{"review_id": 100158, "restaurant_id": 294, "username": "morgana222", "date_of_visit": " August 2016", "rating": "5", "title": "Lamb chops to die for! ", "comment": "Outstanding lamb chops; don't be a chump and order moussaka, you MUST try the lamp chops. It's about £25 a head with wine and the main courses are enormous; it's not necessary to order starters too. ", "date_of_review": "21 August 2016"}
{"review_id": 100159, "restaurant_id": 294, "username": "Frankzii", "date_of_visit": " July 2016", "rating": "1", "title": "disappointing", "comment": "Arranged an evening meal with good friends at Gezi in Wanstead . The food was average if not below. However, worst of all staff was dead keen to ensure quick turnover following the EAT AND LEAVE motto. Never again!!!", "date_of_review": "30 July 2016"}
{"review_id": 100160, "restaurant_id": 294, "username": "alison_6000", "date_of_visit": " July 2016", "rating": "5", "title": "Fantastic sea bass", "comment": "We sat on the terrace one warm Friday evening a couple of weeks ago. We ordered a sea bass, a sword fish, a glass of yakut Turkish wine and a beer. A couple of minutes later some hot turkish bread and dips arrived. I love that Turkish restaurants still give you freebies, when so many restaurants charge for every last crumb now. The sea bass was fantastic. Large, fresh and with a crispy griddled skin. Delicious. My partner's swordfish was equally lovely. Service very pleasant. Highly recommended.", "date_of_review": "15 August 2016"}
{"review_id": 100161, "restaurant_id": 294, "username": "Sag0r", "date_of_visit": " July 2016", "rating": "5", "title": "Chicken Wings are Fab!!!", "comment": "I use this place time to time for a quick take away. Food is absolutely amazing. Chicken wings or lamb chops they are both equally delicious. Love this place. ", "date_of_review": "5 August 2016"}
{"review_id": 100162, "restaurant_id": 294, "username": "Ali A", "date_of_visit": " June 2016", "rating": "5", "title": "A must visit!", "comment": "Sat outside on a beautiful day with a nice view of the park to my left. The staff were all very friendly, professional and attentive. Food tasted absolutely delicious and the speed at which the food came out was really pleasing! The adana kofte large was juicy, well flavoured and overall, very tasty! The side salad accompanying the dish was such a good portion, it could have been served as a main in many other places. The constant top up of sauces and bread without request was excellent! The bill for two came to £21.50 and was worth every penny! Also, try their scrumptious Turkish pizza!", "date_of_review": "20 June 2016"}
{"review_id": 100163, "restaurant_id": 294, "username": "cml017", "date_of_visit": " May 2016", "rating": "5", "title": "Excellent Turkish Cuisine", "comment": "Good quality food well cooked. Attentive service. Share a starter platter if you want room for your main. Very pleasant Turkish wines to go with the food.", "date_of_review": "25 May 2016"}
{"review_id": 100164, "restaurant_id": 294, "username": "MissyL77", "date_of_visit": " May 2016", "rating": "2", "title": "Average over priced food", "comment": "First and last visit unfortunately. Food was bland and very over priced in comparison to other Turkish restaurants I have visited. I had lamb chops. £15.95 for 4! Very dry, bland and no taste. Was not impressed at all. Starters were ok. Bread and dips. Wine was £18 for bottle of Pinot Grigio. Omg the cheapest nastiest wine ever. So acidic...... no name brand just a cheap £3 bottle selling for £18 if you ask me. Staff nice. Also nice that you can sit outside. But for me the food was disappointing.", "date_of_review": "21 May 2016"}
{"review_id": 100165, "restaurant_id": 294, "username": "angie63", "date_of_visit": " April 2016", "rating": "5", "title": "Great food and service", "comment": "Lovely fresh food, a great selection and the best chilli sauce and bread. The staff here are just so friendly you feel like they're friends. I love the fact that the food is cooked in front of you so you can see how fresh it is. Highly recommend. ", "date_of_review": "19 May 2016"}
{"review_id": 100166, "restaurant_id": 294, "username": "Tania M", "date_of_visit": " April 2016", "rating": "4", "title": "Funeral Wake", "comment": "We were looking for somewhere different to hold my Mother-In-Laws wake, something different to a pub with sandwiches and crisps. We wanted a relaxed place for reflection, time for the family to get together and chat about their good memories, no where noisy or intrusive. Gezi Park really did us proud. We were unsure of the numbers that would attend the wake so had to estimate. On the day, we had fewer people than we estimated, this was no issue. The food was great, in fact it was perfect. The staff were most welcoming and accommodating. Even doggie bags to go were no issue. Gezi Park did us proud, no disappointments at all and we are so pleased we close this venue. Thank you to all the staff that made that day a perfect ending, a day never to be forgotten, memorable forever. .", "date_of_review": "16 May 2016"}
{"review_id": 100167, "restaurant_id": 294, "username": "Sat_Rihal", "date_of_visit": " June 2016", "rating": "2", "title": "Not the best Turkish place at all", "comment": "Group of 20...Had a good time with our friends, but as for the food, VERY disappointed...the cold and hot meze was not up to scratch, hot consisted of what I'm sure was mostly frozen Iceland food, deep fried! Some veggie samosa, spring roll and maybe one piece of calamari, amongst some other small veggie items! HARDLY impressive. The main again was not at all impressive, was expecting a lot more food. The price agreed was to be £14pp ALL IN. This was fobbed off at the last minute when the sneaky service charges were added...VERY UNPROFESSIONAL!! Had a very similar meal about a month prior (Soray Sofrasi, Gants Hill) payed £12pp, got a lot more food, better service, and NO sneaky charges added to the bottom of the bill. Please avoid this place, get yourself some proper Turkish food in you and go elsewhere.", "date_of_review": "7 June 2016"}
{"review_id": 100168, "restaurant_id": 294, "username": "JMTravelReviewsTA", "date_of_visit": " June 2016", "rating": "4", "title": "Good Food", "comment": "I enjoyed the mixed appetizers and Mediterranean olives more than my entree. For my entree, I ordered the lamb shish. It was seasoned/marinated very well, but the lamb was very fatty. I did not find a good piece of meat on my plate. I also tasted the chicken wings. It was also well seasoned/marinated, and contained more meat than the lamb. For dessert, I ordered the chocolate fondant cake. I was very disappointed. It tasted like a slice of cake you can get from the local grocery store. For some reason, I expected the dessert to be better than the main course, yet it wasn’t. It was ice cold (almost like ice cream), which made it seem like it wasn't \"homemade\"; I could not taste the yummy, both healthy and unhealthy, ingredients that a standard chocolate cake contains since it had been sitting in a fridge most of the day. However, I would recommend this restaurant. The well-decorated interior is very inviting, and the food overall caters to and satisfies one’s taste buds.", "date_of_review": "7 June 2016"}
{"review_id": 100169, "restaurant_id": 294, "username": "898ewelinar", "date_of_visit": " June 2016", "rating": "5", "title": "Fresh and tasty food", "comment": "Great food, friendly service & reasonable prices. Choice of meat and veggy only based dishes. I will definitely return her when opportunity arise.", "date_of_review": "5 June 2016"}
{"review_id": 100170, "restaurant_id": 294, "username": "mariangela146", "date_of_visit": " June 2016", "rating": "4", "title": "Gezi park restaurant", "comment": "Good customer service.  I tried chicken shish with yoghurt and it was good, althought the bread underneath was a little bit hard.  For the rest, everything was fine. Recomended", "date_of_review": "15 June 2016"}
{"review_id": 100171, "restaurant_id": 294, "username": "Sara M", "date_of_visit": " June 2016", "rating": "5", "title": "Awesome place !! Awesome food & prices!!", "comment": "We was looking for a reetaurant where i can see vegetarian menu, and also with food hygiene rate mininum 4 stars. We've been welcome by really nice staff and helpfull with us! Good service from staff and knowledge about menu. Environmental impact was sparkling well presented. Wifi connections, massive fish tank, well presented plaiting well trained staff. I will go there any time again. Strongly recommend for anyone any time.  Love it! ", "date_of_review": "17 June 2016"}
{"review_id": 100172, "restaurant_id": 294, "username": "Shazia001", "date_of_visit": " February 2016", "rating": "4", "title": "The best chilli sauce ever!", "comment": "I prefer Gezi Park over Otto. There I said it. Why? Because the customer service is great, I can see them cook my food, the bread is beautiful and the meat cooked is fantastic. There's a nice atmosphere, there is always a table available and very reasonably priced.  Go there people of Wanstead, it's not Green Lanes but the closest we'll get.", "date_of_review": "28 February 2016"}
{"review_id": 100173, "restaurant_id": 294, "username": "grwindowcleaninge11", "date_of_visit": " September 2015", "rating": "5", "title": "Fun", "comment": "Had a meal with my nan, mum uncle, aunt and wife.  Good staff. Tasty food. Great lunchtime value. Memorable..", "date_of_review": "1 March 2016"}
{"review_id": 100174, "restaurant_id": 294, "username": "Gwen M", "date_of_visit": " April 2016", "rating": "4", "title": "We were the last to leave!", "comment": "My friend and I went there for dinner in April as a last minute decision and we were so glad we did! Having visited there once in the summer at least a couple of years ago and I would say, there was nothing special about it. But so much has changed since then!!! The quality and standard has gone up quite a few notches! The food was absolutely delicious, large portions and beautifully presented. The staff were very friendly and accommodating and couldn't do enough to ensure we had a good experience there. Perfect choice of wine recommendation too! I have visited Otto's many times but this is absolutely my favourite choice now, because the food is far better, the staff are most definitely friendlier and the value excellent.  We had such a lovely time that my friend and I were the last one's there but we didn't realise this and at no time were we made to feel we had to leave. Thank you Gezi Park for a fabulous evening, I look forward to returning soon.", "date_of_review": "10 May 2016"}
{"review_id": 100175, "restaurant_id": 294, "username": "Pelefant", "date_of_visit": " March 2016", "rating": "4", "title": "Delicious grilled meats", "comment": "We have eaten here many times and the grilled meats are delicious, in particular the lamb kebabs and chops. The staff are very friendly and attentive. ", "date_of_review": "6 March 2016"}
{"review_id": 100176, "restaurant_id": 294, "username": "WinM21", "date_of_visit": " March 2016", "rating": "5", "title": "Great food!", "comment": "Popped in here for their 2 course lunch - huge portions, great service and delicious food. This was recommended to me by a friend and was definitely worth it.", "date_of_review": "3 March 2016"}
{"review_id": 100177, "restaurant_id": 294, "username": "iboli", "date_of_visit": " April 2016", "rating": "5", "title": "Excellent service amazing food", "comment": "I had been with my friend's. Staff was friendly and smiling. Food was excellent perfect.I never eat this kind of meat. Thank you gezi park ", "date_of_review": "4 April 2016"}
{"review_id": 100178, "restaurant_id": 294, "username": "jnaw", "date_of_visit": " April 2016", "rating": "5", "title": "Great Find", "comment": "Found this while on a short break in London What a find, great Turkish food Enjoyed every mouth full, and there were plenty of them. Service great,food excellent, bill very reasonable If you are anywhere near try this place", "date_of_review": "6 April 2016"}
{"review_id": 100179, "restaurant_id": 294, "username": "hvblondon", "date_of_visit": " May 2016", "rating": "5", "title": "Never disappoints! ", "comment": "Food here is always good.. Never had a bad meal and I have been well over 10 times. The kebabs always come with plenty of meat, rice and salad.. Plus free bread and dips when you arrive. Chicken beyti has become a new favourite and the baklava is out of this world!! ", "date_of_review": "2 May 2016"}
{"review_id": 100180, "restaurant_id": 294, "username": "Debra M", "date_of_visit": " April 2016", "rating": "4", "title": "Delicious meal!", "comment": "Enjoyed a very tasty and beautifully cooked meal. I have lost count at the times I have visited this little gem. Lovely attentive and polite staff. Food is served and presented in a very appetising way. Good friendly atmosphere and look forward to visiting again very soon.", "date_of_review": "27 April 2016"}
{"review_id": 100181, "restaurant_id": 294, "username": "skankhound", "date_of_visit": " March 2016", "rating": "3", "title": "Good for lunch", "comment": "Went here for late lunch. The food was ok. Flavours were ok but a bit lacking in seasoning. The waiter didn't really seem to understand what Gluten Free meant when asked and consequently we were served the kebab on pitta. We pointed this out and a more attentive waitress took control and brought us a new dish so no harm done.", "date_of_review": "25 April 2016"}
{"review_id": 100182, "restaurant_id": 294, "username": "Bright_Bug", "date_of_visit": " January 2016", "rating": "5", "title": "Love it here ", "comment": "Have been 3-4 times and never disappointed. The fresh Turkish food is delicious and great service. It's a quiet place, not the most busy and popular in wanstead but that also makes it charming for a low key lunch or dinner.  The bread is delicious as are the lamb (grill) dishes. Portions are very generous and we usually end up taking some leftovers home. ", "date_of_review": "1 January 2016"}
{"review_id": 100183, "restaurant_id": 294, "username": "Mervyn B", "date_of_visit": " January 2016", "rating": "5", "title": "Excellent", "comment": "Went with my daughter and her fiancé We had a fabulous meal it was X absolutely delicious and will definitely go back when next in London.  We ordered too much but still pleasantly surprised with the bill. Great value for money ", "date_of_review": "26 February 2016"}
{"review_id": 100184, "restaurant_id": 294, "username": "sereh7", "date_of_visit": " December 2015", "rating": "4", "title": "great local restaurant ", "comment": "I've eaten here quite a few times over the the last year and it's been consistently good. The food is great, fresh and tasty. There's a great choice, including healthier options and vegetarian choices. The portions are huge, always come away with a doggy bag! Staff are lovely, always a warm welcome and the restaurant has a relaxing feel, very laid back.  The prices are a little high but willing to pay for good quality and convenience of location. ", "date_of_review": "13 January 2016"}
{"review_id": 100185, "restaurant_id": 294, "username": "cemrem", "date_of_visit": " January 2016", "rating": "5", "title": "Amazing food and amazing service", "comment": "I ordered mixed plater for my family.I like lamb sis and lamb kofte is very tasty and atmosphere is very nice. ", "date_of_review": "14 January 2016"}
{"review_id": 100186, "restaurant_id": 294, "username": "alijoe69", "date_of_visit": " January 2016", "rating": "4", "title": "Highly Recommended", "comment": "This was my first visit, but it will not be my last. Had a family lunch here, the service was 1st class, staff really friendly, but most importantly, the food was wonderful. Highly recommend.", "date_of_review": "26 January 2016"}
{"review_id": 100187, "restaurant_id": 294, "username": "289danielleg", "date_of_visit": " January 2016", "rating": "5", "title": "Love this place ", "comment": "Great food, wine and atmosphere. This place is a must visit of you live in the East London area.  The chicken Shesh is very yummy. ", "date_of_review": "30 January 2016"}
{"review_id": 100188, "restaurant_id": 294, "username": "sam b", "date_of_visit": " February 2016", "rating": "4", "title": "Take away lunch", "comment": "Had a wrap for lunch from here hulloumi it was lovely good size it comes with salad in it too  Really recommend it ", "date_of_review": "4 February 2016"}
{"review_id": 100189, "restaurant_id": 294, "username": "Aiste M", "date_of_visit": " January 2016", "rating": "4", "title": "good food, genenours portions", "comment": "Like : nice place  very generous portions good quality plenty of choice on the menu . Dislike : ladies working there are quite rude 10£ menu deal is not available on weekends", "date_of_review": "16 February 2016"}
{"review_id": 100190, "restaurant_id": 294, "username": "lynnkirby", "date_of_visit": " February 2016", "rating": "4", "title": "Good Turkish restaurant", "comment": "Enjoyed a meal here last night on a night out with a friend.  Staff welcoming and friendly, very good service. Food good quality, typical Turkish.  Yes there are a few cheaper Turkish restaurants as some have pointed out, but it really wasn't overpriced.  Only small negative is the main was served a couple of minutes after we finished the starter, would have liked a breathing space. Would not put us off going again", "date_of_review": "20 February 2016"}
{"review_id": 100191, "restaurant_id": 294, "username": "evelyn464", "date_of_visit": " December 2015", "rating": "2", "title": "Over charged for drinks food of poor standard", "comment": "There are a lot of nicer Turkish restaurants this is very poor standard of food chops full of fat jug of Pimms £20.00 just made 3 glasses would like a response", "date_of_review": "25 December 2015"}
{"review_id": 100192, "restaurant_id": 294, "username": "mattwG6223SS", "date_of_visit": " January 2016", "rating": "4", "title": "Stunning food and great service", "comment": "The food here is some of the best meze around, generous portions, everything done to perfection and the staff are really friendly, I can't speak higher of this place", "date_of_review": "18 February 2016"}
{"review_id": 100193, "restaurant_id": 294, "username": "Firat A", "date_of_visit": " September 2015", "rating": "5", "title": "Excellent service amazing food", "comment": "The service provided was excellent really good communication skill with costumers. The food was amazing highly recommended.", "date_of_review": "23 September 2015"}
{"review_id": 100194, "restaurant_id": 294, "username": "Scoffs G", "date_of_visit": " October 2015", "rating": "4", "title": "Nice", "comment": "Nice people and nice atmosphere food is always fresh, reasonably priced and great portions. Coban salad was fantastic thanks guys", "date_of_review": "26 October 2015"}
{"review_id": 100195, "restaurant_id": 294, "username": "DanB3261", "date_of_visit": " October 2015", "rating": "5", "title": "Fantastic Food", "comment": "We were very impressed with the quality of food at Gezi Park. I recommend the swordfish shish, it was clearly the best sword fish I have ever tasted world wide.", "date_of_review": "9 October 2015"}
{"review_id": 100196, "restaurant_id": 294, "username": "969ruthh", "date_of_visit": " October 2015", "rating": "5", "title": "Turkish Gem in Wanstead E11", "comment": "Way too long since last visit and review. Lovely welcome, and everything as it should be. Excellent all round. Very good. Lovely.", "date_of_review": "2 November 2015"}
{"review_id": 100197, "restaurant_id": 294, "username": "David R", "date_of_visit": " November 2015", "rating": "4", "title": "Tasty turkish", "comment": "Everything was to a good standard in this place. The friendly attentive family atmosphere, the visible Kebabs sizzling over the charcoal grill, the colourful lively fish in the fish tank. The place has character and is well popular. The starters were very tasty and the lamb and aubergine was delicious, albeit a bit on the greasy side. The Turkish coffee rounded it off very nicely thank you.", "date_of_review": "25 November 2015"}
{"review_id": 100198, "restaurant_id": 294, "username": "AhmetC502", "date_of_visit": " December 2015", "rating": "5", "title": "Our new find", "comment": "Had a nice evening out here with my wife and we both thoroughly enjoyed it. Had the lamb ribs and iskender both were delicious. Service was friendly and warm. Will definitely recommend and will be returning very soon.", "date_of_review": "19 December 2015"}
{"review_id": 100199, "restaurant_id": 294, "username": "Janer l", "date_of_visit": " December 2015", "rating": "5", "title": "Great Turkish food", "comment": "I was there Last week with friends, had a lamb shish , it was soft and tender plus juicy which i like the most. And had baklava after loved it too...  They have a nice front decking with a lovely view of the park... Wide range of drinks as well.  Overall nice to be there...", "date_of_review": "18 December 2015"}
{"review_id": 100200, "restaurant_id": 294, "username": "LjLondon12", "date_of_visit": " October 2015", "rating": "3", "title": "Just OK", "comment": "Ive been to many Turkish Restaurants, but for me, this was a bit overpriced. It looked nice inside and out but there prices are about £5-7 more than average restaurants. When the food arrived the portions were very small, compared to other Turkish restaurants. The staff did not welcome there customers and did not communicate much with anyone, which I found a bit of a let down. The card machine did not work so we had to go to a cash machine but I felt a bit uncomfortable. There was no atmosphere and we were sat by a drafty window. It was not the worst restaurant but I would not go back, I would rather sit in McDonalds. Liven up the place, smile a bit more and look like you want customers, is my suggestion.", "date_of_review": "31 October 2015"}
{"review_id": 100201, "restaurant_id": 294, "username": "BRSevim", "date_of_visit": " August 2015", "rating": "5", "title": "Amazing Restaurant ", "comment": "Very good service and friendly staff. Atmosphere is perfect. I've had lamb shish and chicken shish. Very well cooked and just the way I want it. ", "date_of_review": "13 August 2015"}
{"review_id": 100202, "restaurant_id": 294, "username": "Dalealicia", "date_of_visit": " September 2015", "rating": "5", "title": "Amazing mixed grill", "comment": "The food is wonderful. Olives and chilli/garlic dip are provided as a starter. There are some decent wines on the menu. Probably the best charcoal grill in the area. The lamb, kofte and chicken are all delicious. The salads that accompany the meats are excellent and unexpected, thought has gone into them. And it comes with rice and bread. Service is friendly, although when it's busy it can understandably be a little slow. Looking forward to going back!", "date_of_review": "16 September 2015"}
{"review_id": 100203, "restaurant_id": 294, "username": "mehmetavci21", "date_of_visit": " December 2015", "rating": "5", "title": "Thank you", "comment": "Everything is very nice and delicious, the staff friendly and polite. service was good, food portions are big enough and satisfying. the venue is very nice and cheap prices", "date_of_review": "19 December 2015"}
{"review_id": 100204, "restaurant_id": 294, "username": "nadinaazara", "date_of_visit": " February 2015", "rating": "5", "title": "5 Stars!!", "comment": "The food is excellent whether you are eating in or taking away! If you have the time I would suggest to eat in! The staff were lovely and the food was fantastic! Especially the lamb chops and the Sutlac rice pudding! ", "date_of_review": "18 August 2015"}
{"review_id": 100205, "restaurant_id": 294, "username": "judith c", "date_of_visit": " July 2015", "rating": "4", "title": "Lovely food and friendly staff", "comment": "We, friends from work, have been here a few times. The food is lovely, especially the starter platters. Prices are reasonable and the staff are very helpful. The service is quick enough for a lunch hour but not rushed if you want to take longer. Have been there in the evening once and the standard was just as good.", "date_of_review": "13 August 2015"}
{"review_id": 100206, "restaurant_id": 294, "username": "otolith", "date_of_visit": " August 2015", "rating": "4", "title": "Great vibe, lovely staff, well-prepared Turkish fare", "comment": "Caught up with some friends at this lovely little Restaurant in smart Wanstead high street. The restaurant is fronted by a nice patio area that overlooks a park. Great for a cup of tea or a beer. Inside the decor is homely with a nice mural of Göreme and a fish tank.  The staff are great and friendly. The food was timely as cooked to perfection. Grilled meats are cooked there and then on display. The mezes are lovely, especially the aubergine dish, and served with the most perfect bread. For the main I had the slow cooked lamb shank, which fell of the bone and which I was able to eat with a spoon, it was so tender! Gorgeous. Prices slightly high for Turkish food but not unreasonable. Given the entire package I would say that it's one of the better Turkish restaurants I've been to in London and there are many!", "date_of_review": "17 August 2015"}
{"review_id": 100207, "restaurant_id": 294, "username": "Kelly M", "date_of_visit": " May 2015", "rating": "5", "title": "The best turkish food in london", "comment": "The service it was perfect  The atmosphere amazing the food delicious we had the jumbo platter everything especially hasan was friendly and kind thank you for everything it was amazinggggggggggggg defently we will come back .. recommended for everyoneeeèe", "date_of_review": "25 August 2015"}
{"review_id": 100208, "restaurant_id": 294, "username": "Happylicious", "date_of_visit": " August 2015", "rating": "5", "title": "Perfect!!!", "comment": "Amazing food anazing location with lovely friendly staff! I was let down by next door oriental chef had hair in the food and took the food back and saw this Gezi park and went inside to get something from there. They were very welcoming and totally.exeeded my expectations!", "date_of_review": "31 August 2015"}
{"review_id": 100209, "restaurant_id": 294, "username": "Rebecca M", "date_of_visit": " August 2015", "rating": "3", "title": "Good Turkish Takeaway ", "comment": "We live just round the corner and have been using Gezi Park as our preferred Turkish takeaway ever since.  Go for their grilled meat options, which are all very good. Their lamb beyti is particularly delicious. I'm also a fan of their freshly grilled Turkish bread, and which is prepared to order. Warm and savoury from the grill, it's a real treat.  The basics are all there, and they're really good. I wish that they would put as much effort into their mezze as their meat, which still lags behind competitors like Mangal 2 in Hackney.  More thought into other sections of the menu and some homemade authentic Turkish desserts and this place would be a real gem. At the moment, it's a diamond in the rough. ", "date_of_review": "26 August 2015"}
{"review_id": 100210, "restaurant_id": 294, "username": "Leon G", "date_of_visit": " September 2015", "rating": "5", "title": "Review ", "comment": "The service was excellent. They make you feel special. I don't usually enjoy fresh Tuna but I decide to take a chance. I was glad I did as it was the best I have ever tasted. ", "date_of_review": "3 September 2015"}
{"review_id": 100211, "restaurant_id": 294, "username": "Paul H", "date_of_visit": " September 2015", "rating": "2", "title": "Very bad take away", "comment": "Tried this place again as it was the only one still open. Had a baby chicken dish that was so over cooked and dry it was inedible. Had chicken wings which consisted of a few cheap mid section wings and no drumettes, the rice was a tiny portion, stone cold and the salad similarly a miserly portion of well past it's best soggy limp leaves soaked in that ghastly pomegranate juice which I asked them not to put on. With a couple of other bits that I ordered (many places give you a dish or two free) the bill came to over thirty pounds which was terrible value for money. I won't be going back again,", "date_of_review": "7 September 2015"}
{"review_id": 100212, "restaurant_id": 294, "username": "Jenny B", "date_of_visit": " August 2015", "rating": "5", "title": "Nice meal out", "comment": "Very good service. Food excellent, we enjoyed mixed cold meze, lamb casserole and wonderfully creamy princess chicken", "date_of_review": "7 August 2015"}
{"review_id": 100213, "restaurant_id": 294, "username": "Sean W", "date_of_visit": " June 2015", "rating": "5", "title": "Excellent experience at Gezi Park in Wanstead", "comment": "I received a warm welcome when I arrived at the restaurant to sit down, I was offered to sit outside in the sun - it was awesome! I was offered a cool drink to go alongside straight away! The staff are extremely friendly, always making sure we had enough! The staff always ask how we are and that is a great touch. The food is AMAZING! Lots a variety from chicken to veg and all cooked to perfection. It is definitely the best place to eat in the area and can't wait to go back! I would highly recommend the service, experience and the food to anyone! Thanks Gezi Park! :)", "date_of_review": "11 July 2015"}
{"review_id": 100214, "restaurant_id": 294, "username": "PandaBoy786", "date_of_visit": " June 2015", "rating": "4", "title": "Foods deffo Amazing", "comment": "The food is definitely worth a try. 5 stars to the 2 Turkish chefs behind... Nice restaurant thought bit pricey. Had a bit of service issues but then, its not an upmarket posh restaurant so no high expectations!! Worth a try for sure...", "date_of_review": "3 July 2015"}
{"review_id": 100215, "restaurant_id": 294, "username": "IanGraham2010", "date_of_visit": " July 2015", "rating": "2", "title": "Very Disappointing", "comment": "We went for dinner last night. It was our first time in this restaurant and we had been quite keen to try it. I don't think we'll be going back. The food was poor - poor quality, lacked flavour, not very well prepared (poorly prepared minced lamb with bits of bone and grizzle throughout) and everything was just badly presented. I have had better food from takeaway outlets. As for the service, well I have been in cafes that have provided a better level of service.", "date_of_review": "16 July 2015"}
{"review_id": 100216, "restaurant_id": 294, "username": "Rachel H", "date_of_visit": " July 2015", "rating": "5", "title": "Miss Rachel Hunt", "comment": "I visited this restaurant with friends. The food, service and atmosphere was superb. We usually go to shish in Chigwell but this restaurant food was the best Turkish food I have ever had. The prices were so reasonable and the quality of food was excellent. Can't wait to go back with my family and friends. Thank you to the staff for a most enjoyable evening ", "date_of_review": "18 July 2015"}
{"review_id": 100217, "restaurant_id": 294, "username": "Pınar K", "date_of_visit": " July 2015", "rating": "5", "title": "excelllent servedd", "comment": "I went to Gezi Park last night with my friends,we ate yoghurt with lamb it was absolutely fabulous. The waiter was really friendly and fast. i cant wait to go there again with my family.", "date_of_review": "20 July 2015"}
{"review_id": 100218, "restaurant_id": 294, "username": "dadas1960", "date_of_visit": " August 2015", "rating": "5", "title": "Dadas", "comment": "Excellent food, excellent service, Pearl of Wanstead we need that type of class restaurant in our aera. Highly recommended place for every out goers. ", "date_of_review": "6 August 2015"}
{"review_id": 100219, "restaurant_id": 294, "username": "Sabrina Z", "date_of_visit": " July 2015", "rating": "5", "title": "Amazing food", "comment": "I moved to live into Wanstead a few months and this is one of my favourite restaurants. Food is always fresh and perfectly cooked, simply amazing.", "date_of_review": "19 July 2015"}
{"review_id": 100220, "restaurant_id": 294, "username": "Basilsingh", "date_of_visit": " August 2015", "rating": "3", "title": "Average Turkish But could be Better", "comment": "The restaurant has a nice feel and is clean. Four of us had lunch here. The service was good but the main meal came before we had finished the starters which was not nice since the restaurant was empty during lunch and there is no need for it. Out of the four starters only the falafel and the calamari were nice. The main meals were fairly ordinary with limp salad and tasteless rice.  Parking is available on the road", "date_of_review": "6 August 2015"}
{"review_id": 100221, "restaurant_id": 294, "username": "Abs Z", "date_of_visit": " August 2015", "rating": "5", "title": "delish", "comment": "Service was always great, what I always look for is a clean restaurant and this was clean and hygienic. Always come back here.", "date_of_review": "4 August 2015"}
{"review_id": 100222, "restaurant_id": 294, "username": "Abdullah I", "date_of_visit": " June 2015", "rating": "5", "title": "Very good Turkish kitchen ever !!", "comment": " I was in gezi park restaurant on father's day with my family for dinner We had big plate to share (gezi special 3 i highly recommend to everybody ) it was nicely cooked and served. compliments to cheffs by the way price was also reasonable for fathers' s day we will definitely be back guys ", "date_of_review": "26 June 2015"}
{"review_id": 100223, "restaurant_id": 294, "username": "Hilmi K", "date_of_visit": " June 2015", "rating": "5", "title": "Perfect restaurant", "comment": "I have been to this restaurant couple of times. I think its one of the best ones i have been to. Amazing food. Friendly staff very good customer service. I have had take away from this restaurant as well that was quality as well. Nice price as well. Definitely recommend it to everyone.", "date_of_review": "2 June 2015"}
{"review_id": 100224, "restaurant_id": 294, "username": "bedriye K", "date_of_visit": " June 2015", "rating": "5", "title": "One of the best restaurant!!!", "comment": "I have been to this restaurant couple of times with my friends. I think its one of the best turkish restaurants that I have been to. The food was amazing!! the staff was very Friendly and very good customer service. Definitely recommend it to everyone.", "date_of_review": "5 June 2015"}
{"review_id": 100225, "restaurant_id": 294, "username": "clairesS1454OZ", "date_of_visit": " June 2015", "rating": "5", "title": "18th birthday celebrations ", "comment": "Absolutely WOW went here with a group of 16 on Saturday for my daughters 18th birthday celebrations including four little kiddies, service fantastic,great friendly staff and the food was fantastic !!definitely worth a visit .  Great night had by all", "date_of_review": "14 June 2015"}
{"review_id": 100226, "restaurant_id": 294, "username": "Jamie W", "date_of_visit": " June 2015", "rating": "5", "title": "Spot on!", "comment": "Great food, nicely spaced tables. Efficient and friendly service. Entertaining fish tank! Price is reasonable in relation to the area and nice added extras like watermelon.", "date_of_review": "12 June 2015"}
{"review_id": 100227, "restaurant_id": 294, "username": "Gürkan H", "date_of_visit": " June 2015", "rating": "5", "title": "Amazing food", "comment": "It was my second time visiting gezi park the food and the stuff was so great like the last time i was there with my five other friends two of my friend had a sea bass and four of us had mix kebab and some starters and the bill was very resonble best turkish we ever had i recomend it too every one who wants too visit this place.", "date_of_review": "16 June 2015"}
{"review_id": 100228, "restaurant_id": 294, "username": "969ruthh", "date_of_visit": " June 2015", "rating": "5", "title": "Turkish Gem in Wanstead E11", "comment": "Another very , very good meal at Gezi with friends and family. Meat is amazing and Eddie and Julya hosts with the mosts. Great buzz.", "date_of_review": "20 June 2015"}
{"review_id": 100229, "restaurant_id": 294, "username": "Tonireidx", "date_of_visit": " June 2015", "rating": "5", "title": "Lovely restuarant.", "comment": "Such a lovely restuarant with very helpful and friendly staff. The food is to great standard and i would recommend people to try it out hope you enjoy it as much as i do!!", "date_of_review": "17 June 2015"}
{"review_id": 100230, "restaurant_id": 294, "username": "Zak f", "date_of_visit": " June 2015", "rating": "5", "title": "Does not disappoint...", "comment": "Fund this place a few months ago, and after visiting some of the other Turkish grills in and around the area, decided to give this place a go. food is amazing, as i often tend to go with a group, we always go for the mixed grill platters, and tastes much better than most of the other places in the area. Service is really good (have not had any reason to complain), and try their best to accommodate requests. table needs to e reserved particularly on Saturdays. if these guys did delivery, that would be amazing!!!", "date_of_review": "22 June 2015"}
{"review_id": 100231, "restaurant_id": 294, "username": "Jenny S", "date_of_visit": " June 2015", "rating": "5", "title": "Brilliant on Every Level", "comment": "We just wanted somewhere to grab a very late lunch on the way home, as we were starving, and driving past, saw it was still open. The pleasant waitress confirmed they were still serving lunch, and pointed out the lunch offer. 2 courses: £7.95, or 3 for £9.95. This turned out to be incredible value, when we got our food, as the quality and size of dishes was much higher than you would guess for that price. We opted for the 2 courses, and chose different dishes, so we could share. I had a glass of wine from the very reasonably priced wine list, and when asking for a glass of tap water, was given a whole jug, with ice, mint and lemon. Way beyond the call of duty! The food came quickly, but not suspiciously so, and everything we chose was delicious, especially Mucver, a courgette croquette dish, which we had never heard of before. The waiter charmingly told us what herbs were used, when we asked about it. We also loved the green bean starter, Yesil Fasulye. The toilets were also spotlessly clean, though for those with disabilities, they are downstairs, and could be a struggle. We were absolutely delighted with the whole experience, and will definitely be back.", "date_of_review": "25 June 2015"}
{"review_id": 100232, "restaurant_id": 294, "username": "shantell1987", "date_of_visit": " June 2015", "rating": "1", "title": "Gezi park restsurant", "comment": "This restaurant is da worst turkish restaurant i have ever been to. da lamb rib was like chewing gum, da chips were massive da meat was burnt da rice was bland da dips were shockingly boring they served me and my kids hot hot chilli sauce and a small garlic sauce for 5 ppl, the staff were rude da manager was flirting with the male customers and didnt attend to us at all. Please please AVOID IF U CAN NOT CHILD FRIENDLY", "date_of_review": "1 June 2015"}
{"review_id": 100233, "restaurant_id": 294, "username": "hasandevici", "date_of_visit": " April 2015", "rating": "5", "title": "Not a foot wrong...", "comment": "The most delicious authentic Turkish food to be had in town. Taste, presentation and portions exceptional, and service charming and attentive. Nothing too much for the team, and will be back. Book though...we just got in, and a very pleasurable experience. Highly recommended.", "date_of_review": "18 April 2015"}
{"review_id": 100234, "restaurant_id": 294, "username": "TunCay Levent A", "date_of_visit": " April 2015", "rating": "5", "title": "Perfect :)", "comment": "I have been here for a meal with my girlfriend, although it was busy, they managed to find us a table within minutes. We had calamari and halloumi for starters followed by lamb chops and lamb shish. The lamb was probably the best I have had in a long while. Service was also very friendly and efficient. Will definitely return soon. Well worth a visit", "date_of_review": "24 April 2015"}
{"review_id": 100235, "restaurant_id": 294, "username": "ZuzoC1", "date_of_visit": " April 2015", "rating": "5", "title": "Very pleasant", "comment": "I have visited here for the first time with my wife and 2 little girls, we have enjoyed the meals throughout, my children and we were made to feel very welcomed which made it even better. They have a beautiful fish tank which grabbed the attention of the kids. The meat were very tasty and cooked to perfection. Overall we were very please And will return without doubt", "date_of_review": "26 April 2015"}
{"review_id": 100236, "restaurant_id": 294, "username": "BarbaraHJ", "date_of_visit": " April 2015", "rating": "2", "title": "Avoid busy Saturday nights and avoid the fish!", "comment": "We went on a Saturday evening at the end of April and were shown to a table behind the large fish tank. We were out of site of the staff, and out of mind. It took ages to order drinks and for dips and starters to arrive. Other tables which were occupied after we sat down were served well before us. Our second bottle of wine never arrived, though to be fair wasn't added to the bill either. Staff ran in with plates of food, whacked them down and scuttled off, impossible to catch anyone's eye. My main course of salmon cost £15 and was served with anaemic chips and a boring side salad. It was a thin tail portion, really not suited to grilling, and was overcooked, leathery and uneatable. No-one came to check on us while we were eating and by the time the plates were cleared, we just wanted to leave. The chopped fruit served alongside the bill was good though. I've had good lunches here before, and it's a shame that the standard of service and food just can't be maintained on a busy Saturday evening.", "date_of_review": "3 May 2015"}
{"review_id": 100237, "restaurant_id": 294, "username": "BubbleBlowerEssex", "date_of_visit": " April 2015", "rating": "4", "title": "Very busy, & noisey", "comment": "We did not book & for a Saturday night they told us to return in 30 minutes & they had a table for 4 ready. Had a lovely cold meze starter which sorted us out. I had a shish & it was very nice. others all had Kleftico but instead of Lamb shank it was shoulder. It was a good evening with a few drinks about £60 a couple.", "date_of_review": "7 May 2015"}
{"review_id": 100238, "restaurant_id": 294, "username": "lavJen", "date_of_visit": " April 2015", "rating": "5", "title": "Better turkish than in turkey!", "comment": "So glad this is on my high street! The bread that they serve here is LUSH! The mains have never let me down, all taste yummy. Very good and friendly service. And dare i say the Turkish food in this restaurant is better than what I had in Istanbul? There i said it!", "date_of_review": "16 May 2015"}
{"review_id": 100239, "restaurant_id": 294, "username": "cemrem", "date_of_visit": " May 2015", "rating": "5", "title": "Home away from home", "comment": "Visited this place for the first time and i must admit i was pretty much amazed. Me and my wife with our little girl decided to visit here after reading the positive reviews and made the perfect choice. We had a few starters followed by lamb ribs. All were delicious and the lamb ribs were the best we had that we even ordered some to take home. It was a very relaxing atmosphere and felt like home. The location is also superb with green just opposite. Service was also very friendly and made us feel welcomed. Cannot wait to visit again. All in all it was a perfect meal out and well worth a try.", "date_of_review": "6 May 2015"}
{"review_id": 100240, "restaurant_id": 294, "username": "Bethan L", "date_of_visit": " May 2015", "rating": "5", "title": "Wonderful family run Turkish!", "comment": "Have visited this restaurant many times while working temporarily in the area. The staff were always very kind and welcoming. The food is always excellent, chicken shish is the best you'll get! The lunch menus are amazing value. Would recommended highly and will come out this was just visit this restaurant!", "date_of_review": "12 May 2015"}
{"review_id": 100241, "restaurant_id": 294, "username": "kurann", "date_of_visit": " May 2015", "rating": "5", "title": "Ash k", "comment": "Amazing food great staff. Buzzing atmosphere. Already planning my next visit.!!!! If you want great Turkish food then you must try GEZI park", "date_of_review": "18 May 2015"}
{"review_id": 100242, "restaurant_id": 294, "username": "Tupscyprus", "date_of_visit": " March 2015", "rating": "4", "title": "Nice Place", "comment": "Always a busy restaurant, nice atmosphere, food nice, lots of salads ands dips.service good. Would return.", "date_of_review": "11 April 2015"}
{"review_id": 100243, "restaurant_id": 294, "username": "LaineyT31", "date_of_visit": " March 2015", "rating": "5", "title": "Great food, can't stop visiting", "comment": "I live down the road from this place and in the last few weeks have been in about 4 times. The food is excellent and really reasonable. When it first opened I wasn't too sure about it, but in recent months they've obviously found their feet and it's improved no end. They do takeaway too, which is probably going to play havoc with my waistline because I have to walk past it every night on the way home from work! Highly recommended. Gets pretty busy on a weekend so you definitely need to book.", "date_of_review": "18 March 2015"}
{"review_id": 100244, "restaurant_id": 294, "username": "Monnus", "date_of_visit": " March 2015", "rating": "5", "title": "Best Turkish food this side of the Golden Horn", "comment": "I've been working in Stratford this week and staying up the road from this restaurant. I've ended up having my evening meal from Gezi Park 4 evenings out of 5. All the food I've had has been excellent and everyone at the restaurant is very welcoming.", "date_of_review": "19 March 2015"}
{"review_id": 100245, "restaurant_id": 294, "username": "Paul R", "date_of_visit": " March 2015", "rating": "5", "title": "Excellent food and friendly staff", "comment": "I attended today with work colleagues. The staff were really friendly, the food was cooked to perfection and there was a constant supply of fresh grilled bread with chilli sauce and mint between courses The ambience was just right and there was a mix of business people and families. I have been a few times now but unfortunately I live out of the area. I could do with something like this where I live....lucky Wanstead. I don't normally do this type of thing but I have been consistently impressed and credit where credits due. Paul Redmond", "date_of_review": "27 March 2015"}
{"review_id": 100246, "restaurant_id": 294, "username": "Paul H", "date_of_visit": " January 2015", "rating": "3", "title": "Keep an eye on your food and count your chicken cubes", "comment": "Eaten in here and had carry out. When you eat in, they bully you around , where to sit, when to order, grab and snatch things, bark at you and all very rushed. When you have take out the skewers of meat that are put on the grill seem to drastically reduce in numbers and you only get a few cubes put in your take away. So keep an eye on what you get as they seem to take bits off. Chicken seems pumped full water and not usual texture but edible. Very small portion salad given and meal padded out with bread. Not best I've had in the area. Little man (boss maybe) dictating to you when and where to stand and sit is a really annoying guy. Had to tell him to leave us alone.", "date_of_review": "25 March 2015"}
{"review_id": 100247, "restaurant_id": 294, "username": "Shm00", "date_of_visit": " March 2015", "rating": "5", "title": "Great Turkish food ", "comment": "This place is a find. There are no big surprises - it simply serves very good quality and well cooked traditional Turkish food at very reasonable prices. The service is friendly and prompt, making this place ideal for a quick bite after work, or a more leisurely meal.", "date_of_review": "29 March 2015"}
{"review_id": 100248, "restaurant_id": 294, "username": "X1668MTdavidr", "date_of_visit": " February 2015", "rating": "4", "title": "Turkish Delight", "comment": "Great Meze, great meat and fish kebabs, lovely flat bread , couple of bottles of Efes. Friendly and attentive waitress, not too pricey, job done", "date_of_review": "1 April 2015"}
{"review_id": 100249, "restaurant_id": 294, "username": "Siinemm", "date_of_visit": " March 2015", "rating": "5", "title": "Gem of Wanstead", "comment": "Never dissapointed with this place. Meat and bread are always fresh and tasty in a way you cant find anywhere else. Warm atmosphere and friendly service. Definately worth a visit for first timers.", "date_of_review": "4 April 2015"}
{"review_id": 100250, "restaurant_id": 294, "username": "969ruthh", "date_of_visit": " March 2015", "rating": "5", "title": "It doesn't get better than this.", "comment": "Home from home, but better food! Out with friends with lots to catch up on. No fuss, laden plates, fresh and tasty, and the ever attentive Julya and Charlie looking after us. A real pleasure every time. Thank you Eddy!", "date_of_review": "2 April 2015"}
{"review_id": 100251, "restaurant_id": 294, "username": "mum5035", "date_of_visit": " April 2015", "rating": "1", "title": "Worst service and food ever", "comment": "We visited this restaurant on Friday night, there were 6 of us. The service from all the waiters/waitresses was dreadful, the worst service I have ever encountered in a restaurant. They were rude as we asked if we could change tables due to a large party making an awful lot of noise next to us. They brought up main courses before the starter plates had been removed. They collected plates even though people were still eating. I did say to the waiter someone is still eating and he said \"I know\"! The food was very sparse and overcooked.One of our party asked for chips instead of rice to be told NO we cannot do that, so we had to order another portion of chips. When the main meal arrived I said I thought all the main meals came with salad and was told that salad would be coming separately. We had 2 small bowls of salad between 6 of us. The salad had no dressing and was not chopped like a good Turkish restaurant normally does. The staff were very scruffy as was the restaurant. We would never return to this restaurant and advise every body else to avoid. The meals were also very expensive compared to other good Turkish restaurants.", "date_of_review": "7 April 2015"}
{"review_id": 100252, "restaurant_id": 294, "username": "Roderick L", "date_of_visit": " March 2015", "rating": "5", "title": "Excellent and friendly service and good food to boot!", "comment": "It was a birthday dinner and the restaurant gave me an excellent dish fruit to share at the end of your meal. I had a delicious mushroom dish, followed by a lamb dish. The waiter was helpful and entertaining. We all enjoyed the food and the service very much.", "date_of_review": "17 March 2015"}
{"review_id": 100253, "restaurant_id": 294, "username": "JMCOl", "date_of_visit": " February 2015", "rating": "5", "title": "Fantastic wedding reception at Gezi Park, Wanstead", "comment": "We had our wedding reception at Gezi Park restaurant on Valentine's Day. Our guests loved the food which was plentiful, well prepared and nicely presented. We had the entire rear section of the restaurant to ourselves which was large enough to accommodate 31 guests and private enough without imposing on other customers. The staff were courteous and very helpful in decorating the tables for us. They worked hard on the day and made our wedding reception a memorable and stress free experience.", "date_of_review": "17 February 2015"}
{"review_id": 100254, "restaurant_id": 294, "username": "london_traveller9", "date_of_visit": " February 2015", "rating": "3", "title": "Good but poor service", "comment": "In comparisons to other Turkish restaurants the food was very good but more on the pretty looks, small portion side, but good quality. The venue is nicely decorated but the atmosphere was dire for lunch. You could hear a pin drop, it almost felt awkward to speak, maybe a bit of music would help and some social interaction from the waitresses, possibly a smile just to break the otherwise strangely tense atmosphere. The venue certainly charges at the higher end for Turkish food in London, but falls well short with service. I spent ages, along with a few other diners staring into what felt like a black whole when trying to get the attention of the waitresses during a time when the restaurant was not busy. It felt like extreme effort for the waitresses to provide a friendly level of service, which essentially let the whole experience down", "date_of_review": "15 February 2015"}
{"review_id": 100255, "restaurant_id": 294, "username": "Orpheus79", "date_of_visit": " February 2015", "rating": "3", "title": "Overpriced turkish food", "comment": "I went to this restaurant for lunch with a client on Monday 23rd February. I regularly eat in turkish restaurants in north London, Edmonton, palmers Green, Stroud green, Haringay… I usually order the standard mixed grill and it is normally between £23 and £28 depending on where you go. The compatible mixed grill at this restaurant was £45 with a smaller one excluding lamb chops at £35 which is the one we went with. So approx. £10 more for less food, i was expecting something pretty amazing. The food was decent enough, lamb ribs succulent and it was all quite tasty, but the rice portion, bread portion and salad portion were not great and overall I think it was very poor value for money and what I would have expected to pay in Kensington or Central London somewhere. I wouldn't go back to this restaurant as there are so many better ones that are 25% cheaper relatively nearby.", "date_of_review": "25 February 2015"}
{"review_id": 100256, "restaurant_id": 294, "username": "nickywellington", "date_of_visit": " February 2015", "rating": "5", "title": "Wonderful lunch on a rainy day", "comment": "My sister, mum and I very much enjoyed our lunch at Gezi Park last week. The food was freshly cooked, memorable and brought back fond memories of holidays in Turkey. We had calamari and filo pastry rolls to start, chicken shish and moussaka to follow, then ended the meal with fresh baklava and Turkish coffee. Everything was delicious and carefully prepared by an obviously very competent chef, and the portions were very generous. The owner (who also served us) was friendly, smiley and chatty. The place was spotlessly clean and cosy. The bill for the three of us was £46.00, which must be a bargain for a three-course meal in London! We would thoroughly recommend Gezi Park and we will be going back.", "date_of_review": "26 February 2015"}
{"review_id": 100257, "restaurant_id": 294, "username": "Dorann56", "date_of_visit": " March 2015", "rating": "5", "title": "Great atmosphere good service and food", "comment": "My friend and I tried this restaurant for the first time. Staff very attentive, food was wonderful, prices reasonable to. Will definitely be returning.", "date_of_review": "10 March 2015"}
{"review_id": 100258, "restaurant_id": 294, "username": "Roy H", "date_of_visit": " March 2015", "rating": "4", "title": "Enjoyable first visit", "comment": "Super friendly staff, we had a few laughs,shared two different starters and calamari were superb ! main course I picked Lamb ribs,rice and trimmings, my friend chose Lambs liver,rice and trimmings. just wash down with G&T's and finished with a Turkish coffee,baklava and turkish delight. This was an on the spot choice and very enjoyable, Will return soon.Roy", "date_of_review": "11 March 2015"}
{"review_id": 100259, "restaurant_id": 294, "username": "Evalina M", "date_of_visit": " March 2015", "rating": "5", "title": "Atmosphere was really nice", "comment": "Staff was very welcoming, food was nice, deserts especially. Really recommend to eat at this place!!", "date_of_review": "9 March 2015"}
{"review_id": 100260, "restaurant_id": 294, "username": "YJan", "date_of_visit": " February 2015", "rating": "1", "title": "Shoddy service and rude waitress", "comment": "We booked a table for 4 adults and a high chair for our child. The table they set aside was completely unsuitable so had the child in my lap for the entire meal.  We also ordered the mixed mezze, and they served this and within a minute brought out our main meals. There was now not enough room on our table.  I asked why the main had come out so soon and the waitress told us that when we booked we had been told we had to leave by 20.30. It was only 19.17 at the time. I pointed this out and they then took the main meal away. The waitress at this point was rude.  Heaven knows what they did to it, but I got a heavily charcoal grilled meal back about 20 minutes later.  Absolutely shoddy service and meal was probably spat in. I would not recommend this place if you want to sit down and enjoy your food.  I would recommend Mezze in Woodford Green or even Shish (a but bitter than Gezi). At least they know how to treat their customers. ", "date_of_review": "28 February 2015"}
{"review_id": 100261, "restaurant_id": 294, "username": "KsMum2013", "date_of_visit": " March 2015", "rating": "3", "title": "good lunch time deal", "comment": "food was nice, good deal, i found the waitress very rude...when i asked for water at room temp...her reaction was ' i dont control how it comes out of the taps'... there was a man there who was helpful/friendly...maybe the manager ...i did complain but they didnt seem to take it very seriously but he did serve me room temp water", "date_of_review": "13 March 2015"}
{"review_id": 100262, "restaurant_id": 294, "username": "969ruthh", "date_of_visit": " February 2015", "rating": "5", "title": "Lovely quiet working lunch", "comment": "I have already raved about this place, but thought it would be good to try it in a different context to normal dinner: going through papers, and needing to write on a pit stop time frame, and little budget at lunchtime. Just the same, although the only noticeable difference was that I was put to the quiet tables at the back, music was turned down, and I was completely left alone. Wi-fi working? Check. Fixed price of £7.95 good value? Check. Lentil soup and lamb ribs and salad delicious? Check. Ice and lemon in tap water? Check. Another 5 stars. Bang on. Just right. Job done.", "date_of_review": "11 February 2015"}
{"review_id": 100263, "restaurant_id": 294, "username": "Nosheenbrohi", "date_of_visit": " December 2014", "rating": "4", "title": "Good Turkish food", "comment": "We were given complimentary starters of baked bread and tomato chutney which was a yummy prelude to the mains. The mains we had ordered was a very tasty dish of chicken shish yogurtlu. The ambience was average but the food is very good. The staff are curteous and friendly overall. Service was good. I would certinly recommend this place to frriends and family. Good value for money too. The mains is enough for 2 to share.", "date_of_review": "23 January 2015"}
{"review_id": 100264, "restaurant_id": 294, "username": "Danielle W", "date_of_visit": " January 2015", "rating": "5", "title": "A lovely evening with friends and family", "comment": "Six of us went for dinner tonight (Thursday evening). For five of us it was the first time. Staff were extremely welcoming and kind. Atmosphere was very relaxing. We were the second table to arrive, but the last to leave! The food was delicious, we had a selection of dishes for both starters and main which we all shared. It was all beautifully cooked and extremely tasty. The lamb chops were a firm favourite. We are all local to the area and will definitely go back. Thank you Gezi Park for a lovely evening.", "date_of_review": "22 January 2015"}
{"review_id": 100265, "restaurant_id": 294, "username": "Terri1408", "date_of_visit": " January 2015", "rating": "5", "title": "Turkish Man Delighted", "comment": "My wife and I have been going to this restaurant since its opened and haven't had a night that I couldn't be more pampered by the professional service and not forgetting to mentioning the high standard of food with generous portions.", "date_of_review": "26 January 2015"}
{"review_id": 100266, "restaurant_id": 294, "username": "19KEM77", "date_of_visit": " February 2015", "rating": "5", "title": "Superb", "comment": "I like to try different places but I must say the food here was excellent...., the meat could melt in your mouth. I will be going here again more often, the service and decor is of a high standard and the atmosphere is very good too..., the prices could be a little better but I guess you get what you pay for but the lunch menu is great value.... I would say it a must if your a meat lover... ", "date_of_review": "3 February 2015"}
{"review_id": 100267, "restaurant_id": 294, "username": "KevinLowryMullins", "date_of_visit": " November 2014", "rating": "1", "title": "Gezi Park - Wanstead High Street", "comment": "I think the name should be lamb kebab with lighter fuel. I have been here twice and the first time I went in the service was alright but the food tasted of lighter fuel. When I managed to catch the waiter and explained he did replace it but it still tasted of lighter fuel. I suspect the charcoal grill is started with flaminant and that is what I tasted anyway went back early lunchtime and the same thing happened so wont be going back again. Wine is overpriced as well.", "date_of_review": "2 February 2015"}
{"review_id": 100268, "restaurant_id": 294, "username": "Darlow201", "date_of_visit": " October 2014", "rating": "5", "title": "Top quality", "comment": "This truly is a restaurant that you will visit again and again. The staff are amazing and attentive. The food is just amazing very tasty cooked fresh and served with passion. It's not one of those places where you never see the owner. The owner of Gezi park is around a lot making sure the customers are happy a real nice man who genuinely cares. You must visit this restaurant and you will not be disappointed 5 stars from me.", "date_of_review": "26 January 2015"}
{"review_id": 100269, "restaurant_id": 294, "username": "Stefan A", "date_of_visit": " February 2015", "rating": "5", "title": "Turkish food brought to England", "comment": "Very Very nice authentic Turkish food excellent starters and then bettered by the main course. Very nice atmosphere and great value for money too you wont leave feeling hungry believe me", "date_of_review": "9 February 2015"}
{"review_id": 100270, "restaurant_id": 294, "username": "Bob H", "date_of_visit": " February 2015", "rating": "5", "title": "Great find amongst the plethora of eateries in Wanstead", "comment": "We had invited some friends to join us for lunch, something we do on a regular basis. One couple travelled from the Guildford area and the other couple from Cambridge. We consider ourselves as foodies and travel to various areas to try whatever is on offer. Having read the reviews through Tripit we decided to go for a Turkish fare.not wanting to take a chance, i called ahead 24 hours and made a reservation for 6 for 1pm. We arrived on time and were shown to our reserved table in this nicely appointed restaurant. The service was great and after perusing the menus we had our drinks, which consisted of 1 bottle of Perrier water, a Cranberry juice, a bottle of Merlot and a Gin and Tonic. The menu was large and there was a fixed lunch section as well as a separate al a carte menu. We ordered Taramasalata, Albanian Liver, Tatsiki and along with copious amounts of bread accompanied by a delicious chili based dip, very moorish. The main course was Moussaka, Lamb chops, Lamb skewer and the 3 guys shared a Gezi Park special. We were warned prior to the special arrived about not overindulging in the delicious bread and dips. The meals were all beautifully cooked and prepared and served. We finished off by taking Turkish coffee accompanied by home made Turkish delight and Baklava.  We were all impressed by the standards, cleanliness and ambiance, definitely a find in amongst all the eating establishments in and around Wanstead. as far as value for money, spot on.  I expect that if you want to have a good meal or even a special occasion then its probably expedient to make a reservation. You wont be disappointed. A great find and thank you for allowing us to enjoy your fabulous fare.", "date_of_review": "10 February 2015"}
{"review_id": 100271, "restaurant_id": 294, "username": "Fenerbache_Paul", "date_of_visit": " February 2015", "rating": "5", "title": "My Second Kitchen!!", "comment": "This place is excellent...I only live around the corner and it truly is my second kitchen!! I really enjoy the food, its always freshly prepared and there's a wide range of dishes on the menu. So much so in fact that a commited carnivore like myself has tried, and enjoyed, a number of their vegetarian offerings. I've been to many a Turkish restaurant in my time and without doubt this rates as one of the best.  The staff are great to deal with, friendly and helpful from the moment you step foot inside the door. Quick service and professionalism are the hall marks of the kitchen and waiters alike.  I'd highly recommend a visit the next time you're in the Wanstead area and you fancy a good meal whether you're solo, with friends or family. Tell them Fenerbache Paul sent you and they'll look after you!!", "date_of_review": "4 February 2015"}
{"review_id": 100272, "restaurant_id": 294, "username": "122stewarth", "date_of_visit": " November 2014", "rating": "5", "title": "Satisfied first timer", "comment": "Took 2 colleagues from work on Sunday afternoon. Very relaxed atmosphere. Really enjoyed the mixed meze for 3 which was more than adequate. Calamari was perfect. Really good service. Overall an excellent afternoon out. Went to the loo and noticed the bin was getting a little full. Went an hour later and it had been emptied. Maybe the most unecessary part of my review but it goes to show the attention to detail. Will return without a doubt.", "date_of_review": "11 January 2015"}
{"review_id": 100273, "restaurant_id": 294, "username": "Erdi C", "date_of_visit": " October 2014", "rating": "5", "title": "Perfect!!", "comment": "One of best meals I had in a very long time I would recommend this to anyone with their magnificent food, reasonable prices and a very classy atmosphere ", "date_of_review": "11 November 2014"}
{"review_id": 100274, "restaurant_id": 294, "username": "Alexx3353", "date_of_visit": " October 2014", "rating": "5", "title": "Excellent food", "comment": "I have ben this restaurant ones Thé food is excellent. Spacily Sinem waiter Thank you very much. See you sun again.", "date_of_review": "22 October 2014"}
{"review_id": 100275, "restaurant_id": 294, "username": "saira k", "date_of_visit": " November 2014", "rating": "5", "title": "Fantastic Food By the Chef: Ali :)", "comment": "The food was great!! I went there with some friends and my sister. Recommended by my work colleague. It was Friday night so the restaurant was extremely busy. The food still came out in reasonable time, the service was really friendly. The chef made the food in front of you - looked very authentic. Who was very Lovely and friendly (Ali). Such a lovely evening - the atmosphere was very pleasant. The restaurant looks very classy, I would definitely recommend this restaurant to all my friends and family. You must try. Kind Regards  Reshma", "date_of_review": "14 November 2014"}
{"review_id": 100276, "restaurant_id": 294, "username": "foodloveraliceinan", "date_of_visit": " November 2014", "rating": "5", "title": "Fabulous !", "comment": "Booked for a table of four at gezi park restaurant and so glad I did . We were seated straight away and meet at the door felt very welcomed . The waitress was lovely and very hands on . The food is cooked infront you in a very clean kitchen. Nice soft music playing and dimmed light's such a warm feeling . The portions are very reasonable and the food is priced well . Food was cleared from the tables befor the next meal . Would highly recommend this restaurant . Thankyou gezi park ", "date_of_review": "21 November 2014"}
{"review_id": 100277, "restaurant_id": 294, "username": "Onder16", "date_of_visit": " November 2014", "rating": "5", "title": "excellent and excellent :)", "comment": "I am a Turkish and taste of food and smoothies are very very delicious.I have been there 4 times and i strongly recommended lamb ribs, ezme and baklava. You can test very tasty aryan and fruits as well. Have e great time:)", "date_of_review": "30 November 2014"}
{"review_id": 100278, "restaurant_id": 294, "username": "silan22", "date_of_visit": " November 2014", "rating": "5", "title": "Good food right service", "comment": "I have visited this restaurant a number of times with my family, I always go for the ribs which Are cooked to perfection. The atmosphere and ambience is amazing. The staff are always kind and attentive with a smile. Would definitely recommend.", "date_of_review": "7 December 2014"}
{"review_id": 100279, "restaurant_id": 294, "username": "257JassR", "date_of_visit": " November 2014", "rating": "4", "title": "Great food, great service and great atmosphere", "comment": "It was my second time at this restaurant, we hadn't booked and though it was a Saturday night and very busy we were accomdated for very quickly to a table.  You are always welcomed at the door with a smile and great service being looked after throughout your dinner.  The food was amazing, selection and variety of food means that there is something to accomodate for everyones needs and tastebuds. The dishes are made freshly in front of you in the open kitchen which is very clean and well maintained.  We also ordered some food for take out and this was catered for on time and with the same great service and quality.  Highly recommend this place if you would like great food and reasonable price with the a great atmosphere.", "date_of_review": "1 December 2014"}
{"review_id": 100280, "restaurant_id": 294, "username": "48charlie", "date_of_visit": " November 2014", "rating": "5", "title": "Best BBQ", "comment": "Every week we go to gezi park restaurant, sometimes we order take away. It has amazing barbecued food, it also has turkish meze's. It has a very friendly atmosphere. One thing that's not good for us, is that it is always busy. Also we have to always arrange a reservation to avoid disappointment.", "date_of_review": "20 December 2014"}
{"review_id": 100281, "restaurant_id": 294, "username": "969ruthh", "date_of_visit": " November 2014", "rating": "5", "title": "Turkish Gem in Wanstead E11", "comment": "This family run restaurant won 2 National awards in 2014: both International Food Overall Winner and Readers Choice in the Guardian Food Awards. That's Best in Show in the UK and deservedly so. Easy to overlook for Review on the grounds of close proximity and frequency of visits. The food is outstanding: lamb chops and the freshest pomegranate salad to die for and the Malbec superb. All served up by Julya and the team with charm and hospitality. I don't know anyone with a bad or mediocre word to say. Oh, and good value too, with said lamb chops and Malbec at £25/head, although plenty of veggie and mocktail options if that is not your thing. One of the very best. Really.", "date_of_review": "10 January 2015"}
{"review_id": 100282, "restaurant_id": 294, "username": "Carl_Suarez_Nuckley", "date_of_visit": " July 2014", "rating": "4", "title": "Excellent Turkish meal!", "comment": "We went for a walk in Wansted. After a few walks around the area and with a very hot temperature, my girlfriend and I, we decided to eat something fresh and cold. We discovered this restaurant on the high street Wansted. We decided to try the cold mesh dish suitable for two or three. No other works to describe it: really nice, cold, fresh and fulfilling. I will be back there very soon.", "date_of_review": "28 July 2014"}
{"review_id": 100283, "restaurant_id": 294, "username": "pam y", "date_of_visit": " August 2014", "rating": "3", "title": "Disappointing meal at Gezi Park", "comment": "A Sunday evening at 7.30pm. Plenty of staff but not very good service. Gave up waiting to be offered dessert menu. Annoyed to find bill automatically adds service charge. Food was ok but pricey. Won't be going back :(", "date_of_review": "3 August 2014"}
{"review_id": 100284, "restaurant_id": 294, "username": "BingoBango2014", "date_of_visit": " July 2014", "rating": "5", "title": "Very Good Turkish Restaurant", "comment": "Not a cheap-eat, but meat and fish were deliciously flavoursome and cooked to perfection so I felt it just about offered good value. All-in-all, a good restaurant with particularly excellent seafood. For vegetarians, the falafels were amazing! Service was very good.", "date_of_review": "28 August 2014"}
{"review_id": 100285, "restaurant_id": 294, "username": "mrsGiroud", "date_of_visit": " August 2014", "rating": "4", "title": "Turkish delight", "comment": "Tonight was our first trip to Gezi Park and we will definitely be back. Booked a table for 7pm and place was fairly empty when we got there but by the time we left it was really busy. I think booking is definitely required on Sat night. Lovely waitress took drinks order first. I had never had Turkish wine before and when I ordered it she said if I didn't like it then I could change it. I didn't need to.. Had 2 glasses :-) We had a few different starters.. Haloumi, Turkish sausage and meatballs. All delicious. Nice bread also served. 2 of us went for chicken shish kebabs, 1 had the lamb chops and the other had chicken wings. All were served with rice and salad. Just enough rice.. Sometimes they can give too much. The mains were really tasty. Not much room left for dessert but 2 of them managed to share a piece of cheesecake. This is a lovely restaurant. It was a lovely evening and we could have taken advantage of the outdoor seating but opted for indoors.  Only negative was it was very fast service (some might say that's a good thing). Next time we would order our starters and when finished would order the mains. Less than 120 for 4 people which included 2 large glasses of wine and 2 beers with 4 cokes. Service charge was included. Looking forward to our next visit!", "date_of_review": "6 September 2014"}
{"review_id": 100286, "restaurant_id": 294, "username": "keith r", "date_of_visit": " August 2014", "rating": "4", "title": "Gezi First Timer", "comment": "We tried to get a table a few weeks ago, but having just wandered in on a Friday evening, there was nothing available for half an hour. The manager took our number and said he would call to let us know when a table was free. We wandered off and found another local restaurant. However, I did receive a call within half an hour, but had to say we would book another time, as we had seen enough to make us want to go back. This time, we booked in advance and we were not sorry we did. We were warmly welcomed when we arrived by staff who were impressively attentive, engaging and friendly throughout. As it was our first time here, we decided to choose a starter each and then a mixed grilled meat platter. The starters were generous in size and, as there were four of us, we were pleased that there were at least 4 pieces in each portion, as opposed to those annoying places where they insist on supplying on 3 to a party of 4. The sarma and calamari were particularly good. The platter, as with the starters, was of a very generous size. We had a mix which included chicken wings, lamb chops, lamb ribs etc, together with rice and salad. Each of the meat portions were wonderfully cooked and flavoured and we only just made it through the course. I can only comment on one of the desserts, as two of us never have them and one does not eat chocolate, so that limited her choice to ice cream, which she did not want. However, the cheesecake portion ordered by my son soon vanished! Despite the comments from a previous reviewer, we found the staff to be very busy, but always friendly and efficient.  As for the cost, we paid £82, including tip, so at just over £20 per head, I thought that was excellent value.  We eat out quite regularly and always score our experience and this one scored very highly. We will be back and suggest you try it out too. All in all, a very relaxed and enjoyable meal, so this one come highly recommended.", "date_of_review": "30 August 2014"}
{"review_id": 100287, "restaurant_id": 294, "username": "Fcroton", "date_of_visit": " September 2014", "rating": "4", "title": "Best kebabs", "comment": "This is a lovely restaurant where the staff are very friendly and helpful. We were celebrating a birthday and so enjoyed cocktails, starters, a main course and dessert, all of which were excellent. You are given free appetizers and the most delicious flatbread whilst waiting for the food which almost filled us up! Most of us had kebabs and they were excellent. Only four people could manage a dessert which included the cheesecake and rice pudding which surprised us by being cold but still delicious. If you like kebabs you won't be disappointed. The bill for 8 people came to £210 including service charge.", "date_of_review": "8 September 2014"}
{"review_id": 100288, "restaurant_id": 294, "username": "AshtonSeymour", "date_of_visit": " April 2014", "rating": "5", "title": "excellent!", "comment": "I did another review under the previous name of place Hadley House mezi restaurant. Excellent, highly recommended!", "date_of_review": "9 September 2014"}
{"review_id": 100289, "restaurant_id": 294, "username": "4umore", "date_of_visit": " October 2014", "rating": "4", "title": "Great food", "comment": "Great food, good atmosphere, very busy which made service a bit slow, but the friendly staff made the wait acceptable, service charge added to the bill we would have preferred to make the decision on overall service ourselves.", "date_of_review": "11 October 2014"}
{"review_id": 100290, "restaurant_id": 294, "username": "Tupscyprus", "date_of_visit": " October 2014", "rating": "4", "title": "Nice food", "comment": "Very busy restaurant, booking is best. Flatbread and dips lovely start to meal. Nice chicken kebabs very tender and tasty lots of nice salad. Staff very friendly, good service. Service charged added to bill do not like that ,like to tip upon service received. Would return.", "date_of_review": "15 October 2014"}
{"review_id": 100291, "restaurant_id": 294, "username": "Susanlondn", "date_of_visit": " October 2014", "rating": "5", "title": "Great food, highly recommended!", "comment": "I have paid ma second visit to this restaurant and absolutely loved it! They seem to have a standard and both my visits were very much enjoyed. I eat out quite often and also visited the other turkish restaurants in this area however did not find the same quality. I am a vegetarian and had the veg mousakka which was amazing and my partner had the mixed kebab. The portions were huge and we could not manage to finish it all. The rice and salad was just as perfect. So many to choose from in the menu. Would I return? Definately. Highly recommended!!", "date_of_review": "17 October 2014"}
{"review_id": 100292, "restaurant_id": 294, "username": "Tony G", "date_of_visit": " June 2014", "rating": "5", "title": "A Great Turkish Restaurant", "comment": "The Four of us ate here for lunch on Saturday having seen that the restaurant was packed the previous Friday evening. We had the Mezes, halloumi and calamari. They also very kindly changed the Tarama to Tabouleh in the Meze. The food was really fresh and delicious and the grilled flatbreads were tasty. The chairs were very comfortable and the staff were welcoming and charming. Overall a very pleasant experience and one we would heartily recommend.", "date_of_review": "9 June 2014"}
