{"review_id": 99849, "restaurant_id": 293, "username": "saffytravels", "date_of_visit": " February 2019", "rating": "5", "title": "Delicious pasta ", "comment": "The pasta is perfectly al dente especially the carbonara and I have previously had pizza too which is also so italian and delicious - i recommend over and over ", "date_of_review": "30 January 2020"}
{"review_id": 99850, "restaurant_id": 293, "username": "orgonia6", "date_of_visit": " December 2019", "rating": "5", "title": "Amazing food and friendly staff", "comment": "I have been to Acquolina with work mates in Nov and Dec19. To our surprice, waitress recognised us and food was just amazing. Pizzas are yummy and also try their carbonara- it is just how it should be. Complimentary tiramisu to a birthday girl was not forgotten and we will certainly come back. Place gets busy even for lunch so book in advance.", "date_of_review": "11 January 2020"}
{"review_id": 99851, "restaurant_id": 293, "username": "Stu1404", "date_of_visit": " November 2019", "rating": "5", "title": "Best place to eat in Egham !", "comment": "Love this place, menu is quite simple but everything is so nice....food finds its way to you so quickly after ordering and all of the staff provide such great service. Great value too.", "date_of_review": "24 November 2019"}
{"review_id": 99852, "restaurant_id": 293, "username": "borsay1", "date_of_visit": " February 2020", "rating": "4", "title": "Acquolina - lunch - very nice! ", "comment": "Just been to the restaurant and had three lovely dishes between friends. The food was very tasty, the staff was really friendly and welcoming and with a split bill of £14 per person, we thought that to be very good value for the quality of the food. The restaurant seems to be quite busy but what would you expect for a Sunday afternoon. The staff was on hand to sort out our orders and provide the food in a timely manor so not much waiting around. The location of the restaurant is right on the high street so it’s easily accessible by foot or by train. We really enjoyed the experience and so would go back again. ", "date_of_review": "2 February 2020"}
{"review_id": 99853, "restaurant_id": 293, "username": "pottyboy69", "date_of_visit": " December 2019", "rating": "5", "title": "Good food", "comment": "Second visit, again a very pleasant atmosphere, with friendly polite staff, good food and well cooked ", "date_of_review": "16 December 2019"}
{"review_id": 99854, "restaurant_id": 293, "username": "annasM1765FE", "date_of_visit": " November 2019", "rating": "5", "title": "An absolutely incredible place!", "comment": "Everything about the dinner in Acquolina was perfection. Our waitress Alex, was very friendly and helpful. From the moment we got the menus to the last bite, the whole experience was great. The pizza was fresh out of the oven, and probably the best one I had in a long time!", "date_of_review": "29 November 2019"}
{"review_id": 99855, "restaurant_id": 293, "username": "sunitaandmimi", "date_of_visit": " December 2019", "rating": "5", "title": "FANTASTICO! ", "comment": "This is the first time I have ever visited and we LOVED it!! There were 6 tables of approx 40 of us and we all said how fantastic the food, service and ambience!  Thank you so much to the superb staff, nothing was too ouch trouble and they were so very accommodating!  Marsha, Andrea, Sanja and Alessandeo we will be back for sure! ", "date_of_review": "12 December 2019"}
{"review_id": 99856, "restaurant_id": 293, "username": "Electrada", "date_of_visit": " February 2020", "rating": "5", "title": "Quality Italian food", "comment": "This restaurant is amazing. I have been there a few times while going on a date with my boyfriend. The staff are very friendly and polite which makes the atmosphere very welcoming.  Their pizzas are exactly like the ones I used to have back in Italy.  I would definitely recommend the quattro formaggi pizza and the limoncello!!! ", "date_of_review": "5 April 2020"}
{"review_id": 99857, "restaurant_id": 293, "username": "abbitravel", "date_of_visit": " February 2020", "rating": "5", "title": "Great in all aspects", "comment": "Friendly and efficient service, delicious and authentic food, fab prices. One of the best margarita pizzas I’ve ever had, and my boyfriend loved his calzone! Fairly small menu but includes good vegan and vegetarian options and a range of pasta and pizza dishes. Would definitely return and recommend to others.", "date_of_review": "18 February 2020"}
{"review_id": 99858, "restaurant_id": 293, "username": "Trek777721", "date_of_visit": " March 2020", "rating": "5", "title": "It's closed!!!", "comment": "We drove past on the way back home (on 31 May 2020) from a walk in Windsor Great Park, and we were shocked to see a big 'TO LET' sign in Aquolina's window. The shop looked empty of furniture as we drove past. Andrea's pizzas and pasta were absolutely delicious. The closure of this restaurant will be a big loss for us, and Egham and its wider area. We hope Andrea and his family and staff are well and wish them well for the future.", "date_of_review": "31 May 2020"}
{"review_id": 99859, "restaurant_id": 293, "username": "Sam S", "date_of_visit": " October 2019", "rating": "5", "title": "Excellent restaurant", "comment": "Me and my family had a great time at this restaurant, the pasta was delicious and great value, and our waitress Charlotte was friendly and helpful. Will definitely be coming back!", "date_of_review": "14 November 2019"}
{"review_id": 99860, "restaurant_id": 293, "username": "sparrotte", "date_of_visit": " July 2019", "rating": "4", "title": "Sourdough pizza", "comment": "We had delicious pizza in this informal restaurant which were made to order in the pizza oven right in the middle of the restaurant. Service was good and staff were friendly.", "date_of_review": "25 July 2019"}
{"review_id": 99861, "restaurant_id": 293, "username": "JohnWeyworth", "date_of_visit": " June 2019", "rating": "4", "title": "Good italian food", "comment": "Could do with a bit of improvements here and there. Overall the carbonara was absolutely delicious, I have nothing to complain, but my friends dishes weren't awe inspiring. The lasagna was a bit of a let down and the margherita pizza was quite scarce on mozzarella. All in all, would visit it a second time if opportunity arises.", "date_of_review": "28 July 2019"}
{"review_id": 99862, "restaurant_id": 293, "username": "Sally H", "date_of_visit": " September 2019", "rating": "5", "title": "Fab food and great value", "comment": "This is a very popular restaurant in Egham and it’s not hard to see why. Staff are very attentive. Amazing sourdough pizzas and great value set menu. Wine is always lovely too. Lovely atmosphere. You can also buy freshly baked bread while you’re there. Highly recommend.", "date_of_review": "3 September 2019"}
{"review_id": 99863, "restaurant_id": 293, "username": "CharlieBuffYateley", "date_of_visit": " July 2019", "rating": "2", "title": "Not the best Italian food ", "comment": "In fairness the staff were very pleasant and when we said our pizza was doughy and the carbonara pasta not the best they apologised and replaced them but sadly still lacked flavour on both dishes. Wouldn’t return but they did try ", "date_of_review": "27 July 2019"}
{"review_id": 99864, "restaurant_id": 293, "username": "Victoria D", "date_of_visit": " January 2019", "rating": "1", "title": "Dreadful - service but food was THE WORST", "comment": "How this place has the high reviews is staggering. One of the worst in the area. Lady who is clearly more than just member of waiting staff brash, loud and just unpleasant to be served by. As if she wasn’t bad enough, the ambience - there was none just a sense of ‘arent we great’ - but the VERY, VERY worst was the food. Pizza Hut are more Italian than this place. Hated every second and spoke to another customer and they felt the same. My pizza dough was still raw but I couldn’t be bothered to even discuss it with brash staff and we just paid and left. NEVER EVER AGAIN. In contrast Cafe Gondala in the High Street has lovely staff, atmosphere and the food is ok to good. 100 times better than this place. ", "date_of_review": "20 October 2019"}
{"review_id": 99865, "restaurant_id": 293, "username": "516geko", "date_of_visit": " September 2019", "rating": "5", "title": "Great enjoyed italian experience ", "comment": "Very nice and modern restaurant environment. Tasting a chocolate dessert I got to talk to all the staff both in the kitchen and in the dining room. They are all people of various ages, very capable and dedicated to their work, putting a lot of care and interest into what they do. Nice people and available to every customer request. Located in the center of the city of Egham I highly recommend enjoying a meal in this restaurant above all for the fantastic offer of Sunday pizzas.", "date_of_review": "4 September 2019"}
{"review_id": 99866, "restaurant_id": 293, "username": "j d", "date_of_visit": " September 2019", "rating": "2", "title": "One waiter ruins good reputation...", "comment": "waited far too long to get served and between courses. Our waiter failed to take the proper order or action any requests (eg request for cheese). He was happy to give the chit-chat but failed miserably on delivery. Well below my expectation.", "date_of_review": "22 September 2019"}
{"review_id": 99867, "restaurant_id": 293, "username": "lostwithmarta", "date_of_visit": " September 2019", "rating": "5", "title": "Amazing place!!!", "comment": "I've been there countless times, and couldn't recommend more. Food is amazing, wine is great, and above all, staff- absolutely exceptional. Everyone is so nice and friendly!", "date_of_review": "26 October 2019"}
{"review_id": 99868, "restaurant_id": 293, "username": "johnandjools", "date_of_visit": " November 2019", "rating": "5", "title": "4 celebrating joint anniversary", "comment": "Food was top draw. Staff were excellent. Wine was really good choices from different sources. Highly recommended", "date_of_review": "6 November 2019"}
{"review_id": 99869, "restaurant_id": 293, "username": "123jonl", "date_of_visit": " April 2019", "rating": "4", "title": "Sough Dough Pizza Excellence", "comment": "Wanting a simple meal on a Saturday evening can be difficult. This pizza restaurant ticks all the boxes. There is a wide selection of pizza and pasta dishes catering for all dietary requirements and the food is freshly prepared, you can even watch the chef prepare and cook your food, after it has been ordered. The pizza is freshly made and cooked in a wood fires, pizza oven and arrives at the table, as all good pizzas should be, hot with just a slight browning on the base of the pizza, proving that oven is hot enough. The selection of wines is good but if you just want to drink water, there is no pressure to purchase an alcoholic drink. The coffee was served in a preheated cup, a sign that someone has been taught correctly. My only minor criticism, which reduces this review from five to four is that the menu does not mark the menu with either the commonly used vegetarian/vegan logo. This aside, the food was well prepared, the staff friendly and helpful and the ambience ideal.", "date_of_review": "28 April 2019"}
{"review_id": 99870, "restaurant_id": 293, "username": "993christoe", "date_of_visit": " May 2019", "rating": "5", "title": "Dad and children without mummy", "comment": "Took my two children here last night. Been a few times and I must admit this place has really turned my opinion around!! Their food is spot on and they don’t have a huge menu! I have only tried their pastas and pizzas but they are amazing. Desserts are good as well. Service is kind and professional and very upbeat. This is definitely worth a visit as I have been pleasantly surprised every time!", "date_of_review": "22 May 2019"}
{"review_id": 99871, "restaurant_id": 293, "username": "xlittlemissyx", "date_of_visit": " December 2018", "rating": "5", "title": "Great dinner", "comment": "We spent the evening here on New Years Eve and had a wonderful evening. Food was brillaint and service evening better. Could not fault!!", "date_of_review": "29 April 2019"}
{"review_id": 99872, "restaurant_id": 293, "username": "ainsworthjames", "date_of_visit": " May 2019", "rating": "2", "title": "Rude staff, below average food", "comment": "Came here with a large group this evening. General consensus was that both the pizza and pasta was poorly seasoned and generally lacking in taste. The black haired waitress with the lip piercing was particularly rude throughout our meal, making us quite uncomfortable by placing food in front of us and aggressively saying “thank you!” before we could say anything, even though our party was pleasant to staff throughout. The decor, atmosphere and price were great, but what is a restaurant if the food and staff aren’t up to standard? If it wasn’t for the other two lovely staff who served our table (young man with arm tattoo and lady who was working as cover) we would have removed service charge - we will unfortunately not be coming back.", "date_of_review": "14 May 2019"}
{"review_id": 99873, "restaurant_id": 293, "username": "jomc9", "date_of_visit": " May 2019", "rating": "5", "title": "Lovely local place", "comment": "Great pizza, lovely red wine and wonderful tiramisu. Friendly, efficient and speedy service. Eaten here a few times now with friends and I really like the place. Nice to have this local to me and not be a chain restaurant.", "date_of_review": "22 May 2019"}
{"review_id": 99874, "restaurant_id": 293, "username": "Herrenhausen", "date_of_visit": " June 2019", "rating": "5", "title": "Very nice eatery", "comment": "Overall very pleasant experience. The food was fresh. The staff were courteous and the price was appropriate. Thanks - had an enjoyable meal here.", "date_of_review": "3 June 2019"}
{"review_id": 99875, "restaurant_id": 293, "username": "kim0n0m", "date_of_visit": " February 2019", "rating": "5", "title": "Loved it ", "comment": "Food is so tasty and not a bad price. Lovely for a couples meal or for a group of friends. Good atmosphere and good staff. ", "date_of_review": "4 July 2019"}
{"review_id": 99876, "restaurant_id": 293, "username": "Michelle S", "date_of_visit": " June 2019", "rating": "4", "title": "Excellent lunch", "comment": "Lovely restaurant in a lovingly refurbished building. All pizzas have a sourdough base. Ours were lovely, but mine was a little burnt on the bottom.", "date_of_review": "23 June 2019"}
{"review_id": 99877, "restaurant_id": 293, "username": "TrueGrit7401", "date_of_visit": " June 2019", "rating": "4", "title": "Evening Meal", "comment": "Went with my daughter, who recommended the restaurant, warmly greeted and attended to by a lovely lady. The pizza's were lovely as was the pasta dish. Definitely recommend this restaurant.", "date_of_review": "12 June 2019"}
{"review_id": 99878, "restaurant_id": 293, "username": "mistharaUK", "date_of_visit": " July 2019", "rating": "5", "title": "Real Italian Pizza", "comment": "We ordered 2 pizzas: quattro formaggi and salsiccia e friarielli. Really good base for the pizza and fresh and well cooked ingredients. Well done guys!", "date_of_review": "21 July 2019"}
{"review_id": 99879, "restaurant_id": 293, "username": "oosolar", "date_of_visit": " April 2019", "rating": "4", "title": "Very good", "comment": "Good food, Great service both times we have visited. The dough that they made for our Chorizo pizza from the set menu was amazing. Plus the mussels was the highlight the broth that they was in was great. All round lovely for a dinner. ", "date_of_review": "20 April 2019"}
{"review_id": 99880, "restaurant_id": 293, "username": "Çağrı Y", "date_of_visit": " January 2019", "rating": "5", "title": "Right Place for Pizza", "comment": "Geat pizzas, with a reasonable price. The restaurant’s ambiance is very pleasant and staff are very friendly. Highly recommended for everyone.", "date_of_review": "3 February 2019"}
{"review_id": 99881, "restaurant_id": 293, "username": "Chlolex", "date_of_visit": " February 2019", "rating": "5", "title": "Great little place ", "comment": "Work trip requiring an overnight stay in Egham. Cursory search online didn’t look promising apart from this place. Very well presented, good reviews and varied menu. I had the Tagliatelle Ragu (opted for normal pasta rather than the offered spelt) which was excellent. Very flavoursome sauce and nice small cuts of beef. Finished with a cheeky chocolate lava cake which came with a generous scoop of quality vanilla ice cream. Nice to see the open kitchen at the centre of the restaurant. Plenty of tables and space. Pleasant and discreet staff. Quiet on a Tuesday night. Reasonably priced at under £20 (including a coke). ", "date_of_review": "12 February 2019"}
{"review_id": 99882, "restaurant_id": 293, "username": "blond-traveller99", "date_of_visit": " February 2019", "rating": "4", "title": "Nice place", "comment": "Four of us visited on a Saturday night environment nice open kitchen with wood burner for pizzas unfortunately the food was average but the staff and service was extremely good we had the spelt pasta probably a bad choice but enjoyed the pizza Ham and Mushroom, my husband wasn’t too sure on the cheese on the top though. That the chocolate bomb was absolutely amazing I definitely go back just for that and the home-made ice cream was fantastic .", "date_of_review": "6 February 2019"}
{"review_id": 99883, "restaurant_id": 293, "username": "CommanderGeorge", "date_of_visit": " February 2019", "rating": "5", "title": "Delicious!", "comment": "Very impressed and excellent value. Sometimes the presentation can be a bit rustic, but when it tastes as good as it does, who cares? Great food. Nice wine. Lovely staff. Highly recommended!", "date_of_review": "16 February 2019"}
{"review_id": 99884, "restaurant_id": 293, "username": "Lauren B", "date_of_visit": " February 2019", "rating": "5", "title": "Lovely Valentines Meal", "comment": "Visited on Valentines Day and had a great experience.  The staff are very friendly and attentive.  We booked and were seated promptly.  Menu had vegetarian options, only issue was that this isn’t clearly displayed so you have to work it out yourself.  Food arrived quickly and was great quality and tasted lovely.  We were even given a rose each after! Great touch.  Overall a great experience - great value for money - would definitely return. ", "date_of_review": "15 February 2019"}
{"review_id": 99885, "restaurant_id": 293, "username": "human123456", "date_of_visit": " March 2019", "rating": "5", "title": "A Bite of Italy", "comment": "Lovely place to eat. Great pizza, and two for £12 on a Sunday is now a ritual for me. The staff are attentive and always smiling.  I also love the interior - the tiles give it a great traditional feel.  Would thoroughly recommend for its affordability and quality.", "date_of_review": "10 March 2019"}
{"review_id": 99886, "restaurant_id": 293, "username": "AmyLondon101", "date_of_visit": " April 2019", "rating": "5", "title": "Amazing. Love this place!", "comment": "We came today for a family birthday and the staff were so lovely. Restaurant has stylish and contemporary decor with a lovely atmosphere. Best of all, the food is AMAZING. Beautiful pizzas. Can’t wait to go back!", "date_of_review": "7 April 2019"}
{"review_id": 99887, "restaurant_id": 293, "username": "hmilligan1", "date_of_visit": " March 2019", "rating": "5", "title": "First time visit - but not the last!", "comment": "Went to acquolina last night with my dad and partner, service was brilliant, the food was amazing and so was the wine, all for a very reasonable price. Will definitely be making this my go-to in the area!", "date_of_review": "24 March 2019"}
{"review_id": 99888, "restaurant_id": 293, "username": "Amit A", "date_of_visit": " April 2019", "rating": "5", "title": "Amazing food and friendly service", "comment": "This place is a gem. We we were here to visit legoland and am so glad we wen here. Very reasonably priced for fantastic food. Loved everything i and my family ordered.", "date_of_review": "18 April 2019"}
{"review_id": 99889, "restaurant_id": 293, "username": "turbotank", "date_of_visit": " January 2019", "rating": "2", "title": "Very disappointing ", "comment": "Well a last minute decision to go for pizza was probably the wrong one. We scoured the internet for a good traditional local pizza restaurant and booked Acquolina. On arrival we were seated at the back of the restaurant with a rocky table and a fly on the napkin. After changing napkins with the table behind we went for starters and pizza with a glass of wine. The bruschetta turned out to be a slightly toasted slice of bread with some chopped up mozzarella and tomatoes. The white wine was a disturbingly dark colour with a strange taste. Pizza arrived and was actually very good, great base and full of toppings however it was tepid to say the least. My wife went for the tiramisu which liquid consistency left a lot to be desired. Throughout the evening people were going in and out of the office, next to our table, which detracted from the atmosphere. The shame of it was that the pizza could frankly of been excellent if it was just warm. If you do go just order the pizza and have a beer.", "date_of_review": "26 January 2019"}
{"review_id": 99890, "restaurant_id": 293, "username": "SebG1989", "date_of_visit": " January 2019", "rating": "2", "title": "Average to poor food", "comment": "Service was slow, food was incredibly bland. Several dishes were sent back but even the replaced dishes were equally poor. The pizza dough was great but it was undercooked which was a shame. Pasta dishes were terrible. Small and uncomfortable seats and tables.  Although wait staff are pleasant, the lack of English can cause confusion with orders as it did with ours.  Overall would not return here, cannot understand all the positive reviews. ", "date_of_review": "21 January 2019"}
{"review_id": 99891, "restaurant_id": 293, "username": "PortlyRabbit", "date_of_visit": " January 2019", "rating": "1", "title": "Absolute shambles!", "comment": "Visited as part of a fairy large group, had booked several weeks ago and even given the restaurant our menu choices from the set meal, so it is fair to say the restaurant should have been prepared for us. We were all seated by 7pm, and it took at least half an hour for anyone to come and take our drinks orders. The majority of us had pre-ordered from the set menu but all had to order again as the staff seemingly had no record of that. This was where the fun really started... a dribble of starters came out after about an hour, with some people having to wait much longer, staff not knowing who ordered which item, two people on our table missed out altogether. People were served their second course whilst others hadn't even been given a starter. People waited THREE HOURS for a pizza. People asked FOUR TIMES for table water.  Food on the whole was bland, all swimming in oil and quite clearly rushed, so much was left uneaten and plate after plate was returned almost untouched yet at no point did any of the staff ask us if everything was ok.  No-one asked if we wanted more drinks and we had to keep flagging down the seemingly disinterested and unenthusiastic staff to order more.  The night drew on and we were all getting restless and fed up with the disaster this had turned into (it was a special birthday for a family member with some guests travelling hours to be there!) And by 10.30pm we had all eaten and were waiting for dessert. We asked if it was coming. They said \"on its way\"..11pm rolled by, dessert was still apparently \"on its way\"... We never did get desert. I have no idea why. We ordered it as part of the set menu, but the staff just decided not to serve It?!?!  Due to all the mistakes and appalling service , a member of our party spoke to the management and it was agreed we would receive a £5 per head discount. Fair enough, we thought. However when we paid, we were still expected to pay for the dessert which never materialised!!! I queried this with a staff member who gave me a cacophony of excuses such as: 1) some of you didn't turn up (a few people couldn't make it due to family bereavement) 2) if you wanted dessert you should have said ( We did, it formed part of the set menu we ordered from and you took our dessert orders at 8pm) We also asked thrice and were told it was \"on its way\"... 3) it's your parties fault as some of you didn't order from the set menu (a small percentage of us ordered from the regular menu, which made absolutely no difference as the pre order we made was ignored anyway. At no point did any member of staff apologise for this mess. Looking at their kitchen setup and the way in which they worked, it's clear this restaurant just couldn't handle the sales volume of a party of 20 plus people.  I was hesitant to write this review due to how negative it is, but it's an absolutely true representation of our experience and needless to say, none of us will ever be back again. Four and a half hours is a ridiculous amount of time to wait for a 3 course meal...especially when the last course never arrived anyway! A shambles of an experience, a ruined birthday treat and a wasted journey for many of us. Such a shame.", "date_of_review": "27 January 2019"}
{"review_id": 99892, "restaurant_id": 293, "username": "joe g", "date_of_visit": " January 2019", "rating": "1", "title": "Terrible ", "comment": "Came for a family meal and the whole experience was an absolute shambles. We had over an hour wait for the starter, which, arrived cold and was soggy. The main came 45 minutes later which was quite frankly inedible. I was on a table of six and one starter arrived 20 minutes before another. The food was cold and poor and I will never be returning. At no point was I asked how my food was and even when several plates were returned nearly full, no staff asked if there was a problem. ", "date_of_review": "26 January 2019"}
{"review_id": 99893, "restaurant_id": 293, "username": "nicoleodean", "date_of_visit": " January 2019", "rating": "5", "title": "No place like it.", "comment": "Acquolina is by far the best restaurant in the area. Food is amazing and the service is superb. Perfect for family and friends!", "date_of_review": "27 January 2019"}
{"review_id": 99894, "restaurant_id": 293, "username": "Francicasci", "date_of_visit": " January 2019", "rating": "5", "title": "Amazing", "comment": "A real taste of Italian food with the best pizzas in Egham! The food is incredible and the service is excellent. Very highly recommended.", "date_of_review": "27 January 2019"}
{"review_id": 99895, "restaurant_id": 293, "username": "Giulia L", "date_of_visit": " January 2019", "rating": "5", "title": "Best Italian place in UK!", "comment": "Great food, attention to details and amazing athmosphere! The waiters are super friendly, competent and kind. The chefs create masterpieces! The expertise and passion of the manager Andrea is self-evident, he transmitted us a warm and welcoming vibrancy. Super recommended!", "date_of_review": "27 January 2019"}
{"review_id": 99896, "restaurant_id": 293, "username": "Chris K", "date_of_visit": " January 2019", "rating": "5", "title": "The best Carbonara and pizza", "comment": "I came with 6 friends without reservation and very kind staff find nice table for us, even when was busy. We had a few starters and pizza finished with pasta. All great! We will be back.", "date_of_review": "27 January 2019"}
{"review_id": 99897, "restaurant_id": 293, "username": "TynaMaesa", "date_of_visit": " January 2019", "rating": "5", "title": "Great local restaurant", "comment": "Authentic local Italian with great pizzas and pasta dishes. All food is cooked fresh to order and everything is home-made including the spaghetti. Most of the staff speak Italian - and so do many of the regular customers, making for a relaxed “holiday” feel! The menu is quite short - in typical Italian style - but it changes seasonally and there is also a specials menu. I had the Parmigiana pizza last night, which had meltingly soft aubergine seasoned with a sprinkle of mature Parmesan - my new favourite pizza. A glass of the excellent Montepulciano and a freshly made mixed side salad (chopped to order) completed my enjoyment. It is also one of the best value restaurants in the area - our pizzas and salad came to less than £20 for two! Strongly recommended.", "date_of_review": "28 January 2019"}
{"review_id": 99898, "restaurant_id": 293, "username": "Nazimturgut", "date_of_visit": " February 2019", "rating": "5", "title": "Dining", "comment": "Perfect atmosphere with extremely helpful staff, especially the Turkish girl and Sanja was very charming and sympathetic", "date_of_review": "1 February 2019"}
{"review_id": 99899, "restaurant_id": 293, "username": "Brigitte K", "date_of_visit": " October 2018", "rating": "4", "title": "Limited Menu", "comment": "The menu is somewhat limited but the food is good, including pizzas. The soups are on the thick side which I personally don't like. The service varies, depending who is on duty. The restaurant is in a convenient location and has outdoor seating.", "date_of_review": "6 November 2018"}
{"review_id": 99900, "restaurant_id": 293, "username": "markjO4765YH", "date_of_visit": " November 2018", "rating": "5", "title": "Bellisimo!", "comment": "Octopus, ravioli and garlic bread to start followed by the best pizzas this side of Naples. Exceptional food, a warm friendly welcome and impeccable service. A truly authentic Italian experience. Grazie mille!", "date_of_review": "2 November 2018"}
{"review_id": 99901, "restaurant_id": 293, "username": "kmatt96", "date_of_visit": " September 2018", "rating": "5", "title": "Fantastic find.", "comment": "Visitied Acquolina in Bocca in September but just got round to writing the review. I decided to go for the set menu which was fantastic value. The Bruschetta starter is a good portion and good tasting. I asked for some olive oil too and was brought Olives as the waiter misunderstood, but that was quickly fixed with a joke \"I can squeeze the olives out for you if you want some fresh olive oil\" so the service is amazing and funny too. Sourdough pizza was simply delicious - nothing to add or subtract from a clearly perfect recipe. Decided not to go for dessert as was too full, which speaks for the generous portion sizes. Definitely worth a visit if ever in Egham!", "date_of_review": "5 November 2018"}
{"review_id": 99902, "restaurant_id": 293, "username": "piglett81", "date_of_visit": " November 2018", "rating": "5", "title": "Takeaway Pizza BEST in Egham", "comment": "The quality of the pizza is like nothing else, the service is superb and the price is great.  BEST pizza in Egham....", "date_of_review": "8 November 2018"}
{"review_id": 99903, "restaurant_id": 293, "username": "Annette P", "date_of_visit": " December 2018", "rating": "5", "title": "Fabulous food and service", "comment": "Our first visit here but hopefully not the last. Amazing food and excellent service. Would highly recommend.", "date_of_review": "29 December 2018"}
{"review_id": 99904, "restaurant_id": 293, "username": "GGaitan", "date_of_visit": " November 2018", "rating": "5", "title": "Good Neapolitan style pizza", "comment": "The pizza is good, best in town. Yes, egham is miniscule, but this is the best pizza you can get round here.", "date_of_review": "6 November 2018"}
{"review_id": 99905, "restaurant_id": 293, "username": "Stais150516", "date_of_visit": " November 2018", "rating": "5", "title": "Great Italian food", "comment": "Delicious freshly made food, quick service, good portions and decent prices. We've been a few times and will come back again.", "date_of_review": "1 December 2018"}
{"review_id": 99906, "restaurant_id": 293, "username": "Richard H", "date_of_visit": " January 2019", "rating": "5", "title": "Fabulous New Years ", "comment": "A great menu with great service. Good value. Nothing too much trouble. Great choice from either standard or new year special - do something to suit everyone!", "date_of_review": "6 January 2019"}
{"review_id": 99907, "restaurant_id": 293, "username": "Dario_acMilan", "date_of_visit": " January 2019", "rating": "5", "title": "Amazing food at good price. I’ve eaten here several times already and can’t wait to go back. Would definitely recommend!", "comment": "Amazing food at good price. I’ve eaten here several times already and can’t wait to go back. Would definitely recommend!", "date_of_review": "8 January 2019"}
{"review_id": 99908, "restaurant_id": 293, "username": "GGaitan", "date_of_visit": " November 2018", "rating": "4", "title": "Best pizza I have had (in the tasteless UK)", "comment": "I cannot comment much on some other things rather than the pizza. I just keep ordering the pizza (Napoleatan pizza style though). The ventricina atop the pizza is a must.", "date_of_review": "11 January 2019"}
{"review_id": 99909, "restaurant_id": 293, "username": "yelvertoncharlie", "date_of_visit": " October 2018", "rating": "5", "title": "Fantastic!", "comment": "Great food, we had best pasta in the area, not stereotype but contemporary italian. Unusual Carbonara with Tuna , sourdough pizza Bufala and lovely Panna cotta with pears. Please don’t miss it", "date_of_review": "30 October 2018"}
{"review_id": 99910, "restaurant_id": 293, "username": "france067", "date_of_visit": " September 2018", "rating": "4", "title": "Good food but slow service", "comment": "Had brunch here- the breakfast choices were limited but in a good way so we didnt feel overwhelmed and the food really tasty. Service was slow but on the positive side we weren’t rushed at all. The latte was lukewarm but very quickly rectified so all in all a very nice place and very nice breakfast!", "date_of_review": "23 September 2018"}
{"review_id": 99911, "restaurant_id": 293, "username": "agnieszkas414", "date_of_visit": " September 2018", "rating": "5", "title": "Amazing pasta", "comment": "One of the best pastas I’ve ever had! Lovely selection of wine. Nice modern interior! No.1 Italian in this area! ", "date_of_review": "28 September 2018"}
{"review_id": 99912, "restaurant_id": 293, "username": "damianw903", "date_of_visit": " September 2018", "rating": "5", "title": "Amazing", "comment": "We came here a year ago for breakfast and didn’t think to much, not have we missed out... We returned today for Lunch.... the food was amazing, freshly made and cooked on the day... I don’t think I have ever had pasta this good and they do takeaway... can not recommend it enough", "date_of_review": "28 September 2018"}
{"review_id": 99913, "restaurant_id": 293, "username": "TheSpecialsT", "date_of_visit": " September 2018", "rating": "5", "title": "Ottimo!", "comment": "What I can say... For my that I’m Italian was very difficult find a place where to eat a properly PIZZA in this country, but after I tried Aquolina I’ve found my favourite place for pizza. At least once every two week I’ll be there! Bravi ragazzi! ", "date_of_review": "30 September 2018"}
{"review_id": 99914, "restaurant_id": 293, "username": "feckingtuck", "date_of_visit": " October 2018", "rating": "5", "title": "Late lunch, yum yum!", "comment": "Really great pizza and tagliatelle ragu. The ragu had tender beef in a very tasty sauce. The pizza is beautiful. We had panacota with a poached pear in a lightly sweet reduction syrup with a warm touch of cinnamon. The coffee is great, as you would expect.", "date_of_review": "2 October 2018"}
{"review_id": 99915, "restaurant_id": 293, "username": "Albermarle", "date_of_visit": " October 2018", "rating": "3", "title": "Nice place but food a bit lacking in flavour", "comment": "Although we have eaten at this location before , not since its latest change about a year? ago. Good first impression, modern, spacious, generally nice atmos. More like a city eatery than one in Egham. Seemed to be plenty of staff but I think our waitress was very new to the job . I have no problem with new staff trying to find their way, but she seemed to have had almost no training for what was probably her first night ever doing a job like this. The menu was interesting, with many dishes light on meat or sauces. However the verdict of our small party was the same . Very nicely cooked and presented but a bit tasteless. Mushroom pizza did not taste of mushrooms at all. Chorizo pizza was very light on chorizo and the spaghetti with cod had almost no fish taste as the cod pieces were so small.  To be fair it was probably very authentic Italian, and we are more used to an International Italian cuisine which is richer tasting. In any case would probably not go back despite the place itself being nice.", "date_of_review": "17 October 2018"}
{"review_id": 99916, "restaurant_id": 293, "username": "JonathanOB1", "date_of_visit": " October 2018", "rating": "5", "title": "Simple and very good Italian food", "comment": "Fantastic simple and very good Italian food. Italian run with great service and really good food. I had the pizza and it was superb. Staff friendly, nice easy atmosphere. Very highly recommended.", "date_of_review": "5 October 2018"}
{"review_id": 99917, "restaurant_id": 293, "username": "JD-ASCOT", "date_of_visit": " October 2018", "rating": "5", "title": "A proper taste of Italy...", "comment": "What a great find ! Fantastic food, simply presented. A lovely restaurant...light and airy...superb food, and, more importantly, absolutely excellent service, and reasonably priced..", "date_of_review": "24 October 2018"}
{"review_id": 99918, "restaurant_id": 293, "username": "Martin M", "date_of_visit": " September 2018", "rating": "5", "title": "Friendly authentic relaxed cafe style run by Italians", "comment": "This Italian eatery has a friendly authentic relaxed cafe style run by Italians. The pasta is home made as is the pizza dough which makes a great basis for all the wonderful food served here, prepared in an open kitchen area. We only dropped by once and are now regulars. My favourites: Bufala pizza and for dessert the unusual cheesecake made with basil and caper seasoning, deliciously different, try it. Highly recommended.", "date_of_review": "30 October 2018"}
{"review_id": 99919, "restaurant_id": 293, "username": "bentucker1986", "date_of_visit": " September 2018", "rating": "5", "title": "Tasty Italian ", "comment": "The previous reviews are all accurate... a really tasty Italian that is fairly priced. Found our new favourite pizza place.", "date_of_review": "22 September 2018"}
{"review_id": 99920, "restaurant_id": 293, "username": "feckingtuck", "date_of_visit": " August 2018", "rating": "5", "title": "Perfect lunch", "comment": "Great specials on the day. Professional and very friendly manager told us about the specials and the wine list. We had a very delicious squid ink risotto with fried prawns and an amazing king fish fillet with asparagus puree, chanterelle mushrooms and crispy garlic. The wine was a tasty and cold trebiano, washed it down beautifully. Impressed they make fresh pasta and bread daily. The place is spotless and has recently been redesigned and refurbished. Recommended", "date_of_review": "9 August 2018"}
{"review_id": 99921, "restaurant_id": 293, "username": "markgB209YT", "date_of_visit": " August 2018", "rating": "5", "title": "Best Pizza in Egham", "comment": "Acquolina is a superb restaurant serving genuine Italian food and great value for money and by far the best Italian Restaurant in Egham. The wines are also exceptional, carefully selected and I must of tried most on the list and they are all of high quality and unique. The athmosphere is is great and the team are very welcoming and nothing is too much trouble, all done with a smile. And finally, the whole experience offers great value for money for the high qulaity and amazing food.", "date_of_review": "6 September 2018"}
{"review_id": 99922, "restaurant_id": 293, "username": "Phoebe D", "date_of_visit": " January 2018", "rating": "5", "title": "Always had an amazing time", "comment": "Been here a few times with both my boyfriend and my friends and it always been amazing. My boyfriend is italian and got all excited at the authentic stuff that he hasn’t seen unless he is in Italy. All the food I have had has been fab with fresh ingredients and at really great prices. proud to have this fantastic restaurant in egham!", "date_of_review": "9 August 2018"}
{"review_id": 99923, "restaurant_id": 293, "username": "JennyandGareth", "date_of_visit": " September 2018", "rating": "5", "title": "Great Italian ", "comment": "This is a great Italian restaurant and by far the best in the surrounding area. Everything about this place is quality. We have eaten here about 10 times and it always been exceptional. Great food and staff. ", "date_of_review": "8 September 2018"}
{"review_id": 99924, "restaurant_id": 293, "username": "S7502HRdavidep", "date_of_visit": " August 2018", "rating": "5", "title": "Good pizza, friendly staff and not expensive ", "comment": "Yesterday after walking 10km around the Virginia water lake we stoped for an early dinner at the Acquolina in Bocca for a meal. The waiter was really friendly and 100% italian, the starters were tasty and the main meals (pizza and pasta) also perfects. So I definitely recommend this place. Recommended ", "date_of_review": "12 August 2018"}
{"review_id": 99925, "restaurant_id": 293, "username": "michele4444", "date_of_visit": " September 2018", "rating": "5", "title": "Great service, real italian pizzas", "comment": "Woaw ! That was the first good propper italian pizza I have had in the UK. The desert was great too. This place is family run and the service is very friendly. We'll be back !", "date_of_review": "10 September 2018"}
{"review_id": 99926, "restaurant_id": 293, "username": "Rutzie", "date_of_visit": " September 2018", "rating": "4", "title": "Nice food, especially the Gelato", "comment": "Our first visit, no starters (which meant that we had to wait a while for our food, but well worth it). We both had pasta dishes, one was more flavourful than the other but still enjoyable. Not huge portions but VERY good value. Great service, nice setting, everything very clean. I'll be back here", "date_of_review": "9 September 2018"}
{"review_id": 99927, "restaurant_id": 293, "username": "873mickys", "date_of_visit": " August 2018", "rating": "5", "title": "Incredible tasty and great service", "comment": "The pizza here is incredible fresh and tasty!!! The service is not less! We’ll come back here for the dinner! HIGHLY RECOMMENDED! ", "date_of_review": "6 August 2018"}
{"review_id": 99928, "restaurant_id": 293, "username": "matteov2015", "date_of_visit": " September 2018", "rating": "5", "title": "Finally good italian food in this area!", "comment": "Finally good authentic italian food in this area!!!! Congratulation to the owner for a very fine italian dining experience.  We had excellent pizza (by picky italian standard), excellent tiramisu and gelato. I’ll be back for sure!", "date_of_review": "10 September 2018"}
{"review_id": 99929, "restaurant_id": 293, "username": "Mike S", "date_of_visit": " June 2018", "rating": "5", "title": "Such a great restaurant", "comment": "The food is very nice, breakfast, lunch or dinner. The staff are friendly. You couldn't ask for more from an Italian.", "date_of_review": "16 June 2018"}
{"review_id": 99930, "restaurant_id": 293, "username": "c0achd0ugt", "date_of_visit": " September 2018", "rating": "5", "title": "Great value, service and taste", "comment": "Excellent simple Italian cuisine. Not much more needs be said. Although, I'd suggest the pizza and the chocolate lava cake!", "date_of_review": "18 September 2018"}
{"review_id": 99931, "restaurant_id": 293, "username": "Mfpcj", "date_of_visit": " July 2018", "rating": "5", "title": "Brilliant.", "comment": "An excellent place to eat. Very much a family atmosphere with a warm welcome. Limited menu but clearly well prepared and presented food. Definitively worth a visit.", "date_of_review": "7 July 2018"}
{"review_id": 99932, "restaurant_id": 293, "username": "VeatsJ", "date_of_visit": " July 2018", "rating": "5", "title": "Fantastic italian", "comment": "Wow...unbelievable food, outstanding service and great ambience could not rate it high enough..shame we have to leave.", "date_of_review": "14 July 2018"}
{"review_id": 99933, "restaurant_id": 293, "username": "Barry W", "date_of_visit": " July 2018", "rating": "5", "title": "Good traditional Italian", "comment": "My Italian students had been telling me about this place and how it's a REAL Italian place, and it's true. Outstanding pizza, interesting and tasty starters and (surprise in an Italian) good beer.", "date_of_review": "10 July 2018"}
{"review_id": 99934, "restaurant_id": 293, "username": "895tomi", "date_of_visit": " July 2018", "rating": "5", "title": "Great Food", "comment": "Excellent Food, Excellent Staff, Great Value and overall a wonderful experience. Highly recommended. ", "date_of_review": "22 July 2018"}
{"review_id": 99935, "restaurant_id": 293, "username": "Elizabeth W", "date_of_visit": " July 2018", "rating": "5", "title": "Great Food In A Friendly Restaurant!", "comment": "We came to Acquolina as a group of 5 people on Sunday evening for dinner. Our young female waitress was just lovely! Helpful, attentive without being intrusive. Very knowledgeable regarding the food. First time for all, to this restaurant & we all felt we had made a good choice I had the Pizza Asparagi, it was beautiful, others had the Ravioli, which was thoroughly enjoyed. I had the Cheescake Acquolina, for dessert, which was very unusual. Consisted of Basil, Chocolate, Capers & Tomato!!! Somehow the flavours worked very well & I would recommend to those who don't have a sweet tooth, but would like a dessert. My husband had the Panna Cotta, which was delightful Nice organic wines available. restaurant seemed very popular, pretty busy for a Sunday evening. Very reasonably priced. Would def visit again", "date_of_review": "22 July 2018"}
{"review_id": 99936, "restaurant_id": 293, "username": "sknight82", "date_of_visit": " August 2018", "rating": "4", "title": "Excellent meal", "comment": "Visited early on a Friday evening. The restaurant is clean and nicely decorated. Enjoyed starters of prawns and brucetta which were both excellent and very tasty. For mains we had a the beef ragu and the cod special, again excellent.  Desert enjoyed the cheesecake (very interesting) and the tiramisu. Deserts were rich so you could share one between 2 easily. Washed down with some decent house white. Bill came to about £70. Overall a very nice meal, not huge portions of pasta etc like you get in most Italians, but really excellent food that left us very content. I would recommend and will return.", "date_of_review": "4 August 2018"}
{"review_id": 99937, "restaurant_id": 293, "username": "dalais44", "date_of_visit": " July 2018", "rating": "4", "title": "Very good apart from the burnt pizza", "comment": "A good restaurant. The meals were good as were the waiting staff. They were very friendly and helpful. The pizza was good on top but the underside was totally burnt. I left a bit for the waitresses to take back to the kitchen.", "date_of_review": "31 July 2018"}
{"review_id": 99938, "restaurant_id": 293, "username": "deu11", "date_of_visit": " August 2018", "rating": "4", "title": "Tasty and fast dinner", "comment": "I been here with my husbund,we was in rush,food came really quik and was verry tasty!!Vincenzo was serving us a very prompt waiter!we defintly will come back!!", "date_of_review": "5 August 2018"}
{"review_id": 99939, "restaurant_id": 293, "username": "380zoee", "date_of_visit": " May 2018", "rating": "5", "title": "Julia was an amazing waitress", "comment": "I thoroughly enjoyed my meal here made only better by the service from Julia. to find someone with such a great work ethic and friendly chatty, smile in a small town like egham was wonderful. the meal was delightful and so was the wine suggested. #thankyou for the experience, I will sure be coming back again. ", "date_of_review": "1 May 2018"}
{"review_id": 99940, "restaurant_id": 293, "username": "LeeHibbert", "date_of_visit": " May 2018", "rating": "5", "title": "Nice find", "comment": "Dropped into here on the way home and so glad we did.  Really tasty food, very brave sausage and broccoli pizza which was really delicious.  Very friendly and helpful staff.", "date_of_review": "20 May 2018"}
{"review_id": 99941, "restaurant_id": 293, "username": "Moosie57", "date_of_visit": " May 2018", "rating": "5", "title": "Great lunch", "comment": "Brought here by our son and girl friend who live close by and eat here regularly. We started and shared two plates of bruschetta and then I had the aubergine pizza with a side salad, superb. The others had the carbannara and ravioli with wild boar. The tiramisu was amazing and not too sweet. Great coffee. Service was very good. Highly recommend this restaurant.", "date_of_review": "6 May 2018"}
{"review_id": 99942, "restaurant_id": 293, "username": "Tanya M", "date_of_visit": " May 2018", "rating": "5", "title": "Amazing!", "comment": "Once again, absolutely delicious! Service is brilliant and really good value. We will be back next week!", "date_of_review": "7 May 2018"}
{"review_id": 99943, "restaurant_id": 293, "username": "374christaw", "date_of_visit": " May 2018", "rating": "5", "title": "Lovely find ", "comment": "We thought we’d try this place out on a Sunday tea time. The interior has been sympathetically modernised so retaining the ceramic wall tiles and large doors as they were but opening the restaurant up to go a long way back but with natural light streaming in. The service was genuine and subtle and the food was lovely. We ordered the cod, spaghetti fungi and lamb cutlets. All the dishes were well presented and tasty but the lamb cutlets were amazing!  We noticed that the use of salt is kept to a minimum which some people may be disappointed with but we prefer to add our own and very pleased for the kids as in other restaurants the salt can be far to excessive for kids. Will defiantly come back ", "date_of_review": "21 May 2018"}
{"review_id": 99944, "restaurant_id": 293, "username": "PasticcoLondra", "date_of_visit": " May 2018", "rating": "5", "title": "A gem", "comment": "Popped in this place for a late breakfast: excellent coffee, discreet and attentive service and equally excellent breakfast. Italian sausages were meaty and tasty, eggs were fresh and of good quality, water was supplied constantly by the attentive waiters, vegetables were of good quality. As an Italian I strongly reccomend this place as serving quality food! Keep it up!", "date_of_review": "23 May 2018"}
{"review_id": 99945, "restaurant_id": 293, "username": "barrysC7686LQ", "date_of_visit": " June 2018", "rating": "5", "title": "Best ever breakfast ", "comment": "Fantastic food Highly recommend for breakfast seriously no one on the high street can match or better it", "date_of_review": "3 June 2018"}
{"review_id": 99946, "restaurant_id": 293, "username": "stuartf660", "date_of_visit": " May 2018", "rating": "5", "title": "Simply delicious", "comment": "It doesn't get better. I travel to Egham every week for business and as yet have found nowhere tastier. Superb food, great ingredients, cooked in front of you. The host are warm and friendly and the panacotta is sublime. ", "date_of_review": "30 May 2018"}
{"review_id": 99947, "restaurant_id": 293, "username": "alexhmichelle", "date_of_visit": " June 2018", "rating": "5", "title": "Perfect food & lovely service ", "comment": "Had a very lovely time eating here. We started outside but there was a group of people that were a little too loud (a bit drunk we think) so we had our starters which were absolutely lovely and promptly served by a very smiley, friendly and attentive waitress (whom we sadly forgot to ask the name of but she was tall & not italian!) and then moved to the outside part of the restaurant at the back, which we thought was a really lovely touch and authentically decorated to match the authentic italian food. The waitress and restaurant owner apologised for the noisy group which was through no fault of their own and made a point of checking on us to see if we were better after moving away. We then had our mains which were again, incredible and served in an appropriate amount of time after our starters. Overall superb service and superb food, we will come here again! ", "date_of_review": "10 June 2018"}
{"review_id": 99948, "restaurant_id": 293, "username": "alessiom581", "date_of_visit": " March 2018", "rating": "5", "title": "Very authentic Italian as I am", "comment": "A little gem in Egham organic food and wine, friendly staff and good values for money . We had a lovely carbonara with no cream and a very interesting panna cotta with pear. Definitely we came back again and again ", "date_of_review": "28 March 2018"}
{"review_id": 99949, "restaurant_id": 293, "username": "pfcuthbert", "date_of_visit": " March 2018", "rating": "5", "title": "Authentic food amd amazingly good value", "comment": "Relatively new to Egham high street and a very welcome addition. Authentic Italian food and remarkably good value. Breakfast is served on Saturday and Sunday mornings. I can wholly recommend the full english (including traditional Italian sausage) and the poached eggs with avocado and hollandaise. Service was great and the staff very friendly.", "date_of_review": "12 March 2018"}
{"review_id": 99950, "restaurant_id": 293, "username": "EatSleepEatRepeat", "date_of_visit": " March 2018", "rating": "5", "title": "Outstanding Pizza", "comment": "Wow, proved for 24 h sourdough Woodford pizza. If you like amazing pizza head down to Acquolina. It might just be the best pizza I've ever had....", "date_of_review": "30 March 2018"}
{"review_id": 99951, "restaurant_id": 293, "username": "768cyrill", "date_of_visit": " April 2018", "rating": "5", "title": "Best pizza in England!", "comment": "Excellent food but the highlight has to be the pizzas which are the best I have tried in England! The coffee is also really good.", "date_of_review": "2 April 2018"}
{"review_id": 99952, "restaurant_id": 293, "username": "Helen G", "date_of_visit": " April 2018", "rating": "5", "title": "Little gem in Egham", "comment": "This is the third time I have visited and everytime the food is fantastic and incredible value for money . The staff are very friendly and the service is excellent. I would suggest anyone to come if they like reasonably priced, super tasty homemade food. What more do you want!", "date_of_review": "16 April 2018"}
{"review_id": 99953, "restaurant_id": 293, "username": "Mach2sst", "date_of_visit": " April 2018", "rating": "2", "title": "An evening meal", "comment": "Very nice food but very limited menu, if you like a couple of pizza,s it,s fine. Had to try it as it was recently opened but will be a long time before i go back. Found it hard to find anything i wanted on the menu.", "date_of_review": "18 April 2018"}
{"review_id": 99954, "restaurant_id": 293, "username": "SJBerkshire", "date_of_visit": " March 2018", "rating": "5", "title": "Great - value for money - authentic pizza..!", "comment": "We have been visiting Acquolina In Bocca since it opened late 2017. Like others have said, menu is limited (pizza & pasta), but still offers variety for what I consider to be excellent value for money – great for an impromptu midweek pizza..! We usually eat Pizza, which are very very good, not your usual “chain restaurant” pizza, sough dough with fresh toppings, and freshly cooked in the wood over infront of you.  This past month, they have music on a Tuesday which gives off a great ambiance. Since day 1, staff have been friendly and helpful. A great little asset to Egham.", "date_of_review": "24 April 2018"}
{"review_id": 99955, "restaurant_id": 293, "username": "Tanya M", "date_of_visit": " April 2018", "rating": "5", "title": "Brilliant, simple, delicious Italian food", "comment": "think we have been there 5 times and each time more delicious. Its a smallish menu (also daily specials) with properly fresh cooked Italian dishes. Great 2 course for 9.95. Service is friendly without being 'over the top' and the food is always served quickly. Cannot recommend it more!", "date_of_review": "25 April 2018"}
{"review_id": 99956, "restaurant_id": 293, "username": "235NatalieF", "date_of_visit": " April 2018", "rating": "4", "title": "Girls lunch", "comment": "Lovely, friendly, warm atmosphere. Great food excellent choices on menu that take me back home !!!! Starters are well thought out and the pasta excellent as well. I have already booked for next week.", "date_of_review": "29 April 2018"}
{"review_id": 99957, "restaurant_id": 293, "username": "thebotleys", "date_of_visit": " April 2018", "rating": "4", "title": "Nice lunch venue", "comment": "Nice lunch with good vegetarian and meat options. Restaurant is run by Italians who are very welcoming. Décor clean and modern and nice to see they have preserved the original tiles and other features of the old butchers shop. Salads and pizza very good. 3 course lunch was £20.", "date_of_review": "28 April 2018"}
{"review_id": 99958, "restaurant_id": 293, "username": "Lisa-AS-203", "date_of_visit": " June 2018", "rating": "5", "title": "Excellent Italian ", "comment": "We have been to Acquolina In Bocca three times now and each time the food has been fantastic. We usually share a couple of pizzas to start. The dough is so soft and they are fresh proper authentic pizzas.  I have had the carbonara which I really enjoyed. It is different to a usual carbonara but is really good, the pasta is dense not a spaghetti and the sauce is really rich and flavoursome. I have also had the ravioli which was much lighter but also full of flavour.  The tiramisu is a delicious way to end the meal, as is the selection of ice creams, I particularly like the pistachio.  All is all it is a very welcoming place. The food is cooked in front of you in an open kitchen and it is fun to watch. The staff are really friendly and attentive.  We very much enjoy going to Acquolina In Bocca. ", "date_of_review": "15 June 2018"}
{"review_id": 99959, "restaurant_id": 293, "username": "Ruby2shoes2006", "date_of_visit": " March 2018", "rating": "4", "title": "Warm welcome", "comment": "We had a warm welcome, when arrived, nothing was too much, tried a couple of wines which were brought to table in large glasses, fresh glass for chosen wine. Waitress also gave us advice on the menu, had 3 courses wasn't disappointed all delicious, owner came over to take desert order, I have never had a Tirimusu that I liked, he said I should try again, delicious. Staff were on hand if we needed anything but didn't bother us or hurry us in any way. Came home with a sourdough loaf for breakfast, owner wouldn't let me pay for loaf..", "date_of_review": "8 March 2018"}
{"review_id": 99960, "restaurant_id": 293, "username": "barrysC7686LQ", "date_of_visit": " February 2018", "rating": "5", "title": "Best ever", "comment": "Came in for a quick lunch not knowing what to expect. We order pizza and a pasta dish both of which were outstanding and as good if not better than the meals we had in Rome earlier this year. Staff friendly. Decor light, fresh with simple seating arrangements making it ideal for a family meal or with that someone special.", "date_of_review": "11 February 2018"}
{"review_id": 99961, "restaurant_id": 293, "username": "TeamStorm13", "date_of_visit": " February 2018", "rating": "5", "title": "valentines day.", "comment": "we visited Acquolina for valentines evening dinner at 7pm. it was our first time visiting the new Italian restaurant in Egham. And it was a absolute delight to experience this new restaurant. The menu is simple and the new restaurant has clearly chosen quality ingredients over quantity of menu. we had the sharing Italian meats and mozzarella with tomato to start. and both enjoyed a pizza for main. The food was fresh and very delicious. extremely reasonable priced also with our pizzas only costing around £9 each. The staff were very friendly and attentive. good product knowledge of the drinks available. we ordered a bottle of prosecco and the waitress was very helpful in showing us which was the dryer tasting of the two available on the menu. honestly cannot fault this restaurant. definitely will be visiting this place again. and if you want good food for reasonable prices you should definitely try this place!", "date_of_review": "15 February 2018"}
{"review_id": 99962, "restaurant_id": 293, "username": "mdg2000", "date_of_visit": " January 2018", "rating": "5", "title": "Finally a good Italia Restaurant in Egham and not expensive !", "comment": "Everything good from pizza to the wide choice of pasta But what I liked the most is that portion are big enough and it is not so expensive like other Italian restaurant in the area. Ratio quality /price is ber very good !", "date_of_review": "13 February 2018"}
{"review_id": 99963, "restaurant_id": 293, "username": "seaneyb1", "date_of_visit": " February 2018", "rating": "5", "title": "Simply Amazing", "comment": "I've been to this restaurant twice now, the restaurant is clean, staff are super friendly, and the food is delicious! I would strongly recommend this restaurant to anyone looking for an authentic Italian meal! Even better the prices are amazing!", "date_of_review": "15 February 2018"}
{"review_id": 99964, "restaurant_id": 293, "username": "chiarabP9355OS", "date_of_visit": " January 2018", "rating": "4", "title": "Nice Restaurant", "comment": "Prices are good and fair enough. I have never tried something different from pizza margherita, which was nice, but all of my friends had different types of food and they were very satisfied.  Friendly staff, the owner is really nice too. Italian atmosphere guaranteed!!", "date_of_review": "15 February 2018"}
{"review_id": 99965, "restaurant_id": 293, "username": "Lorrie M", "date_of_visit": " February 2018", "rating": "5", "title": "Fantastic meal", "comment": "Tried this gem of a restaurant this weekend looking for a new Italian date night spot. We booked a table ahead and were promptly seated. Atmosphere is bright and cheery with beautiful and you can watch the pizzas being made. The food was delightful and we'll portioned. We split a few dishes since this was our first time: mussels, homemade wild boar ravioli, a ham, ricotta and mushroom pizza and the minestrone soup. All of the dishes were fresh, authentic and delicious. The pizza was the best I've had outside of Italy and we will most definitely be back. We wish we had room for dessert but will get the next time.  Pricing for this lovely meal was also very reasonable and overall we loved it and will be back gain.", "date_of_review": "19 February 2018"}
{"review_id": 99966, "restaurant_id": 293, "username": "sawf93", "date_of_visit": " February 2018", "rating": "3", "title": "Clearly in the minority.", "comment": "I will be honest at the start by saying, as I have previously, that I’m not a huge fan of Italian food. Some might say that I’ve not eaten at the right places, but to me most dishes especially the pasta dishes are generally really bland.  It was my wife’s birthday and she does like Italian food, so I thought it only right to try out Acquolina, as it hadn’t long reopened in its’ latest version. The first impression was that the decor was tasteful and well finished. The welcome was warm and we were promptly seated and provided with menus. Normally I think it’s a big plus point when a menu is small. You know full well when you are given one with a huge selection, that little is going to be freshly cooked. However, the choice here was limited to basically Pasta or Pizza, no separate meat or unusually (for Italian) fish dishes. The result of which meant I was onto a bit of a loser (as I would often go for a meat dish).  I might have gone for the Ventricina e Chorizo pizza but the starter I preferred was the Brushetta ventricina, so instead of duplicating, went for the Ravioli con Cinghiale (wild boar ravioli). In line with the main menu, the drinks menu is also compact and I think that there are quite a few like me, that don’t drink a lot of wine, so only one beer option is limiting, but I do like Moretti, so no complaints. The starter was Ok, and the Ventricina which was described by the waitress as a spicy, spreadable meat, reminded me of the meat pastes I ate as a child. It was also topped with halved fresh tomatoes, which I expected but produced a strange contrast with the warm bread as they were very cold as if it had just come out of the fridge or from outside (and it was a cold night).  I’m sorry to say that I found the ravioli disappointing. It consisted of about 10 little packets which were pale almost grey in appearance on their own (no sauce of any kind) (probably intended) with the minced meat inside. Sadly, it was a bit lacking in taste as I couldn’t have identified the meat in a taste test. The dish also highlighted a common aspect of Italian food I dislike, which was no vegetables to accompany it, and there was no option on the menu. The best part was the Cappuccino mousse desert and nice coffee.  The birthday girl, went for a Salmon and spinach or courgette(?) pasta on the Specials which she did enjoy, though she commented that the vegetable was sliced too thin to be distinguishable.  So overall, the food was well cooked and fresh, it was not a stand out meal for either of us, though it was reasonably priced. There are a couple of other Italian restaurants in the area, I would personally favour though. Having said that, the place was very busy for a Tuesday night. Quite a few people coming in for pizzas to take away so clearly there are more than a few people who disagree with me. I’ve also spoken to other friends who have visited the restaurant, who did like it. The pizzas are apparently excellent, so maybe I wouldn’t be so hard if I’d made that choice.", "date_of_review": "17 February 2018"}
{"review_id": 99967, "restaurant_id": 293, "username": "voonew", "date_of_visit": " February 2018", "rating": "5", "title": "A night on the tiles", "comment": "An Italian friend has lunch at this place every week and told me she was worried that it was too authentic for British people. That made me want to go of course and we loved it. Received a very warm welcome on a chilly night, the waitress helped us with a couple of menu queries and we both loved what we ordered - especially my mussels starter and my husband's carbonara main and tiramasu pudding. The wine was great too but we forgot to note what it was. I'm glad to see they've kept the beautiful old tiles in and outside the building too.", "date_of_review": "16 February 2018"}
{"review_id": 99968, "restaurant_id": 293, "username": "Kerstin21", "date_of_visit": " February 2018", "rating": "5", "title": "Great Italian Restaurant", "comment": "We had a lovely lunch today for my sons 21st birthday - friendly staff, lovely decor and the most delicious pizza! We even came away with a loaf of their homemade sour dough bread! What a gorgeous restaurant! Couldn’t fault it at all!", "date_of_review": "21 February 2018"}
{"review_id": 99969, "restaurant_id": 293, "username": "roshans268", "date_of_visit": " January 2018", "rating": "4", "title": "Very good pizza, Needs buffalo mozzarella", "comment": "fantastic sourdough napoli style pizza, the cheap mozzarella hugely lets down the pizza though just add buffalo mozzarella to the menu and just charge a bit more for it and it would be absolutely amazing. best pizza i have had outside of central London in England. Again just please add buffalo mozzarella.", "date_of_review": "28 January 2018"}
{"review_id": 99970, "restaurant_id": 293, "username": "Summer W", "date_of_visit": " November 2017", "rating": "5", "title": "The most delicious carbonara", "comment": "The only problem I’ve had with Acquolina is that the carbonara is so good I’m yet to try anything else on the menu (and it’s gluten free!).  The staff are always super attentive, the setting is so beautiful and the value for money is astonishing. I would recommend to anyone especially those gluten free people who miss being able to eat pasta in restaurants. ", "date_of_review": "25 November 2017"}
{"review_id": 99971, "restaurant_id": 293, "username": "JeanneR204", "date_of_visit": " November 2017", "rating": "5", "title": "New find", "comment": "Very welcoming, lovely staff, good atmosphere, great food and wine. Strongly recommended and within walking distance", "date_of_review": "30 November 2017"}
{"review_id": 99972, "restaurant_id": 293, "username": "RebecaA374", "date_of_visit": " December 2017", "rating": "5", "title": "Delicious food, amazing staff", "comment": "The place is new, welcoming and delicious. The staff is very kind and professional. I recommend this restaurant to families and students, it has accessible prices and a great variety of food both for kids and adults.  The products are all organic and handmade, they use only Italian products and the freshness can be easily perceived.", "date_of_review": "6 December 2017"}
{"review_id": 99973, "restaurant_id": 293, "username": "spikefromsurrey", "date_of_visit": " December 2017", "rating": "5", "title": "Great food, great staff", "comment": "Quite short pizza & pasta menu topped up by daily specials. All courses delicious and great value for money, hence the rare five stars. Some flouncy touches with the service but add to fun. Well worth a visit, and walking distance from Red Lion if you fancy a pint before or after.", "date_of_review": "7 December 2017"}
{"review_id": 99974, "restaurant_id": 293, "username": "Tim S", "date_of_visit": " December 2017", "rating": "4", "title": "You have to try this place", "comment": "We have eaten at Acquolina three times in the past month and loved every meal. The short menu is supplemented with a daily specials board. There is a wood fired oven and the pizzas look tasty, although we have had pasta every time so far. The black linguini are delicious, as is the beef ragu. Top of our list so far is the seafood minestrone. The staff are very friendly, the decor bright and the value extraordinarily good. This place deserves to do well.", "date_of_review": "15 December 2017"}
{"review_id": 99975, "restaurant_id": 293, "username": "Paula N", "date_of_visit": " December 2017", "rating": "5", "title": "Amazing food & Airy space", "comment": "This is a fairly new spot in Egham. My husband and I have been there twice so far - for breakfast & his birthday brunch. I love the airy space and the great food. They do amazing pizzas, fresh juices and waffles. We also very much enjoyed their version of the English breakfast. Totally recommended!", "date_of_review": "17 December 2017"}
{"review_id": 99976, "restaurant_id": 293, "username": "A1339JYbenw", "date_of_visit": " January 2018", "rating": "5", "title": "Best pizza in Egham", "comment": "This is one of the best pizza I had, the Atmosphere in this restaurant is good. The staff are good and the service is quick.  I like it how you can see your pizza being made and the pizza are nice and fluffly I recommend this restaurant, this is coming from someone who lives in Egham", "date_of_review": "24 January 2018"}
{"review_id": 99977, "restaurant_id": 293, "username": "piccolapenny", "date_of_visit": " December 2017", "rating": "5", "title": "Very good!", "comment": "I'm originally from Naples and have tried Acquolina's pizza on several occasions now. Fresh ingredients and a very digestible dough - I'm gluten intolerant, so I immediately can tell if they know what they're doing with the rising process. I've also eaten there a couple of times: excellent ingredients and original recipes. Maybe just the 'primi piatti' (pasta dishes) where a bit dry (both mine and my husband's). Apart from this, you can't fault them. Nice, clean place, friendly staff, affordable prices and positive vibe! Keep going, guys.", "date_of_review": "6 January 2018"}
{"review_id": 99978, "restaurant_id": 293, "username": "Lara T", "date_of_visit": " November 2017", "rating": "5", "title": "Mamma mia!", "comment": "A little gem! I went for the first time today with my 5 years old boy and we loved everything about it. Classy menu, fresh produce, very current Italian cuisine: it would work well in Milan, as it's hipster, sharp and fresh. A must.", "date_of_review": "19 November 2017"}
{"review_id": 99979, "restaurant_id": 293, "username": "anniehol1317", "date_of_visit": " January 2018", "rating": "5", "title": "Lunch", "comment": "We had a coffee with a friend at Aquilina in Egham and looked at the menu....like you do! We liked the look of it, so did some shopping and called back an hour or so later. So pleased we did......fab, authentic Italian food, without all the anglicised bits and bobs added. It was very reasonably priced, plenty of it and the whole place was clean and tidy. Very friendly owner/manager (Mauricio) and staff - everybody keen to please. An added bonus.....home baked bread on sale, we took some home and it was delicious. We will be returning soon!", "date_of_review": "25 January 2018"}
{"review_id": 99980, "restaurant_id": 293, "username": "mikerE4917RF", "date_of_visit": " October 2017", "rating": "5", "title": "Awesome!", "comment": "Great food , great service, great atmosphere. My friends and I found it mouth watering (or “Acquolina In Bocca” in Italian) and would return!", "date_of_review": "25 October 2017"}
{"review_id": 99981, "restaurant_id": 293, "username": "ElenaVasilyev", "date_of_visit": " October 2017", "rating": "5", "title": "Excellent service, delisious food, good atmosphere", "comment": "Just went to Acquolina In Bocca for a quick lunch with a colleague. Food was absolutely perfect - special Halloween risotto and bacon/avocado salad were the best I ever had. Service was great too. Very reasonable priced restaurant, great central location, we will definitely be back to try everything else on the menu", "date_of_review": "31 October 2017"}
{"review_id": 99982, "restaurant_id": 293, "username": "sallysharp", "date_of_visit": " October 2017", "rating": "5", "title": "Stunning setting and fabulous food", "comment": "Friendly and very helpful service. Excellent range of choices for starters, mains and desserts for vegetarians and vegans.", "date_of_review": "3 November 2017"}
{"review_id": 99983, "restaurant_id": 293, "username": "F9021TBcharlotteh", "date_of_visit": " October 2017", "rating": "5", "title": "Flawless dinner at Acquolina", "comment": "Excellent speedy service, delicious food and a reasonable price. Pizza was cooked to perfection. We’ll be back!", "date_of_review": "7 November 2017"}
{"review_id": 99984, "restaurant_id": 293, "username": "David_The_Runner", "date_of_visit": " November 2017", "rating": "5", "title": "Excellent pizza at a very reasonable price.", "comment": "We were in the area and picked this restaurant as we walked along the main street based largely on the fact it seemed popular. And we can see why - the staff were friendly, efficient and helpful, and the food was first rate. And all for nearly half the price we've paid in other local Italian restaurants. We will return.", "date_of_review": "16 November 2017"}
{"review_id": 99985, "restaurant_id": 293, "username": "143beatrices", "date_of_visit": " October 2017", "rating": "5", "title": "Amazing food & Amazing people", "comment": "The best pizza I've ever had! The staff are welcoming and friendly. Highly recommend for families or date night.", "date_of_review": "9 November 2017"}
{"review_id": 99986, "restaurant_id": 293, "username": "MissKinga", "date_of_visit": " November 2017", "rating": "3", "title": "Good Italian food", "comment": "I have visited this restaurant at lunchtime today with a colleague and it was OK. We are not easy people - I am gluten intolerant and she is vegetarian so it was not too easy to find a suitable main for us. The chef was really nice and came to our table to make sure we know our options. He mentioned they have now gluten free pasta and salads and they can even make risotto which is not on the menu to cater for gluten intolerant people. The service was not quick enough for our lunch time I'm afraid, although it might be because of the gluten free version of the main. Altogether nice staff and good service and the food was good although a bit salty.", "date_of_review": "16 November 2017"}
{"review_id": 99987, "restaurant_id": 293, "username": "hevax", "date_of_visit": " November 2017", "rating": "5", "title": "Very good Italian ", "comment": "Very good Italian with a small but lovely menu. I would highly recommend the coffee mouse for dessert, it’s very light. One thing though the menu is hard to read because of the font and size so make sure you take your glasses! But the waitress we had was extremely helpful and knew everything on there like back of her hand. Thank you for a lovely dinner! ", "date_of_review": "18 November 2017"}
{"review_id": 99988, "restaurant_id": 293, "username": "justin c", "date_of_visit": " November 2017", "rating": "5", "title": "A little bit of Italy in sunny egham", "comment": "A splendid new offering. Brilliant, attentive well informed service matched by exceptionally well cooked and sourced food. the pizzas have soft and tasty dough from bespoke flour. Superb toppings with hand picked mushrooms and classy meats. Good coffee too. Restaurant obviously prides itself on serving the highest quality meals in very cultured and elegant circumstances.", "date_of_review": "18 November 2017"}
{"review_id": 99989, "restaurant_id": 293, "username": "wswoody1", "date_of_visit": " October 2017", "rating": "5", "title": "Great Pizza", "comment": "We visited Acquolina in Bocca and wasn’t disappointed. We enjoyed 3 courses of delicious food at a reasonable price. You couldn’t ask for more. We will definitely be back. ", "date_of_review": "20 October 2017"}
{"review_id": 99990, "restaurant_id": 293, "username": "J3783JGgiovannic", "date_of_visit": " October 2017", "rating": "5", "title": "This is the real deal!", "comment": "Stopped by with a friend for a quick lunch. We had two pizzas and a couple of glasses of wine. Pizza was excellent, one of the best we've ever had: crunchy crust, fresh ingredients (we added buffalo mozzarella also..mmmh) a proper pizza! The selection of wines is also very good, with some less known wines worth a couple of glasses. A really Italian experience!", "date_of_review": "25 October 2017"}
{"review_id": 99991, "restaurant_id": 293, "username": "eharriet123", "date_of_visit": " October 2017", "rating": "5", "title": "Great food!", "comment": "Visited recently and my Dad said he had the best carbonara that he had ever tasted! Great food, pizza was lovely, thoughtful staff and lovely interior, definitely recommend ☺️", "date_of_review": "23 October 2017"}
