{"review_id": 1, "restaurant_id": 6, "username": "Adrian B", "date_of_visit": " November 2020", "rating": "5", "title": "Amazing", "comment": "Another amazing take away from LDV, thank you very much for your good food see you the 12th december"}
{"review_id": 2, "restaurant_id": 6, "username": "Phil C", "date_of_visit": " November 2020", "rating": "5", "title": "Another wonderful delivery from LDV", "comment": "Our delivery meals from here have been a family favourite in both lockdowns. The latest was sensational, especially the prawn garlic starter, the Ragu pasta and the tiramisu. One tiny comment - it would be good to have an option (for extra payment perhaps) to get the food in recycling friendly paper / cardboard, which some places now offer."}
{"review_id": 3, "restaurant_id": 6, "username": "890isabelw", "date_of_visit": " November 2020", "rating": "3", "title": "Lovely food, unfortunately cold", "comment": "It’s the first time we’ve ordered from Dolce Vita. We’ve made it our mission to support local restaurants during COVID. We ordered pizza, garlic pizza bread and arancini through Uber eats. It was delivered on time however all the food was cold. We could tell the food had good flavours but we were disappointed the food wasn’t warm. "}
{"review_id": 4, "restaurant_id": 6, "username": "Elena P", "date_of_visit": " November 2020", "rating": "5", "title": "Take away", "comment": "Another amazing meal from LDV, arancini the best, together with pappardelle boar and fettuccine speck, game gnam"}
{"review_id": 5, "restaurant_id": 6, "username": "francao194", "date_of_visit": " November 2020", "rating": "5", "title": "Great take away", "comment": "Take away very tasteful as usual and speedy at HOME! Compliments Maurizio for the care You and Your team give to all your customers and any order! I Am a regular guest and will book a table very soon. I can't wait to visit your lovely restaurant again and enjoy your great food and pleasant atmosphere! Thank you!"}
{"review_id": 6, "restaurant_id": 6, "username": "Harveyhill5", "date_of_visit": " December 2020", "rating": "5", "title": "Superb restaurant, excellent", "comment": "Superb restaurant, excellent service and brilliant food. Absolutely top class service with a personal touch, worth a visit "}
{"review_id": 7, "restaurant_id": 6, "username": "385bernicek", "date_of_visit": " December 2020", "rating": "5", "title": "We love Dolce Vita!", "comment": "So good to be able to be served again by you guy! Great pizza, best Carbonara,we have always enjoyed eating at Dolce Vita! Proper independent local Italian!"}
{"review_id": 8, "restaurant_id": 6, "username": "Beth_Smiles", "date_of_visit": " December 2020", "rating": "4", "title": "Great food at reasonable price", "comment": "We sat outside in the patio area which was warm due to a marquee and heaters. My friend and I were able to sit diagonally across the table due to COVID and had a lovely meal. Food was good and the pasta and pizza is mostly £12.95 per person. Staff were great :)"}
{"review_id": 9, "restaurant_id": 9, "username": "Mjones8585", "date_of_visit": " October 2020", "rating": "5", "title": "Fun time had by all", "comment": "I went with a friend to celebrate her birthday by enjoying a bottomless brunch. The service was excellent and staff took care of the dog too. Thanks especially to Raymond!"}
{"review_id": 10, "restaurant_id": 4, "username": "Manish K", "date_of_visit": " September 2020", "rating": "5", "title": "Nice experience", "comment": "Had been to Madhu's to celebrate my wife's 50th Bday. Brilliant arrangements in covid situation. Temp check, table spacing etc. Nice ambience and lovely food. Parking is not an issue at Sheraton."}
{"review_id": 11, "restaurant_id": 4, "username": "sunakay", "date_of_visit": " September 2020", "rating": "5", "title": "Real good fine dine place", "comment": "Oh what a delicious surprise of authentic north indian flavour their thalis are! Four different chutneys served complimentary with papads were real yummy. Drinks looked attractive and were duly intoxicating,old bastard being the surprise of the pack . Hadn't ever heard of a wine by that name ! The ambience and service were all 5 star. Thanks \"Cobra\" and \"eat out to help out\", it all came at a 3 star price."}
{"review_id": 12, "restaurant_id": 4, "username": "markhQ1669GP", "date_of_visit": " September 2020", "rating": "5", "title": "Excellent Indian restaurant near the airport", "comment": "It was great to come across this gem of a restaurant, food was excellent as was the service, I would highly recommend it as the thali platter was amazing and so tasty. You will not be disappointed. With the background of food being cooked on an open fire the Robata was a great effect."}
{"review_id": 13, "restaurant_id": 4, "username": "JaanJMan", "date_of_visit": " August 2020", "rating": "1", "title": "1 mile away from far better Indian Food", "comment": "My advice to anyone considering going here is...don't. Mediocre Indian food wrapped up as \"Fine Dining\". Small expensive portions, untrained staff and bland food. My suggestion? Jump in a cab travel 1 mile to Hounslow West and savour the best Indian Food in West London. Authentic, full of rich flavours at one third of the price. Madhus chefs cook anglicised food which lacks the subtle yet full flavours of spices that makes Indian food unique. It was actually someone we were chatting to over breakfast in the hotel who suggested we give Madhus a miss as they had eaten there the night before. So glad we took their advice!"}
{"review_id": 14, "restaurant_id": 4, "username": "Mish M", "date_of_visit": " September 2020", "rating": "5", "title": "Good food", "comment": "We have been reluctant to eat out due to COVID but this place has been really been adapted in line with guide lines .We had their Thali Although not big potions the food was good and filling .The waiters were all very attentive and friendly .Good to see all staff wearing face masks which we have not seen in majority of Indian restaurants close by ."}
{"review_id": 15, "restaurant_id": 4, "username": "poppadompreach", "date_of_visit": " October 2020", "rating": "5", "title": "⭐️ ⭐️ ⭐️ ⭐️ ⭐️ 5 stars to Sanjay and ‘Team Madhu’s", "comment": "We had the pleasure of an excellent dinner recently , having gone with some trepidation in the current climate , but hopefully this review can help give the added reassurance that others may need . Warm welcome at the entrance and whilst strict COVID requirements were in place ( ie contact details , hand sanitising , temperatures checked and spacing ) we were nevertheless greeted with a cordial and efficient process and treated as a valued guest . Tables were well spaced out , and all serving staff were suitably masked .  Food was it’s usual high standard , I can certainly vouch for the vegetarian options of paneer tikka , soft and flavoursome , harra barra kebab equally good , assortment of popadoms with fresh chutneys and my guests from the USA were highly complimentary about the mixed grill platter .  Mains and a selection of breads were once again on point , as always generous portions , served piping hot , not too oily or spicy , salt levels perfect and all dishes were distinct in look and flavours , hard to pick a stand out dish , but the Punjabi Khadi just got to the winning post.  The meal wouldn’t ha e been complete without dessert and we were spoilt for choice with a delightful trio of Gajjar Halwa , Gulab Jamun and Kulfi . Service was subtle and professional , plenty of staff on hand , and nothing was too much trouble , any ad hoc requests met with a smile . All in all an top marks and look forward to a return visit soon"}
{"review_id": 16, "restaurant_id": 2, "username": "miss_simone_adele", "date_of_visit": " August 2020", "rating": "1", "title": "Rubbish", "comment": "We booked our table for around 9pm, upon arrival we were escorted to a very poor closed off table, the atmosphere was somewhat busy but began to calm down. We asked if we can go into the shisha garden and was told it was first come first serve which I think should definitely be changed into a booking thing as it’s not fair for those that have literally come to do shisha. We were promised by multiple staff that they will get us into shisha and an hour later - still nothing. We ordered our drinks which were a simple soft drink and had to wait a good half an hour for them, the staff were quite busy but not as attentive as I hoped. The music was poor. Social distancing did not exist. It’s a shame because in the past I’ve heard good things about this place but by the looks of the latest reviews, it’s gone seriously downhill. "}
{"review_id": 17, "restaurant_id": 2, "username": "j2004p", "date_of_visit": " August 2020", "rating": "1", "title": "such bad service", "comment": "my family went to have a birthday dinner and drinks came half an hour late, only half the starters came, and dinner came at 10:30pm. The food we ordered came stone cold, and we only ordered one veg option and didn’t even show up! the manager had such a bad attitude and didn’t come to apologise once. never returning here as such bad service"}
{"review_id": 18, "restaurant_id": 2, "username": "Roving730889", "date_of_visit": " September 2020", "rating": "5", "title": "Overall 9/10.", "comment": "Food 9/10  Shisha 9/10  Ambiance 10/10 Cleaniness 7/10 Staff 9/10 Drinks 10/10 Do try Masala chips and PinaColada. Try to visit the place for lucnch as its busy at night and its hard to get a place and food on time"}
{"review_id": 19, "restaurant_id": 6, "username": "Cosmopolitan581690", "date_of_visit": " October 2020", "rating": "5", "title": "AMAZING ITALIAN HIDDEN GEM OF TEDDINGTON", "comment": "Hidden gem of Teddington ! Food is absolutely UNREAL, lovely Italian restaurant, amazing staff. Highly recommend. Genuinely best pasta I’ve had in years."}
{"review_id": 20, "restaurant_id": 6, "username": "T7019EBoscarc", "date_of_visit": " October 2020", "rating": "5", "title": "Great Food and very good value", "comment": "lovely outdoor eating area with great atmosphere and very friendly service. visited with my grandma and they had a great gluten free and vegan for her."}
{"review_id": 21, "restaurant_id": 9, "username": "Colette G", "date_of_visit": " October 2020", "rating": "5", "title": "Amazing service", "comment": "Downloaded the revolution app and used that to buy my drinks and they came very quickly and with a discount as came during happy hour. However, my friend hadn’t downloaded the app, but the staff (ash especially) were very accommodating! Would definitely recommend very good atmosphere and follow all covid guidelines (felt very safe)"}
{"review_id": 22, "restaurant_id": 9, "username": "Love2mucheat", "date_of_visit": " October 2020", "rating": "4", "title": "Afternoon tea", "comment": "We had a really good time. The service by Joe was great. The cocktails were really good! A little dissapointed with the Afternoon choice of sandwich portion size? Thank you all the same."}
{"review_id": 23, "restaurant_id": 9, "username": "Turaine C", "date_of_visit": " October 2020", "rating": "5", "title": "Enjoyable experience", "comment": "It was my second time, attending this bar and the atmosphere, scenery and staff are incredible. The staff go above and beyond to interact with customers, even though the COVID pandemic is happening. They make you feel at home, they welcome you with a smile and they treat you like their own. The drinks are extremely cheap and worth the price. The entire atmosphere in a nutshell, is a stimulating experience. I would like to give a shout-out to Ash, she was incredible. Polite, well mannered and a joy to be around. During such a hard time in the world, she is still able to keep a smile on her face and enjoy her job. Customer service is about putting customers first and Ash did exactly that. WELL DONE!!"}
{"review_id": 24, "restaurant_id": 2, "username": "RFLondo", "date_of_visit": " August 2020", "rating": "5", "title": "Great experience", "comment": "Visited this restaurant with my friends yesterday and i must say that we had a lovely evening. Nice ambiance, friendly staff. Although last minute visit, we managed to get a nice table. Thanks to the Restaurant Manager who was very helpful and made our experience an amazing one. Food and service was excellent. Well managed, much recommended to visit this place."}
{"review_id": 25, "restaurant_id": 4, "username": "312StephenB", "date_of_visit": " January 2020", "rating": "5", "title": "Delightful food", "comment": "I visited with 2 work colleagues in January 2020. The food was excellent - we had a range of starters to share and then just a main course of chicken. Garlic prawns starter was particularly lovely. Few drinks plus service charge and it was just above £50 a head."}
{"review_id": 26, "restaurant_id": 2, "username": "S9travels", "date_of_visit": " January 2020", "rating": "3", "title": "Okay but really rushy", "comment": "This is my local, so I’ve been here a few times in the past and it’s always been the closest to a really decent Indian meal and a nice chill place. However recently I’ve noticed how quick they are to rush you out. We booked a table and although we were a bit late the food took ages and they were trying to rush us out. I feel they shouldn’t over book and allow customers to take there time (or get more tables)."}
{"review_id": 27, "restaurant_id": 2, "username": "haaychmalick", "date_of_visit": " March 2020", "rating": "3", "title": "Service", "comment": "Been before a few times , always had some issues but had to put it up today. Well for starters nobody to greet or sit u down have to stand there like n idiot then servers don’t even know if we been served then ordered frozen blueberry and was given something else. Asked to change and probably changed the foil n brought it back good came without full set of cutlery orders cook dint come had to ask after 10 minutes of food being delivered. Servers are busy either talking to women or among themselves which ain’t professional. Dint want to pay for shisha yet paid. Same happened on previous visit."}
{"review_id": 28, "restaurant_id": 2, "username": "rajp330", "date_of_visit": " August 2020", "rating": "2", "title": "Bland food when ordered curries extra spicy", "comment": "Just visited the restaurant this evening for a meal with my family.  Was fairly quiet and no one was being rushed.  Had made a booking so got seated fairly promptly.  For our mains me and my wife asked for our curries to be made extra extra spicy. The waiter said that he would bring extra green chillies on the side rather then making the curry extra extra spicy like we requested to which we said no and asked for the curry to have extra chillies in it instead; he agreed to have it made this way. Were our curries extra extra spicy? No, not at all. Maybe they were for the chef but my Paneer Butter Masala tasted sweet more like a Butter Chicken and my wife Paneer dish was was also very mild. Very disappointed with the food today and glad that I don't come here on a regular basis as there are far better places elsewhere. Also not once did anyone come to ask if the food (starters and mains) were fine but did ask me, only when passing by, whether I wanted another beer.  I'll probably get the same copy and pasted reply from the manager apologising and telling me that they would love to see me again next time.  No thanks, you don't run that great a place. "}
{"review_id": 29, "restaurant_id": 2, "username": "Rachsmith01", "date_of_visit": " July 2020", "rating": "1", "title": "Miss", "comment": "Me and a few friends visited, we got told the waiting time was around 20 minutes, this was a complete lie as we waited over an hour! When we finally got in the service was awful, the shisha took almost an hour to come and wasn't the correct flavours! After speaking with the manager he did not seem to care at all and was very rude and obnoxious! We will not be visiting here again!"}
{"review_id": 30, "restaurant_id": 2, "username": "59sylwial", "date_of_visit": " August 2020", "rating": "1", "title": "Really bad experience!", "comment": "I am so disappointed with this place !!!! The toilets were disgusting and the food and drinks were 45 min late . Will never recommend this place !"}
{"review_id": 31, "restaurant_id": 2, "username": "Rajyadav1", "date_of_visit": " August 2020", "rating": "2", "title": "Staff with attitude and poor service!", "comment": "Visited with family, and all they wanted to do was rush you along. Waiter was awful, we waited 40 mins for our drinks and then they were wrong.Took our food order, 2 mins later we realised we ordered an incorrect dish and was told it can't be changed!Asked for one of the managers (man with a ponytail) who told us he can't do anything even though we ordered 2 mins ago,he was very rude and full of attitude and behaved like he was doing me a favour.This man should not be front of house but placed behind the scenes maybe washing dishes! Starters came one at a time so we could not enjoy the selection. Ordered a milkshake for my child never arrived, by this time I complained again and finally got a waiter who was much better and got our mains order correct, it arrived cold but by that time I had given up. I have never experienced such poor behaviour and lack of hospitality when you are paying premium prices. Don't go unless you want to treated like an idiot and stay away from the rude manager with a ponytail, he obviously has no interest in retaining regular diners."}
{"review_id": 32, "restaurant_id": 2, "username": "muhammadmustafa028", "date_of_visit": " August 2020", "rating": "1", "title": "Worst ever!!!", "comment": "I went there with my friends to have dinner and smoke shisha , we were waiting like 30min at the door no one was paying attention even it was not busy ,staff was walking around no welcoming nothing, then we had to go somewhere els"}
{"review_id": 33, "restaurant_id": 2, "username": "louise783", "date_of_visit": " August 2020", "rating": "2", "title": "Not as good as expected", "comment": "Starter was nice but mains were terrible I had butter chicken it tasted like Heinz tomato soup no real flavour I was very disappointed would not return my husband had rogan josh chicken was tough and chewey, service wasn’t great either very slow. They delivered our food with no cutlery husband went to get it himself but they said they would bring it, they put the 12.5% service charge on the bill, if they hadn’t I wouldn’t have given them a tip, all in all I would not return there again I would say it is way over priced it is not quality food so they need to either up their game or lower their prices, they do say you only get what you pay for I paid £44.00 too much."}
{"review_id": 34, "restaurant_id": 2, "username": "rahats2017", "date_of_visit": " August 2020", "rating": "2", "title": "Bad reception service and food", "comment": "Receptionist had no experience of the COVID app use to keep records And Told us two tables were booked that we liked but offered others to choose An hour later  The waitress delivered our starter and we received main course 35 mins late  Whilst all staff passed our table noticing us with no food  The food was very Bradley described  Masala Moro was full of of red chilliest and very hard The Goan fish had too much haldee and no None coconut taste as described  Biryanee was not cooked fully  The whole meal appeared rushed or chef was absent  Very disappointing  Not even a glass of water offered as apology"}
{"review_id": 35, "restaurant_id": 4, "username": "LucyBWM", "date_of_visit": " January 2020", "rating": "5", "title": "Amazing!", "comment": "We went here for our staff party and were greeted by all smiling faces. Very impressed by the food quality and the service.  Thanks a lot!"}
{"review_id": 36, "restaurant_id": 4, "username": "Ashtoashes", "date_of_visit": " February 2020", "rating": "2", "title": "Oh dear", "comment": "Broccoli and Cauliflower  BBQed with body heat or the cooks breath.Terrible . Chaat Papdi   I felt as if the papdi had had a bit of naughty rumpy pumpy with moth balls! what’s there in a chaat ?colloquially it means to lick .Signifying that the preparation is so good you lick it ,around here you will only do it if you suffer from hereditary dysgeusia and are on a study cohort that is working to find a cure for it  Papadom platter  Served with a hair , the hair was either from a head ( wasn’t my bonce for sure, here they are very short and Gray) or a face ( wasn’t mine either, your truly is clean shaven ,on the face ! ) why I say with some degree of certainty about its anatomical antecedents because it wasn’t curly, either ways it wasn’t on the menu so I wasn’t expecting it and I didn’t bring it up as I do not work for Alpecin . The Chairs The chairs have towel rings at the back. Why ? 5 The Waiting Staff Attentive ,welcoming, pleasant .  Overall here I quote the late AA Gill: \"This is a restaurant constructed to attract everybody, but will please nobody. It wants to be popular to make money, but without effort or enthusiasm. It is the collective wit of layers of management and consultants, who no doubt all together understand a great deal about catering but plainly very little about hospitality\""}
{"review_id": 37, "restaurant_id": 4, "username": "Gareth64", "date_of_visit": " February 2020", "rating": "4", "title": "Excellent food and service", "comment": "Excellent food and service, plenty of choice and everything was cooked lovely. Attentive staff who ensured you were well looked after."}
{"review_id": 38, "restaurant_id": 4, "username": "Ronnie D", "date_of_visit": " March 2020", "rating": "5", "title": "40th birthday meal", "comment": "Great venue, food was incredible and service was outstanding. Will definitely be returning. My wife and family had a great time. "}
{"review_id": 39, "restaurant_id": 4, "username": "Kumarpeeh", "date_of_visit": " February 2020", "rating": "3", "title": "Very average", "comment": "Small portions and very expensive food for what it is. Service is annoying as they keep coming to your table asking you to order more. Food is quite spicy even though we told them to keep the spices down. Drinks are also very overpriced - £11 for a small gin and tonic where the same thing is sold in other restaurants for no more than £6-8. Quite old environment as well. Reception staff fairly rude and very unaccommodating when we asked for a small birthday candle to be put on one of their desserts. The kulfi is the standard pot kulfis that you can get from any shop. Definitely would not be going again and avoid if you can!"}
{"review_id": 40, "restaurant_id": 4, "username": "Dipendra D", "date_of_visit": " August 2020", "rating": "1", "title": "Reservation made online not available after phoning Madhu's", "comment": "I made a reservation at Madhu's in Heathrow for 9 people for 24th August. The reservation was made on 20th August using Madhu's website which goes through Quandoo. I had not received an email to confirm the reservation. After phoning them today, they said that their restaurant was fully booked for that day and all other days. They said that I should phone them to make the reservation but this was not stated on their website. I just used the Reserve Now link to make the booking. Do not even bother going to this restaurant as the service is absolutely appalling. Their reservation system is crap."}
{"review_id": 41, "restaurant_id": 4, "username": "RugbyMarkOC", "date_of_visit": " August 2020", "rating": "5", "title": "Really excellent food!\n", "comment": "Really excellent food!  On an overnight stay at a nearby hotel we gave this a try. The food was excellent. The portions look small but were actually a really good size. Not the cheapest but much better than some options near the airport. Our 7 year old usually picks at a bit of chicken but ate over half an adult portion of fairly mild chicken curry!  The service was good too and they had all the necessary precautions right now. "}
{"review_id": 42, "restaurant_id": 4, "username": "Zacksbulgingpassport", "date_of_visit": " July 2020", "rating": "5", "title": "Thank you!", "comment": "I have been coming to Madhu's Heathrow from Ireland every July for 5 years now to celebrate a loved one's birthday. They have never failed to impress and this year - 2020 - was no different. Amazing, tasty food. Wonderful ambience. Efficient, warm, courteous service. A MASSIVE thank you to Vinod, Claudio and all of the team for delivering a consistently super service over the years. I cannot recommend this restaurant highly enough."}
{"review_id": 43, "restaurant_id": 4, "username": "ChrisGower1975", "date_of_visit": " August 2020", "rating": "5", "title": "Really good Indian!!!", "comment": "Came here with the family a couple of weeks ago and had a really good time. The dishes are a little different from your average Indian and my wife and kids were craving Chicken Tikka Masala. It is not on the menu but they did it...and with breast meat for them! My daughter said it is possibly the best Chicken Tikka Masala she's ever had!!!  Would definitely go back."}
{"review_id": 44, "restaurant_id": 9, "username": "Lindaaada_12", "date_of_visit": " October 2020", "rating": "5", "title": "Love it!", "comment": "Incredible customer service especially from ash! Lovely drinks and shots!!! Recommend for sure on any day!"}
{"review_id": 45, "restaurant_id": 9, "username": "Reena T", "date_of_visit": " October 2020", "rating": "1", "title": "Spent 40 mins of a 60 min slot waiting for drinks ", "comment": "Booked an hour slot to have some drinks before our dinner reservation. Ordered drinks on the app and they took 15 minutes to come, the second time they took 25 minutes. We ordered 2 drinks and because it was 241 had 4 and about 6 minutes left to drink them.  We did ask the host and the drinks still took 10 minutes to come from them  I think now you’re on timed visits every minutes counts "}
{"review_id": 46, "restaurant_id": 9, "username": "Pjhello13345", "date_of_visit": " October 2020", "rating": "4", "title": "Great service", "comment": "Bianca what a ledge thanks for being super accommodating!! Will definitely come back soon, thanks so much"}
{"review_id": 47, "restaurant_id": 9, "username": "HayleySurrey24", "date_of_visit": " October 2020", "rating": "5", "title": "Great for a social distanced", "comment": "Great for a social distanced drink! Bianca was the nicest server! ❤️ we enjoyed the cocktails and the extra measures were fine "}
{"review_id": 48, "restaurant_id": 9, "username": "Londoner_1990_x", "date_of_visit": " October 2020", "rating": "5", "title": "10/10 visit during Covid-19", "comment": "We were made to feel super comfortable by our server Ash alongside all of the covid-19 safety measures in place. Great athmosophere and can't wait to visit again soon!"}
{"review_id": 49, "restaurant_id": 9, "username": "721chlo_s", "date_of_visit": " October 2020", "rating": "5", "title": "Fab night", "comment": "Even with the COVID restrictions we had a fab night. Special mention to Bianca who was great. Thank you! X"}
{"review_id": 50, "restaurant_id": 9, "username": "278kittimas", "date_of_visit": " October 2020", "rating": "4", "title": "Lunch", "comment": "Good friendly service and helpful when explaining the offers available. Enjoy the food and good choices menu"}
{"review_id": 51, "restaurant_id": 6, "username": "peimanc2020", "date_of_visit": " October 2020", "rating": "5", "title": "Fantastic place", "comment": "We came here for lunch with friends our children and the food was delicious and absolutely perfect. The portions for the children was very generous and filling. The service was excellent.  Thank you."}
{"review_id": 52, "restaurant_id": 6, "username": "emH7417WV", "date_of_visit": " October 2020", "rating": "5", "title": "Lovely hidden restaurant!", "comment": "Maurizio welcomed us and was kind, friendly and patient especially as we had noisy children, sorry! He was good to them, and always attentive. The food was amazing, the seafood starter was very tasty and fresh. The pizza was great and I had the best lasagne I've ever eaten, much tastier than the pizza express ones!!! This will be my new regular if and when I am able to eat out again. Will definitely return. The atmosphere was warm and friendly, a real hidden gem!"}
{"review_id": 53, "restaurant_id": 6, "username": "jamieeatswell", "date_of_visit": " October 2020", "rating": "5", "title": "Wonderful Food and Service", "comment": "I went for an outside Covid friendly lunch meal with 5 of my friends to celebrate my birthday. Not only was the outside area well protected from the elements and well heated but the tables were spaced out and all the waiters wore masks appropriately. The food was delicious and the pudding was fab, especially when they brought mine out with a candle in and sang a personal happy birthday. Would definitely recommend."}
{"review_id": 54, "restaurant_id": 6, "username": "lynda f", "date_of_visit": " October 2020", "rating": "5", "title": "amazing food and service", "comment": "We dined here last weekend in the covered area outside as we were looking for a COVID compliant place to eat with friends. It did not disappoint, had great food and would highly recommend the Fettuccine Funghi Selvatici e Speck. The service was attentive, friendly and added to a great dining experience. Would recommend and will be returning"}
{"review_id": 55, "restaurant_id": 6, "username": "Peter10662014", "date_of_visit": " October 2020", "rating": "5", "title": "Great arancini; great service", "comment": "We were visitors to Teddington and chose the Dolce Vita because Tripadvisor said it was #1 of 52 restaurants thereabouts. We were not disappointed. I am a great fan of arancini and La Dolce Vita’s were superb. I followed this up with a wonderful mixed seafood spaghetti. Also impressive was the performance of Luca, who, single-handedly maintained an efficient service in a room where all the tables were taken, all the while dealing with the constant demand for takeaway meals. He allowed me to try out my Italian on him and made the occupants of each table feel that they were the most interesting and amusing people in the room."}
{"review_id": 56, "restaurant_id": 6, "username": "424jeanineb", "date_of_visit": " November 2020", "rating": "5", "title": "Best Pizza in Teddington!", "comment": "Not only are you welcomed by a friendly and warm team, the food is delicious! A firm local favourite with some delicious hand made pizza!"}
{"review_id": 57, "restaurant_id": 6, "username": "CAB1270", "date_of_visit": " October 2020", "rating": "5", "title": "excellent - birthday party", "comment": "this weekend we celebrated a friend's 60th at this restaurant. we had not been before and make a booking because it was one of the few places where, as a group of five, we could celebrate outdoors, under cover. The food was excellent - good selection of ingredients and dishes and good prices too. Friendly and welcoming staff, we did not feel rushed and could linger after lunch. It was a really gloomy day but the patio area is really great - comfortable and well set up. We look forward to returning after confinement."}
{"review_id": 58, "restaurant_id": 6, "username": "abigaild475", "date_of_visit": " November 2020", "rating": "5", "title": "good", "comment": "Never been there but because of them i passed my history class by including them in a travel brocure so 10/10 for me"}
{"review_id": 59, "restaurant_id": 2, "username": "sonias_11", "date_of_visit": " September 2020", "rating": "5", "title": "Afternoon lunch ", "comment": "I visited Tamara Lounge having craving Indian food and being in the area when my parents recommended Tamara Lounge. Having not been here we visited last Thursday and I have to say was very surprised! The restaurant was spacious and we were greeted by front of house management Eric Cardozo very warmly and served to a very high standard by Malcolm Martins. Food of high quality and good standard - nice presentation and most importantly lovely tasting! Whilst dining there was also a promotional photo sheet in the corner taking place and we whilst talking to the owner were also invited to taste which was an especially nice thing of management! Unfortunately having already eaten lunch I had to refrain from being over gluttonous and had to decline although my parents had a taste of some of the delightful dishes on offer! Special mention again to Malcolm who served to the highest standards and Eric who checked in a few time during the meal and ensured we were happy and everything was satisfactory. Looking forward to visiting soon and thank you for a wonderful afternoon lunch with delicious food! Ps had to post a pic of the lovely food which was layed out for their promo shoot!"}
{"review_id": 60, "restaurant_id": 2, "username": "ozwin23", "date_of_visit": " September 2020", "rating": "1", "title": "Birthday Party was ruined", "comment": "My birthday party was ruined with slow service and the manager didnt even bother when we complained it took them hours to serve us food the drinks were taking 30 mins to be served and i am talking about a beer which doesnt take time .they missed our starters but they did not forget to put on our bill.we were served our main course but put starter plates secondly no spoons were given it took them 10 to 15 minutes to get the spoon . Terrible service but tasty food. Not anymore "}
{"review_id": 61, "restaurant_id": 2, "username": "Kemik36", "date_of_visit": " September 2020", "rating": "1", "title": "UberEats Delivery", "comment": "I ordered from Ubereats and was extremely disappointed. First of, the food was not warm when it arrived. Secondly, the portion size is unbelievably small with bad packaging and finally the food itself was nothing special. The reason why I’m disappointed is because when you actually eat here they are considerate with the food but takeaway is appalling."}
{"review_id": 62, "restaurant_id": 2, "username": "lovinolincolnb", "date_of_visit": " October 2020", "rating": "5", "title": "Good service", "comment": "I came to Tamara for a dinner with my friends and we had a very good dinner! Good service and amazing food! Thanks to Matteo for your service we really appreciate!! We will come back!!"}
{"review_id": 63, "restaurant_id": 2, "username": "BOSSELPAPI", "date_of_visit": " October 2020", "rating": "5", "title": "Great staff amazing food", "comment": "I came for the first time in this restaurant with my family and we had an amazing dinner!! Staff it’s really friendly. Really thank you Tamara staff special thanks to Matteo,Nigel and Malcolm"}
{"review_id": 64, "restaurant_id": 2, "username": "gurkirank2016", "date_of_visit": " October 2020", "rating": "5", "title": "Amazing service with great food", "comment": "The food was delicious and the ambience was great but what topped it off was the great customer service we received from Matteo Cresa, he was always there to help us and was well mannered. He was also quite attentive to see if we needed anything which made our visit pleasant, we will definitely be coming back because of the great customer service we received in this instance."}
{"review_id": 65, "restaurant_id": 4, "username": "markhQ1669GP", "date_of_visit": " October 2020", "rating": "5", "title": "Another superb visit", "comment": "Another excellent visit while down in London on a business trip all staff are so friendly and attentive and food is delightful. Also very Covid secure throughout the whole dining experience."}
{"review_id": 66, "restaurant_id": 2, "username": "Mr-Wanderful", "date_of_visit": " September 2020", "rating": "2", "title": "Overrated. ", "comment": "What can I say. The food is okay. The service is t great. The prices are over inflated and the staff have a really bad attitude. "}
{"review_id": 67, "restaurant_id": 4, "username": "kulzT", "date_of_visit": " October 2020", "rating": "1", "title": "A little Disappointed!!", "comment": "Really disappointed with Madhus. This is not the best place if you have a shellfish or nut allergy and also not very accommodating when you ask of they can change dishes for people who have the allergies. So most of the meats and shellfish are cooked on the same grill. Which means anyone with a shellfish allergy cant have meat. Wonder if they tell the pescatarians that there fish dishes are cooked on the same grill as the chicken?? Hmmmm The mains are hit and miss some with nuts and some not. Personally not the most accommodating and don't think I would go back."}
{"review_id": 68, "restaurant_id": 4, "username": "WSidhu", "date_of_visit": " August 2020", "rating": "5", "title": "An Amazing Restaurant! Great Food! Great Service!", "comment": "This restaurant is absolutely amazing! It ticks all the boxes. Professional Well Presented Staff, Covid safe, Food quality is 5* Plus & décor is amazing! Highly Recommended."}
{"review_id": 69, "restaurant_id": 4, "username": "shradha j", "date_of_visit": " December 2020", "rating": "5", "title": "Birthday dinner", "comment": "Lovely ambience...welcoming staff all the covid procedures followed...amazing food.my 6yr old was on cloud 9 looking at him eat so well I was happy too..would surely visit again.Sepcial thanks to varun and vinod who looked after us."}
{"review_id": 70, "restaurant_id": 3, "username": "Laura9fc", "date_of_visit": " August 2020", "rating": "3", "title": "Nice food and staff ", "comment": "I went there for lunch and had chicken burger. Affordable prices and lovely staff, although the hygiene wasn't good enough as is easy to see through the kitchen curtain."}
{"review_id": 71, "restaurant_id": 3, "username": "764katiel", "date_of_visit": " August 2020", "rating": "5", "title": "Best restaurant in colindale", "comment": "Excellent food that’s reasonably priced and they’re got lots of choice on the menu - have been here for breakfast and lunch, both of which were excellent and I will definitely be returning regularly."}
{"review_id": 72, "restaurant_id": 3, "username": "949shaimad", "date_of_visit": " December 2019", "rating": "3", "title": "Nice Spot in Colindale 🍳🥓", "comment": "Nice atmosphere delicious n this Café, many options to try and the staff are friendly and attentive.  The waffles weren’t freshly prepared and the dish was overly sweet. The English breakfast was okay, egg was cooked well but overall pretty average."}
{"review_id": 73, "restaurant_id": 3, "username": "Q6079XGsilviad", "date_of_visit": " October 2020", "rating": "5", "title": "Amazing place!!", "comment": "I have ordered from that place few times now and I can’t recommend them enough! Lovely staff- they always write a sweet note on my takeaway box wishing me a nice day or something similar. The food is just soooo good. One of the best places I have ordered from."}
{"review_id": 74, "restaurant_id": 3, "username": "k00ml", "date_of_visit": " October 2020", "rating": "5", "title": "Amazing food and service", "comment": "Pancakes are the best ever, Irina was really good, got our order perfect.  I might even come later for more!"}
{"review_id": 75, "restaurant_id": 3, "username": "K3569GQalim", "date_of_visit": " October 2020", "rating": "5", "title": "Great food and service", "comment": "The food was incredible and the service was top notch. Irina and the team were friendly, welcoming and great. This is my go to brunch spot now"}
{"review_id": 76, "restaurant_id": 3, "username": "Kazam91", "date_of_visit": " October 2020", "rating": "5", "title": "Amazing breakfast/customer service", "comment": "The breakfast was lovely and loved the service provided by Irina, very polite and quick service with a big smile and lots of laughs. Definitely will come back."}
{"review_id": 77, "restaurant_id": 3, "username": "tamirism2014", "date_of_visit": " November 2020", "rating": "5", "title": "Breakfast delight", "comment": "We spent the morning at the ITJL with our kids and we were served by Kiki who was lovely. Our breakfast eggs, pancakes and coffee was so tasty. We loved it and would definitely come back!!!"}
{"review_id": 78, "restaurant_id": 3, "username": "PaulF1989", "date_of_visit": " December 2020", "rating": "5", "title": "Amazing service", "comment": "This restaurant is amazing - great food, amazing service, staff are lovely. Would 100% recommend!!!!"}
{"review_id": 79, "restaurant_id": 3, "username": "irfaanjaffer", "date_of_visit": " December 2020", "rating": "5", "title": "Great little spot", "comment": "Such a great spot, food is always wonderful and staff are all very kind, professional and helpful, especially Courtney, no complaints from us."}
{"review_id": 80, "restaurant_id": 3, "username": "Bijal S", "date_of_visit": " February 2020", "rating": "5", "title": "Great cafe!", "comment": "Staff were very friendly and food was so tasty, definitely recommend this place. Kiki was also a great server!"}
{"review_id": 81, "restaurant_id": 3, "username": "margaritamurad", "date_of_visit": " March 2020", "rating": "5", "title": "Friendliest staff ever!", "comment": "Very welcoming atmosphere, they automatically give you the discounts they have and know would apply to you. They also have vegetarian, vegan and halal options! Their smoothies are delicious!"}
{"review_id": 82, "restaurant_id": 3, "username": "BBsmoove", "date_of_visit": " March 2020", "rating": "5", "title": "Good tasty food ", "comment": "This is the 3rd time I've been to ITJL and I must say that the food and service is always on point and finger licking good and thanks to Courtney for serving us today. "}
{"review_id": 83, "restaurant_id": 3, "username": "MrStevenByrne", "date_of_visit": " March 2020", "rating": "5", "title": "A Great Breakfast", "comment": "My favourite place for breakfast in London. Excellent food (Twisted Eggs Benedict are a must) and great service. The staff are always so helpful and pleasant, especially Irina."}
{"review_id": 84, "restaurant_id": 3, "username": "aibss", "date_of_visit": " March 2020", "rating": "5", "title": "AMAZINGGGG!!!", "comment": "ABSOLUTELY THE BEST PLACE FOR BRUNCH IN COLINDALE/EDGWARE!!! THE BEST CUSTOMER SERVICE AS WELL :))) kiki and the other waiters/waitresses are sooooo lovely as well and made the experience very great!"}
{"review_id": 85, "restaurant_id": 3, "username": "M4373HSamandam", "date_of_visit": " March 2020", "rating": "5", "title": "Review", "comment": "I visited this cafe by my self and I was treated very nicely by my server named Kiki :) good customer service. What was extremely friendly was that Kiki gave me a free green smoothie for me to try which was very unexpected whilst I was waiting for my food to arrive.  Thank you"}
{"review_id": 86, "restaurant_id": 3, "username": "TimReview", "date_of_visit": " March 2020", "rating": "5", "title": "Always make me welcome", "comment": "Just a humble opinion — lovely place something very inexpensive for a great quality meal. It’s my go to for a brunch. Business or family it suits me!"}
{"review_id": 87, "restaurant_id": 3, "username": "Lrexhal", "date_of_visit": " March 2020", "rating": "5", "title": "Amazing", "comment": "Kiki was the waitress that serviced us, she was lovely and attentive! Food and service was amazing, will defo come back. Defo recommend their smoothies"}
{"review_id": 88, "restaurant_id": 3, "username": "SandyRoRu", "date_of_visit": " June 2020", "rating": "5", "title": "Excellent burgers and pancakes!", "comment": "Really good menu with a big variety of choices.  Wonderful quality and cheap prices, highly recommended."}
{"review_id": 89, "restaurant_id": 3, "username": "bethanyjay2018", "date_of_visit": " August 2020", "rating": "3", "title": "Nice food, bad hygiene", "comment": "We found this place after looking for somewhere local with good reviews. Unfortunately we did not have the same experiences as its reviews. The food was okay - their fry up was quite average but okay if a traditional fry up is what you want. The problem was the complete lack of hygiene especially post-pandemic.  The inside of the cafe was packed, with about half a metre of space between each table. Between diners, tables were wiped (with the most simplistic definition of the term) - no anti-bac spray, chairs weren't cleaned, salt and pepper not wiped down etc. None of the staff were wearing masks but they had no hesitation to get within one metre of you to take your order. I can't know for sure and it was busy so perhaps there wasn't always time, but I didn't see any staff stop to wash their hands or apply anti-bac gel. Then they'd hand you your knife and fork. It wasn't a bad spot for a quick or cheap meal but I wouldn't recommend due to their lack of hygiene and lack of consideration towards the current climate."}
{"review_id": 90, "restaurant_id": 5, "username": "Absstari", "date_of_visit": " December 2020", "rating": "5", "title": "Great food!", "comment": "Best place in Chingford for a curry, very tasty! - Lovely & friendly service every time we come in - highly recommend"}
{"review_id": 91, "restaurant_id": 5, "username": "Abrahambubbles", "date_of_visit": " December 2020", "rating": "5", "title": "Best Indian restaurant", "comment": "So glad the wait was over and we could come and sit at last in this lovely restaurant and enjoy a very tasty meal. Khan and his fellow staff made us so welcome and as usual gave us their best service. Restaurant was full, a great meal, atmosphere, looking forward to coming again soon. Highly recommend!"}
{"review_id": 92, "restaurant_id": 5, "username": "550stuarth", "date_of_visit": " December 2020", "rating": "5", "title": "Best Sag Aloo Ever!", "comment": "Quality local Indian restaurant in North Chingford. Always consistently great food. The Sag Aloo is well worth ordering! Friendly efficient service as a bonus to boot!"}
{"review_id": 93, "restaurant_id": 5, "username": "Nichola1988888888", "date_of_visit": " December 2020", "rating": "5", "title": "Fantastic Food- Best Indian", "comment": "I would recommend Spice Station, the food is amazing, especially the Sag aloo! The staff are really friendly and the food has been exceptional every time we have eaten here. You won’t be disappointed."}
{"review_id": 94, "restaurant_id": 5, "username": "Kathyblue200", "date_of_visit": " December 2020", "rating": "5", "title": "Fantastic food", "comment": "We had a delicious take away from here this evening. A real depth of flavour to the food, best Indian I’ve had in ages. Thank you!"}
{"review_id": 95, "restaurant_id": 5, "username": "Lisajh99", "date_of_visit": " December 2020", "rating": "5", "title": "Amazing food and superstar waiters!", "comment": "The food and atmosphere is lovely, ideal for friends or family, the staff are so friendly and create a lovely place to be!! Special mention Mr Khan who made our visit extra special making sure we always had a drink, and that everything was ok! Definitely recommend visiting ✨"}
{"review_id": 96, "restaurant_id": 5, "username": "emilysJ9256DI", "date_of_visit": " December 2020", "rating": "5", "title": "Superb staff and food!!", "comment": "The food was delicious and the staff were all so friendly and were very welcoming. Amazing for friends and family. Big shout out to Mr Khan for being so kind and keeping our drinks topped up!"}
{"review_id": 97, "restaurant_id": 5, "username": "Cosmopolitan792107", "date_of_visit": " December 2020", "rating": "5", "title": "Great night", "comment": "Great food and great service, had a wonderful lamb bhuna, mushroom rice, chicken madras, and a lovely sagaloo"}
{"review_id": 98, "restaurant_id": 5, "username": "beckaoconnor", "date_of_visit": " October 2020", "rating": "5", "title": "5 star", "comment": "Really enjoyed food and service. Staff are very friendly especially Khan ! Would definitely come again!  Best Indian locally."}
{"review_id": 99, "restaurant_id": 5, "username": "655varshaj", "date_of_visit": " October 2020", "rating": "5", "title": "Varsha J", "comment": "It was my 3rd visit to the restaurant with my friend who was already a VIP customer to this restaurant for years. Food on the whole was amazing and did not let me down once again. Atmosphere has a cosy Feeling and staffs were very attentive. Best Indian in Chingford for sure and rare to eat amazing Indian food with lots of flavour. The tandooris are highly recommended as well as the curries. I wish they could fo home delivery to Redbridge and I also suggested. Hope the owner/management will consider in future. Thanks for the great service and it’s 5 star for me."}
{"review_id": 100, "restaurant_id": 5, "username": "sofiasK257UY", "date_of_visit": " November 2020", "rating": "5", "title": "Fantastic Service .... Amazing Food", "comment": "Coming here is always a pleasure. Very friendly staff, always care for every need. The food matches very high standards. Highly recommend!"}
{"review_id": 101, "restaurant_id": 5, "username": "Ben W", "date_of_visit": " November 2020", "rating": "5", "title": "Unbelievable", "comment": "Great price, location and people!! Wide varied menu with all great tasting foods. I was taken back but the friendly environment with all staff members.. Service was simply second to none"}
{"review_id": 102, "restaurant_id": 5, "username": "Casey A", "date_of_visit": " November 2020", "rating": "5", "title": "Great food, friendly service 10/10", "comment": "The staff at the spice station were attentive, friendly and complimenting.  The food was of high quality, prompt and tasty.  Will definitely be coming back. Highly recommend!"}
{"review_id": 103, "restaurant_id": 5, "username": "33chrisj", "date_of_visit": " November 2020", "rating": "5", "title": "Wow! Why Im a Spice station regular", "comment": "Wow! Im a Spice station regular - but what with lockdown its been a while. Tonight reminded me why they are simply the best- juicy, tasty quality chicken and properly prepared sauces with fresh herbs, spices and peppers - each sauce for our jalfrezi and Korai was delicious and delicately spiced. Thank you Shah and to your top team of chefs "}
{"review_id": 104, "restaurant_id": 5, "username": "LukeMoore08", "date_of_visit": " November 2020", "rating": "5", "title": "Lovely place!", "comment": "Lovely service staff are friendly and make you feel comfortable and make sure your satisfied! Would highly recommend"}
{"review_id": 105, "restaurant_id": 5, "username": "wildrover1953", "date_of_visit": " October 2020", "rating": "2", "title": "Probably the worst coffee in Chingford", "comment": "stopped for a \"flat white\" on the way back from a walk - wish I hadnt have bothered - I think they forgot to put the coffee in!!"}
{"review_id": 106, "restaurant_id": 5, "username": "X1337XBbens", "date_of_visit": " December 2020", "rating": "5", "title": "Fantastic food and great atmosphere", "comment": "Fantastic food and great atmosphere would definitely come back again. All the staff were helpful and follows all COVID hygiene rules "}
{"review_id": 107, "restaurant_id": 5, "username": "foodieGii", "date_of_visit": " December 2020", "rating": "5", "title": "Food and service was excellent,", "comment": "Food and service was excellent, recommend to anyone who fancy a good bit of grub and a couple of nice tasty cobras.  only down side is their music selection.... "}
{"review_id": 108, "restaurant_id": 5, "username": "LAM222222", "date_of_visit": " December 2020", "rating": "5", "title": "Spice Station", "comment": "Great and friendly service, even better food, chicken pasanda was great. Couldnt recommend more. 10/10"}
{"review_id": 109, "restaurant_id": 5, "username": "billycV3969MZ", "date_of_visit": " December 2020", "rating": "5", "title": "Lovely food and staff!", "comment": "Went here for our last meal before going into tier 3 lockdown! The food was lovely, staff were lovely and the service was very quick although not rushed! Highly recommend!"}
{"review_id": 110, "restaurant_id": 8, "username": "irenegN5702RK", "date_of_visit": " December 2019", "rating": "4", "title": "Superb plant based reastaurant", "comment": "I brought my entire family for dinner to Oliveira last night. It was a long journey form London centre but totally worth it. The menu is fantastic, such a variety of original dishes, I was really impressed and  Each one of them was delicious. Even my non-plant based family loved it! The atmosphere is also nice, very rustic and cozy. Service was outstanding! Very professional and friendly at the same time. Looking forward to go back for another tasty dinner"}
{"review_id": 111, "restaurant_id": 8, "username": "cabe75uk", "date_of_visit": " October 2019", "rating": "5", "title": "really taste", "comment": "I went for dinner all my plates was wonderfoul, the wine aswell. The best service in town. For sure i will back again."}
{"review_id": 112, "restaurant_id": 8, "username": "41simonr", "date_of_visit": " December 2019", "rating": "5", "title": "Healthy quality", "comment": "Great spot for Sunday breakfast. Very healthy recovery from night before! Quality ingredients, well cooked and presented. Decent value"}
{"review_id": 113, "restaurant_id": 8, "username": "nhmo", "date_of_visit": " October 2019", "rating": "3", "title": "Long Trek for OK food", "comment": "Read great reviews so headed out on a rainy night and walked from Kew Gardens (a minor trek). The food was not great - never had eggplant so slimy ( maybe just me). Brought a friend who is not exactly vegetarian friendly and definitely did not sway her. The staff was wonderful, fully attentive and pleasant. The food was eh. It was a tad expensive and a bit out of the way so probably won't be heading back."}
{"review_id": 114, "restaurant_id": 8, "username": "bry1545", "date_of_visit": " January 2020", "rating": "5", "title": "Blown away!", "comment": "Wow- what an amazing find. The meal we had was sensational. We shall be back for certain. We are vegetarian but, for all those meat eaters out there, you won’t miss it one bit- give it a go and you won’t regret it."}
{"review_id": 115, "restaurant_id": 8, "username": "Cslade86", "date_of_visit": " January 2020", "rating": "5", "title": "Lovely Sunday Lunch", "comment": "Popped in for lunch after a walk through Richmond Park. Very busy, so getting a table needs to be timed well (a testament to the food). Food was very good and extremely tasty. Delicious smoothies and very friendly staff. We will definitely be back."}
{"review_id": 116, "restaurant_id": 8, "username": "Daydream739029", "date_of_visit": " January 2020", "rating": "5", "title": "Cosy Quiet Vegetarian Eco-Friendly Eatery with Vegan Options", "comment": "Delicious selection of vegan options. Lovely smoothies, quite filling, so get one and ask for two straws. Small and large plates, all made on site and from first principles. Welcoming and friendly service, knowledgable staff. Ideal for a spot of lunch after a walk or cycle in Richmond park."}
{"review_id": 117, "restaurant_id": 8, "username": "HappyToDiscover", "date_of_visit": " January 2020", "rating": "5", "title": "Amazing restaurant, highly recommended.", "comment": "I came to this restaurant with my family who normally dislike any non South Asian food. They loved it. We had a mix of breakfast and lunch, everything was amazing. All the flavours worked really well together. Tried unusual fruit and vegetables we have never had before. Loved the cassava and acai bowl. The chef, Caliel, was amazing. He went above and beyond, coming over to explain all the ingredients in the dishes that my father could not eat due to his illness. He then went on to explain any alterations he could make to the dishes to help him, e.g. Gluten free bread. The staff were lovely, Nora and Julia,very attentive and knowledgable about the menu. Never had to wait for any service, and it always came with a smile. Even when the restaurant got busy, the girls made sure everyone had their food on time and the water bottles were always full. Tables were cleaned as soon as the last person finished eating. Amazing hospitality. Overall I would highly recommended this restaurant, very welcoming. Come here even if you are not vegetarian, its a surprising change from the ordinary."}
{"review_id": 118, "restaurant_id": 8, "username": "Nero T", "date_of_visit": " January 2020", "rating": "5", "title": "Oliveira - Amazonian veggie treasure in deepest North Sheen", "comment": "This is a friendly and relaxed local restaurant offering a vegetarian and vegan menu using seasonal and organic produce. It ticked all the boxes for us as one of our party was vegan and one vegetarian. Service was excellent and we appreciated the warm greeting and goodbye from the manageress. The vibe is cosy and chic, with lots of hanging plants from repurposed pallets and a funky open kitchen flanked by clusters of exotic fruits and vegetables from where you can watch proprietor / head chef Emerson Amélio de Oliveira work his magic. We had: Starters: Faux Gras. Mandoo. Pumpkin salad.  Mains : Truffled Striata. White Spice. Strozzapreti. Zucchini Fritters side. Deserts: Fudge. Trio of sorbets (kindly on the house as we had a birthday) Drinks: Adobe organic Chardonnay. 1 Sacred vodka, and a glass of Fior de Cassia Prosecco for the birthday girl. Everything on the menu looked great and worth revisiting for, but we were more than happy with our various choices. Standouts were the starters - Faux Gras, a vegan riff on the, let’s face it, guilt-inducing but delicious carnivorous original, was silky in texture with an earthy density from the mushroom base, topped with a cool slab of rich vegan butter nicely challenged by the sharp notes of a home-made piccalilli - and Mandoo - Korean dim sum stuffed with Kimchi which our vegan daughter devoured in seconds with a big smile.  The Zucchini fritters with pumpkin chilli sauce were also fantastic and glad we ordered them as the ‘White spice’ main although being smothered in a lively aged parmesan, risked becoming a touch samey after a while. Chocolate was mentioned in the ingredients but the sweetness it afforded the diced root vegetables was perhaps a little lost under the cheese - nonetheless it was a very welcome comfort dish to thaw us out on a freezing wintry night (we had recklessly walked from home in Kew) and with the extra crunch of the zucchini and chilli spice side, it rocked.  Desserts were awesome - dark Amazonian chocolate Fudge with Bourbon vanilla ice cream, both light and intense - and a trio of Amazonian rare super fruit sorbets (Açaí – Cupuaçu – Pitaya) which we customised with a dash of 'sacred' vodka to supercharge the exotic flavours, really hit the spot.  For us, the test of a new restaurant is that you're talking about the food the next day, and the next. In a good way, of course. This was definitely the case here and we look forward to returning for brunch, dinner or both, soon.\u2028"}
{"review_id": 119, "restaurant_id": 8, "username": "DavidMelunsky", "date_of_visit": " April 2020", "rating": "5", "title": "Just great", "comment": "Had a Saturday night takeaway. Never misses, always great. It’s really wonderful to have this as a local restaurant."}
{"review_id": 120, "restaurant_id": 8, "username": "Harriet J", "date_of_visit": " October 2019", "rating": "5", "title": "The most innovative vegetarian restaurant for miles!", "comment": "Just eaten at the wonderful Oliveira restaurant in Sheen. You are greeted with a warm welcome- whether they know you or not. The menu is really interesting, innovative and varied, with lots of gluten free and vegan choices. The owner/head chef, Emerson’s passion for and knowledge of foods from around the world and culinary expertise is awesome. His business partner/wife/ maitre d’ Magda also creates their amazing desserts. They and their lovely waiting/ cooking staff patiently and smilingly answer all manner of questions from our and other tables. What more could a diner want- just brilliant. Thank you for a wonderful experience. H+P+C"}
{"review_id": 121, "restaurant_id": 8, "username": "CherubSurrey", "date_of_visit": " October 2019", "rating": "5", "title": "Wonderful", "comment": "Visited twice and loved the food and the staff. As a non vegetarian I was surprised to really enjoy everything I have eaten here."}
{"review_id": 122, "restaurant_id": 8, "username": "KB5905", "date_of_visit": " October 2019", "rating": "5", "title": "Working lunch", "comment": "Popped in on Friday lunch looking for some comfort food while I worked. Had the most delicious Summer risotto with a green salad. The risotto was incredible. Will be back again very soon."}
{"review_id": 123, "restaurant_id": 8, "username": "Tom_sains", "date_of_visit": " October 2019", "rating": "5", "title": "Superb vegetarian restaurant!", "comment": "Really fantastic meal here. Inventive and tasty food, lovely atmosphere and overall a great experience. Very good value as well."}
{"review_id": 124, "restaurant_id": 8, "username": "JackSarah28", "date_of_visit": " October 2019", "rating": "5", "title": "Beautiful place", "comment": "A beautiful place with nice ambiance and great food!  One of the best lunch ever in London!  Highly recommended!"}
{"review_id": 125, "restaurant_id": 8, "username": "srk610", "date_of_visit": " October 2019", "rating": "5", "title": "Delicious food!", "comment": "We had fabulous time. Great food and service. Tried things I haven’t tasted before. Highly recommended."}
{"review_id": 126, "restaurant_id": 8, "username": "fedzanni", "date_of_visit": " October 2019", "rating": "5", "title": "Wonderful", "comment": "It's not just about the cosy and friendly atmosphere. It's not just about the brilliant and ever attentive staff. It's not even just about the delicious food. It's the fact that every time my wife and I eat at Oliveira, we leave feeling like we've just experienced Art. Like watching a great piece of theatre, or a beautiful concert. What the Chef creates with flavours, is nothing short of inspired."}
{"review_id": 127, "restaurant_id": 8, "username": "Deirdre Carolin... G", "date_of_visit": " October 2019", "rating": "1", "title": "Unpleasant and unwelcoming", "comment": "I have visited Oliveira on numerous occasions and found the food to be good but not inexpensive. HOWEVER I will not be going back after my last encounter with them. This particular day I called to make a reservation as it was a Friday night - I was told in no uncertain terms that I could not book just to just show up and 'walk in'. I was concerned saying I didn't want to drive all that way on a Friday evening to find no table available. \"NO\" not an option the voice on the other end of the phone was emphatic. OK so I thought we would go early and hope for the best. My daughter and I arrived about 6.45pm and were met with that same attitude (I think the same person) as the person I spoke to on the phone. We were greeted us with \"Have you booked?\" in a very aggressive and unwelcoming tone. I reminded her we had spoken on the phone earlier and had been told just to show up. She told me I should have booked online and that I would have had to pay a deposit to do this (I was not told this on the phone, so news to me) She offered us a small table in the entrance-way by the front door, not in the main restaurant room. We declined as the atmosphere we were met with was icy and unpleasant and we didn't want to eat with that hanging around. It is not only the food I go out for but the welcome, warm atmosphere and a sense that my host actually wants me there. Needless to say we will never return.  I am in the service industry and it is very shortsighted to treat your customers this way - however your day has been or whatever is going on."}
{"review_id": 128, "restaurant_id": 8, "username": "achyutan", "date_of_visit": " November 2019", "rating": "5", "title": "Veggie heaven", "comment": "Delicious vegetarian fare with a range of choices. Beautifully cooked food. No pretend meat. The Nduja sausages (made of avocado & jackfruit) were superb. Deep flavours with a gentle hit of chilli at the end. The tapioca chips hit the spot. The spaghetti in a beautiful butter sauce was sinfully divine. The desserts were to die for!!! And all this with a super friendly bunch running it! A gem!!"}
{"review_id": 129, "restaurant_id": 8, "username": "651mrp", "date_of_visit": " November 2019", "rating": "5", "title": "Good food, good atmosphere", "comment": "Dinner last night was very enjoyable - good buzzy atmosphere, great food and staff friendly and great at explaining some of the more unusual ingredients. Will definitely go back"}
{"review_id": 130, "restaurant_id": 1, "username": "NatashaPaul", "date_of_visit": " November 2020", "rating": "5", "title": "Incredible ", "comment": "We were recommended by a friend and can’t recommend more highly. The best Indian food we have eaten. Great variety of options and delicious. Also really like the community support and sustainable packaging. Well done!"}
{"review_id": 131, "restaurant_id": 1, "username": "Deva_Poonasami", "date_of_visit": " November 2020", "rating": "5", "title": "Amazing Food", "comment": "I enjoyed a most delicious Kerala Chicken Curry in Bombaylicious in Coulsdon. It was authentic and full of flavour."}
{"review_id": 132, "restaurant_id": 1, "username": "SouthLondon2020", "date_of_visit": " November 2020", "rating": "5", "title": "Birthday Feast", "comment": "O.M.G. This food is incredible! I just ordered a whole feast this evening for my birthday. There was 3 bags of food for 3 people!! Well it is lockdown so I thought why not try a bit of everything haha.  When serving up the food at home, all the smells and the tastes, you have never heard so many mmmmm sounds. I loved the mint dips with everything, and the tandoor salmon and paneer dishes especially as I'm pescatarian. The others enjoyed chicken tikka and butter chicken. The onion fritters are a highlight and so tasty.  The staff all seem lovely and I easily ordered my food online which was all ready when I arrived.  I would highly recommend Bombaylicious. Give it a try!"}
{"review_id": 133, "restaurant_id": 1, "username": "w62", "date_of_visit": " November 2020", "rating": "5", "title": "Fantastic home cooked food", "comment": "Fantastic home cooked food .. better than any Indian restaurant or takeaway food I’ve ever had. Absolutely delicious! "}
{"review_id": 134, "restaurant_id": 1, "username": "sharonpB1057JE", "date_of_visit": " January 2021", "rating": "5", "title": "Sharon", "comment": "Very kindly and most enjoyed donation of a lunch time treat delivered for all the hard working staff in the operating theatres at St Helier hospital. Thanks Guy’s"}
{"review_id": 135, "restaurant_id": 1, "username": "GoPlaces39653", "date_of_visit": " January 2021", "rating": "5", "title": "Fabulous Food", "comment": "Fabulous food as always thanks to Bombaylicious! Cooked just how we like it, the food is always tasty, hot and ready for us to pick up on time. Great friendly staff, we would recommend this place to everyone!"}
{"review_id": 136, "restaurant_id": 1, "username": "Neermalahw12", "date_of_visit": " January 2021", "rating": "5", "title": "Generous St Helier Staff Donation", "comment": "My family and I discovered Bombaylicious a few months back and will never go anywhere else. For once, each curry has its own distinctive flavour and blessed with real, fresh ingredients...curry leaves and ginger!! I have worked for the NHS for the last 40+ years and COVID has really taken its toll on us nurses. I enquired with Bombaylicious to see if they were able to donate a few meals for some of our theatre staff for lunch and was delighted when they obliged! Boxes and boxes of hot, fresh, delicious curries!! Our staff were so delighted, everything was snapped up in minutes. An amazing donation to those risking their health on the front line!! Thank you so much!!! From A2 theatre staff at St Helier!!"}
{"review_id": 137, "restaurant_id": 1, "username": "LuluLaw101", "date_of_visit": " January 2021", "rating": "5", "title": "Tasty Meals for the NHS", "comment": "Bombaylicious very kindly donated over 100 meals to our local NHS hospital. I helped to facilitate the donation and the hospital staff have contacted me saying the food was absolutely amazing. Thank you so much for your kind donation."}
{"review_id": 138, "restaurant_id": 7, "username": "remusmihailp", "date_of_visit": " September 2020", "rating": "5", "title": "Amazing", "comment": "Apart of the greate service, after a night out, the food was amazing , just a littel haven . Thanks!!"}
{"review_id": 139, "restaurant_id": 1, "username": "derrickh24", "date_of_visit": " September 2020", "rating": "5", "title": "Absolutely the best Indian around!!!", "comment": "The most delicious food we've ever had from a takeaway. Also, very consistent, we just keep re-ordering!"}
{"review_id": 140, "restaurant_id": 1, "username": "Silverleigh-_117", "date_of_visit": " September 2020", "rating": "5", "title": "Ajay", "comment": "OK. I grew up eating Indian food....easily my favourite cuisine. I also eat out at least twice a week.  Saw this place pop up on my FB. Absolutely STUNNING. WOW.  Give it a go. You will NOT be disappointed! P.S.....lamb chops were top draw!"}
{"review_id": 141, "restaurant_id": 1, "username": "garysY3604HY", "date_of_visit": " September 2020", "rating": "5", "title": "Takeaway", "comment": "Great tasting food, friendly staff and service was fast, would recommend others to try for a pleasant change"}
{"review_id": 142, "restaurant_id": 1, "username": "feegs500", "date_of_visit": " October 2020", "rating": "5", "title": "Beautiful food", "comment": "Second time in a month we've had takeaway from here and the food is absolutely outstanding. Lamb chops are insanely good, butter chicken also and the pacora starter was reminiscent of Kastoori....a vegetarian restaurant we miss still from our days in Tooting!...highly recommended"}
{"review_id": 143, "restaurant_id": 1, "username": "YesiamD82", "date_of_visit": " September 2020", "rating": "5", "title": "Takeaway Delivery", "comment": "Excellent food. Absolutely delicious. Some classics and some new takes on dishes. Definitely going to be ordering from here again. "}
{"review_id": 144, "restaurant_id": 1, "username": "rore2014", "date_of_visit": " October 2020", "rating": "5", "title": "Delicious food!", "comment": "Without doubt, the best Indian food in Coulsdon! It may be slightly more expensive than others, but it is worth every penny. We have tried many of the dishes now, and they are delicious, without exception! Cannot recommend it enough!!"}
{"review_id": 145, "restaurant_id": 1, "username": "Grinchy_79", "date_of_visit": " November 2020", "rating": "5", "title": "Delicious biriyani ", "comment": "Ordered chicken and veg biriyani and samosas.  They were delicious and quite big portions. Though it's a bit expensive worth the money.  Yummy!"}
{"review_id": 146, "restaurant_id": 1, "username": "IamtheDC", "date_of_visit": " November 2020", "rating": "5", "title": "Absolutely stunning food!", "comment": "I'm not one to leave many reviews for a takeaway but the food from Bombaylicious we had last week was fantastic.  The menu has your usual favourites but also some great unusual additions. The Popcorn Paneer and Bombay Fried Chicken Wings were outstanding! Add to the lovely tasting food, the way it is delivered and presented in special containers, each dish looked like it was ready to be served in a restaurant.  Not the cheapest takeaway but well worth it for the quality of the food.  HIGHLY RECOMMENDED!"}
{"review_id": 147, "restaurant_id": 1, "username": "ZurichLondonYank", "date_of_visit": " November 2020", "rating": "5", "title": "Excellent food!", "comment": "We eat Indian often including while traveling all over India. This food is excellent! The price is more than justified for the excellent quality. A wonderful addition to the neighborhood. YUM!"}
{"review_id": 148, "restaurant_id": 7, "username": "ruthslatter", "date_of_visit": " September 2020", "rating": "5", "title": "Beautiful cafe, with amazing brunch ", "comment": "Beautiful cafe, with amazing brunch menu & really lovely outside space. I felt welcomed & safe throughout my visit. The service was fantastic & the food was brilliant. Can’t wait to go back. "}
{"review_id": 149, "restaurant_id": 7, "username": "seanpauldcu", "date_of_visit": " February 2020", "rating": "5", "title": "Five Star. Don’t waste time, just go! Super food, atmosphere and service!!", "comment": "Been to WT multiple times and it never disappoints, great food, fair value for money and simply brilliant staff/service. Fantastic menu and atmosphere any day of the week - the best breakfast/brunch/dinner cafe in west London."}
{"review_id": 150, "restaurant_id": 7, "username": "timedwards459", "date_of_visit": " February 2020", "rating": "5", "title": "Fantastic local spot", "comment": "We’re so lucky to have this place on our doorstep. Great coffee and food, with really friendly staff all the time"}
{"review_id": 151, "restaurant_id": 7, "username": "Meri4ka", "date_of_visit": " February 2020", "rating": "4", "title": "Tiny nice cafe", "comment": "It is a very nice place for a cafe, but for a restaurant it's s bit tiny. Apart from this, the food was excellent and the staff competent and nice."}
{"review_id": 152, "restaurant_id": 7, "username": "philipr596", "date_of_visit": " February 2020", "rating": "5", "title": "Perfect for Brunch", "comment": "We didn’t book, which was a mistake, but in the end only had to wait 10 minutes for a table. Great brunch menu whether you are carnivore, pescatarian, veggie or vegan. Some of the best coffee we have had outside Italy. Helpful friendly multi-cultural staff, well presented and well cooked food. No fuss, no pretention, we were in and out of there in 30 minutes, very happy. But a good place to linger over the papers too."}
{"review_id": 153, "restaurant_id": 7, "username": "Azzurina77", "date_of_visit": " February 2020", "rating": "5", "title": "seriously the best breakfast in London 😍", "comment": "we were staying in a air bnb near the restaurant and went there two times for breakfast! can only recommend it - it was freaking delicious and the staff was so super nice! a must if you are nearby "}
{"review_id": 154, "restaurant_id": 7, "username": "Eatgreatlondon", "date_of_visit": " February 2020", "rating": "5", "title": "Well done", "comment": "Good food and even better people. Must see this place and the options of different dishes with mixture of right ingredients to go with it"}
{"review_id": 155, "restaurant_id": 7, "username": "TimNG", "date_of_visit": " July 2020", "rating": "5", "title": "Back With Excellent New Burgers", "comment": "I went with my daughter to re-visit the cafe after the shut-down. They are super organised with spacing and hygiene, yet the place still has it's relaxed & friendly atmosphere. We sat outside under the climbing plants that have grown well during the lockdown: it's a lovely little place to eat. We tried the new burgers: pulled beef and quinoa. I'd never had a quinoa burger before and this one worked very well. They were both great, served with crunchy sweet potato chips. My daughter and I are super careful about distancing, masks, etc so we haven't been out to eat much since lockdown, but we felt very comfortable and safe here."}
{"review_id": 156, "restaurant_id": 7, "username": "456dawnm", "date_of_visit": " August 2020", "rating": "5", "title": "A real hidden gem! ", "comment": "A real hidden gem! We were very satisfied with our whole experience at Wild Thyme. The service was fantastic, Andrea looked after us well and is that rare server who knows when to come to you and impart her knowledge and also knows when to just let you get on with eating the delicious food. And about the food, fantastic! Really fresh and well executed dishes. We had a new dish, duck with duck fat cooked potato and a sweet and nicely sour cherry and cranberry sauce. Which was just divine and we highly recommend. The cafe evidently takes social distancing very seriously and we felt very safe there. Overall I can’t recommend this place enough, you really should check it out!! "}
{"review_id": 157, "restaurant_id": 7, "username": "JEREMY N", "date_of_visit": " August 2020", "rating": "5", "title": "My new favourite breakfast place", "comment": "What a great discovery. Cute place in an unlikely location off the Uxbridge Road near Shepherd’s Bush. Interesting and wide breakfast selection from “full English” though smashed avocado to Turkish, vegan +++. All delicious and great value. Staff brilliant. Friendly and welcoming even though it was packed. Go. You won’t be sorry."}
{"review_id": 158, "restaurant_id": 1, "username": "1YTTY", "date_of_visit": " November 2020", "rating": "5", "title": "Excellent Food & Service", "comment": "We had our first takeaway last night from Bombaylicious & we will be back for more. We totally enjoyed our meal. We chose Masala Lamb Chops, Bombay Butter Chicken, Dall Ghosh, Peshwari Naan, Steamed Rice all delicious. We would recommend that you try too!"}
{"review_id": 159, "restaurant_id": 7, "username": "TazeenaT", "date_of_visit": " September 2020", "rating": "5", "title": "Wonderful", "comment": "This cafe is the best kept local secret! Complete with a beautiful garden, lovely customer service as well as delicious and different food I couldn’t have asked for more. A fabulous brunch and dinner spot - thank you wild thyme!"}
{"review_id": 160, "restaurant_id": 7, "username": "699gemmap", "date_of_visit": " September 2020", "rating": "5", "title": "Great customer service!!!", "comment": "I decided to take my partner for brunch for his birthday and we had a lovely time.  I friendly welcome and quiet yet warm atmosphere. And we really enjoyed the cheese cake!!! And our brunch too of course!!! We will be visiting again!  Thank you!!"}
{"review_id": 161, "restaurant_id": 7, "username": "EdStennett", "date_of_visit": " September 2020", "rating": "5", "title": "A hidden gem in Shepherd’s", "comment": "A hidden gem in Shepherd’s Bush. I’ve lived here for a couple of years and saw a sign the other day. I looked on here and saw the sea of 5 star reviews and was slightly sceptical, I’ll be honest. I went for brunch with my girlfriend on a Sunday morning and it was honestly one of the nicest brunches I’ve had. It’s a small, very cosy eating area with really nice outside space. Service is excellent, friendly and attentive. The coffee is delicious and the food was so tasty! I had the vegetarian breakfast which was delicious. It was just a genuinely friendly, delicious enjoyable, 5 star experience in every way. If you are in the area, there’s no where better in my opinion. Have just booked in to try dinner next pay day!"}
{"review_id": 162, "restaurant_id": 7, "username": "henrymK4795RK", "date_of_visit": " October 2020", "rating": "5", "title": "Excellent cafe and restaurant", "comment": "Wild Thyme is an excellent cafe and restaurant  The brunch is great, and the dinner menu is original and tasty"}
{"review_id": 163, "restaurant_id": 7, "username": "HannahK000", "date_of_visit": " October 2020", "rating": "5", "title": "Amazing brunch and dinner spot in West London", "comment": "Amazing brunches that are extremely appetizing but the main star for this little café is their dinner service (Thursday to Sat) - inventive and incredible 'tapas' style plates that regularly get updated!"}
{"review_id": 164, "restaurant_id": 7, "username": "timedwards459", "date_of_visit": " October 2020", "rating": "5", "title": "Amazing Cocktails", "comment": "We had a fantastic tapas dinner with some absolutely delicious happy hour cocktails - great value, service and atmosphere!"}
{"review_id": 165, "restaurant_id": 7, "username": "camillac411", "date_of_visit": " September 2020", "rating": "5", "title": "Quaint & Delicious", "comment": "Wild Thyme is a real hidden gem in London. The service and atmosphere are both great, the dinner setting is romantic, the breakfast/lunch is delicious and all is very reasonably priced. Highly recommend- a treat in Shepherd’s Bush! "}
{"review_id": 166, "restaurant_id": 7, "username": "TimNG", "date_of_visit": " December 2020", "rating": "5", "title": "Back (Again) & Better Than Ever", "comment": "I went with my dog to re-visit the cafe after the second shut-down. They are still super organised with spacing and hygiene, which doesn't intrude on it's relaxed & friendly atmosphere. They've been busy during Lockdown II: there is new seating outside the front (as well as the garden) and a smart new awning. Like a Parisian cafe. Same lovely brunches and friendly welcome. I am very careful about distancing, masks, etc and this was my first eating out after Lockdown Two. I felt very comfortable and safe here."}
{"review_id": 167, "restaurant_id": 7, "username": "K8544QSpauli", "date_of_visit": " October 2020", "rating": "5", "title": "Superb little restaurant with excellent service", "comment": "Each time we've visited this charming little restaurant it has never failed to impress in terms of the quality of the food and the excellent service. The choice of tapas style dishes is very good and cannot recommend highly enough the homemade Muhammara, Greek Davos salad, the delicious Scallop Tartare and the Seabass along with a selection of Tempura dishes. The staff are very friendly and helpful as well as attentive but in a not too intrusive manner. It is slightly off the main road on a residential street but it very much deserves to be visited as you are guaranteed a lovely experience. Looking forward to our next visit."}
{"review_id": 168, "restaurant_id": 9, "username": "Ebond123", "date_of_visit": " October 2020", "rating": "4", "title": "Great service by Bianca!", "comment": "Had a lovely bottomless brunch in revolution on Saturday! Good service and great food and cocktails! Will definitely be returning :)"}
{"review_id": 169, "restaurant_id": 9, "username": "Neelam R", "date_of_visit": " October 2020", "rating": "5", "title": "Extra! Extra!", "comment": "By far the best service we had in so long. Raymond was absolutely amazing. He was very attentive. He paid attention to our needs, and really looked after us.  We came in for our anniversary, and he honestly made it one of our best. Thank you so much, we will definitely be back!"}
{"review_id": 170, "restaurant_id": 9, "username": "naniscol", "date_of_visit": " October 2020", "rating": "5", "title": "Sunday fun day", "comment": "We've had a great sunday! Thank you Milla by far the best service we had in so long. Lovely restaurant! "}
{"review_id": 171, "restaurant_id": 9, "username": "Aggy1990", "date_of_visit": " October 2020", "rating": "5", "title": "Loved the place", "comment": "I’ve spent Saturday in this lovely pub with friends and the service was amazing! The waitress Bianca very friendly and made us feel at home. We will come again!"}
{"review_id": 172, "restaurant_id": 9, "username": "Jade Amanda R", "date_of_visit": " October 2020", "rating": "5", "title": "BOTTOMLESS BRUNCH", "comment": "Had a fantastic bottomless brunch the staff were so interactive and fun enjoyed myself to the Mac thank you Abbey, Sophie, Milla and Ash❤️"}
{"review_id": 173, "restaurant_id": 9, "username": "130nathanr", "date_of_visit": " October 2020", "rating": "5", "title": "Sunday Brunch Day", "comment": "This place has an excellent atmosphere, good drinks, and good food. The waitress Milla is exceptional."}
{"review_id": 174, "restaurant_id": 9, "username": "sharnays", "date_of_visit": " October 2020", "rating": "1", "title": "Not nice", "comment": "I am not impressed with Ash . It is clear the staff have no or lack of leadership. My friends and I were told to leave due to a friend coming to greet us. The waitress then proceeded to say that she had told us ‘multiple times not to talk to people from other tables’. That was a lie. We were then told to leave immediately with plastic cups to put any drink in there. So instead of having a pleasant evening, it was disrupted because they can’t communicate properly."}
{"review_id": 175, "restaurant_id": 9, "username": "Hannah_kcj", "date_of_visit": " October 2020", "rating": "5", "title": "Halloween night", "comment": "Amazing time, milla served us the whole night and made it even better!!! Best bar in Richmond, no doubt"}
{"review_id": 176, "restaurant_id": 9, "username": "507lisamarier", "date_of_visit": " October 2020", "rating": "5", "title": "Milla was fantastic", "comment": "Had such a great Halloween night, will deffo be back!!! Milla just made the night even better, such a great member of staff!"}
{"review_id": 177, "restaurant_id": 6, "username": "RoryLinds", "date_of_visit": " December 2020", "rating": "5", "title": "Great with a capital G", "comment": "Good, good people, great food. Don't hesitate. The house pizza, La Dolce Vita, is out of this world. "}
{"review_id": 178, "restaurant_id": 6, "username": "carolinamacca", "date_of_visit": " December 2020", "rating": "5", "title": "Beautiful food, great value, lovely people.", "comment": "Just demolished a takeaway from La Dolce Vita. Delicious, stone baked calzone, a nice, tasty lasagne and melt-in-the-mouth pizzas, served with a friendly smile at a great price."}
